Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Transcriptor/Properties/Resources.*.resx
Languages: de

source: Add space
de: Leerzeichen

# AlphabetTooltip
source: The alphabet which is used in the Transcriptor
de: Das Alphabet, das im Transkriptor benutzt wird

# AlphabetTooltip2
source: It's possible to use a custom Alphabet
de: Es ist möglich, auch ein benutzerdefiniertes Alphabet zu benutzen.

source: Black
de: Schwarz

source: Blue
de: Blau

# CouldnotDisplayPicture
source: Could not display Picture: {0}
de: Konnte Bild nicht darstellen: {0}

# Error
source: Error: {0}
de: Fehler: {0}

# FirstSymbolOff
source: 1st symbol off
de: 1. Symbol aus

# FirstSymbolOn
source: 1st symbol on
de: 1. Symbol an

source: Generate
de: Generieren

source: Green
de: Grün

# ImageFileName
source: Image File
de: Bild Datei

# ImageHeader
source: Image
de: Bild

# ImageTooltip
source: The file which contains the image
de: Diese Datei enthält das Bild.

source: Likeliest symbol:
de: Wahrscheinlichstes Symbol:

source: Manually
de: Manuell

# ModeCaption
source: Mode
de: Modus

# ModeGroup
source: Mode
de: Modus

# ModeTooltip
source: Choose which mode should be used
de: Wähle die Betriebsart der Komponente aus.

source: New symbol
de: Neues Symbol

# PluginCaption
source: Transcriptor
de: Transkriptor

# PluginTooltip
source: Transcripts an image with symbols into a text
de: Transkribiert ein Bild mit Symbolen zu einem Text

# RectangleColorCaption
source: Rectangle color
de: Farbe des Rechtecks

# RectangleColorTooltip
source: Set the rectangle color
de: Wähle die Farbe des Rechtecks.

source: Red
de: Rot

# SelectedColorTooltip
source: Set the color of the selected rectangle
de: Wähle die Farbe des selektierten Rechtecks.

# SelectedRectangleColorCaption
source: Selected rectangle color
de: Farbe des selektierten Rechtecks

source: Selection
de: Auswahl

source: Semi-automatic
de: Semi-Automatisch

source: Space
de: Leerzeichen

# TextOutputName
source: Text output
de: Text Ausgang

# TextOutputTooltip
source: The generated text
de: Der generierte Text

# ThresholdCaption
source: Threshold
de: Grenze

# ThresholdTooltip
source: Set the threshold for the semi-automatic mode
de: Wähle die Grenze für den semi-automatischen Modus

source: White
de: Weiß

source: Yellow
de: Gelb
