Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/M138/Properties/Resources.*.resx
Languages: de

# ActionCaption
source: Encrypt / Decrypt
de: Entschlüsseln / Verschlüsseln

# ActionList1
source: Encrypt
de: Verschlüsseln

# ActionList2
source: Decrypt
de: Entschlüsseln

# ActionTooltip
source: Select whether you want to encrypt or decrypt the input.
de: Wähle aus, ob der eingegebene Text ver- oder entschlüsselt werden soll.

# CaseSensitivyCaption
source: Case sensitivity
de: Groß-/Kleinschreibung beachten

# CaseSensitivyTooltip
source: Select whether the device should work case sensitive or not.
de: Wähle aus, ob das Verfahren Groß- und Kleinschreibung beachten soll.

# InvalidCharacterHandlingCaption
source: Handling of invalid characters
de: Behandlung unbekannter Zeichen

# InvalidCharacterHandlingList1
source: Delete
de: Löschen

# InvalidCharacterHandlingList2
source: Ignore
de: Ignorieren

# InvalidCharacterHandlingList3
source: Replace by '?'
de: Ersetzen durch '?'

# InvalidCharacterHandlingTooltip
source: Select how invalid characters that are not supported by the used strips should be handled.
de: Wähle aus, wie unbekannte Zeichen im Text behandelt werden sollen.

# KeyCaption
source: Key
de: Schlüssel

# KeyTooltip
source: Key to be used for en-/decryption. Format should be "Strip_1, Strip_2,...,Strip_n / offset". Separator can be defined in the plugin's settings.
de: Der zu nutzende Schlüssel muss in folgendem Format angegeben werden: Streifen 1, Streifen 2, ... , Streifen 25 / Offset. Die Zeichen zur Trennung der Streifen und des Offsets können in den Einstellungen definiert werden.

# PluginTooltip
source: M-138, a strip cipher. This variant of a poly-alphabetic encryption was used by the US Armed Forces since 1934.
de: M-138, eine Streifen-Verschlüsselung (Strip-Cipher). Diese Variante einer polyalphabetischen Verschlüsselung wurde von der US-Armee seit 1934 benutzt.

# SeparatorOffCharCaption
source: Separator for offset
de: Offset Trennzeichen

# SeparatorOffCharTooltip
source: Separator used to separate the strips from the offset
de: Zeichen, das genutzt wird, um den Offset von den Streifen zu trennen

# SeparatorStripCaption
source: Separator for strips
de: Streifen Trennzeichen

# SeparatorStripTooltip
source: Separator that is used to separate the different strips used from each other
de: Zeichen, das genutzt wird, um die genutzten Streifen voneinander zu trennen

# StripsCaption
source: Strips
de: Streifen

# StripsTooltip
source: Enter the strips as string, where each line defines one strip.
de: Geben Sie die zu verwendenden Streifen als String ein, wobei jeder Streifen in einer Zeile steht.

# TextInputCaption
source: Text Input
de: Texteingabe

# TextInputTooltip
source: Connect the text that should be encrypted/decrypted.
de: Text, der ver- oder entschlüsselt werden soll

# TextOutputCaption
source: Text Output
de: Textausgabe

# TextOutputTooltip
source: Resulting ciphertext/plaintext
de: Resultierender Klartext/Geheimtext
