Repository: CrypToolProject/CrypTool-2
Catalog: CrypCloud/CrypCloudManager/Properties/Resources.*.resx
Languages: de, ru

# _Password_label
source: Password:
de: Passwort:
ru: Пароль:

# _Email_label
source: Email:
ru: Эл. адрес:

# _Type
source: Job Type :
de: Art des Jobs:
ru: Тип вакансии :

# _BackBtn
source: Back
de: Zurück
ru: назад

# _AbortBtn
source: Abort
de: Abbrechen
ru: аборт

# _WorkspacePath
source: Workspace :
ru: Рабочее пространство :

# _NextBtn
source: Next
de: Weiter
ru: следующий

# _Password_confirm_label
source: Confirm:
de: Bestätigen
ru: Подтверждение:

# _ConnectingError
source: Something went wrong :(
de: Verbindung zum Server nicht möglich.
ru: Что-то пошло не так :(

# _Connecting_label
source: Connection to server. Please wait
de: Die Verbindung zum Server wird aufgebaut. Bitte warten Sie.
ru: Подключение к серверу. пожалуйста, подождите

# _CreateAccount_enterAccountData
source: Please enter your account data below.
de: Bitte geben Sie Ihre Accountdaten ein.
ru: Пожалуйста, введите данные своей учетной записи ниже.

# _CreateAccount_successHeader
source: Account successfully requested.
de: Ihr Account wurde erfolgreich erstellt.
ru: Аккаунт успешно запрошен.

# _CreateAccount_successText
source: Account successfully requested.
de: Ihr Account wurde erfolgreich erstellt.
ru: Аккаунт успешно запрошен.

# _CreateAccount_Title
source: Create a new account
de: Neuen Account erstellen
ru: Создать новый аккаунт

# _CreateJob_Description_label
source: Description:
de: Beschreibung:
ru: Описание:

# _CreateJob_Header
source: Create a new job
de: Neuen Job erstellen
ru: Создать новую работу

# _CreateJob_Name_label
source: Name:
ru: Имя:

# _CreateJob_uploadBtn
source: Upload
ru: Загрузить

# _CreateJob_WorkspacePath_label
source: Path to workspace:
de: Workspace Pfad:
ru: Путь к рабочему пространству:

# _enterVerificationCode
source: Please enter the verification code.
de: Bitte geben Sie den Verifizierungscode ein.
ru: Введите проверочный код.

# _JobList_btn_createNew
source: Create new job
de: Neu
ru: Создать новую работу

# _JobList_btn_delete
source: Delete
de: Löschen
ru: Удалить

# _JobList_btn_open
source: Open
de: Öffnen
ru: открыто

# _JobList_btn_refresh
source: Refresh
de: Aktualisieren
ru: обновление

# _JobList_col_Creator
source: Creator
de: Ersteller
ru: творец

# _JobList_col_Name
source: Job name
ru: Название работы

# _JobList_col_Progress
source: Progress
de: Fortschritt
ru: Прогресс

# _JobList_Header
source: CrypCloud – Job List
de: CrypCloud – Job-Liste
ru: CrypCloud – Список заданий

# _Login_btn_connect
source: Connect
de: Verbinden
ru: соединять

# _Login_link_createNewAccount
source: Create a new account
de: Neuen Account erstellen
ru: Создать новый аккаунт

# PluginTooltip
source: A P2P based volunteer cloud solution
de: Eine P2P-basierte Volunteer-Cloud
ru: Рациональное облачное решение на основе P2P

# _Login_link_ForgotPassword
source: Forgot password
de: Passwort vergessen
ru: Забыли пароль

# _Login_subheader
source: A P2P based volunteer cloud solution
de: Eine P2P-basierte Volunteer-Cloud
ru: Рациональное облачное решение на основе P2P

# _ResetPW_enterData
source: Enter your account data below to reset your password.
de: Geben Sie Ihre Accountdaten an, um Ihr Passwort zurückzusetzen.
ru: Введите данные своей учетной записи ниже, чтобы сбросить пароль.

# _ResetPW_enterVerificationData
source: We have send an verification email to the email address of the account.
de: Ein Verifizierungscode wurde an die Email-Adresse Ihres Accounts verschickt.
ru: Мы отправили электронное письмо с подтверждением на адрес электронной почты.

# _ResetPW_Header
source: Reset Password
de: Passwort zurücksetzen
ru: Сброс пароля

# _ResetPW_successHeader
source: Password Reset Successful
de: Zurücksetzen Erfolgreich!
ru: Успешное восстановление пароля

# _ResetPW_successText
source: Your password has been reset. You may now login with your new password.
de: Ihr Passwort wurde zurückgesetzt. Sie können sich nun mit Ihrem neuen Passwort anmelden.
ru: Ваш пароль был сброшен. Теперь вы можете войти с новым паролем.

# _verificationCode_label
source: Verification Code:
de: Verifizierungscode:
ru: Код подтверждения:

# _VerifyBtn
source: Verify
de: Bestätigt
ru: проверить

# _Username_label
source: Name:
ru: Имя:

# _JobList_col_Id
source: Job ID
ru: ID задания

# Stop_Running_Jobs_Before_Logout
source: Logout failed. Please stop all running jobs.
de: Ausloggen fehlgeschlagen! Bitte beenden Sie alle laufenden Berechnungen.
ru: Ошибка выхода из системы. Пожалуйста, остановите все текущие задания.

# _JobList_jobDescription
source: Description:
de: Beschreibung:
ru: Описание:

# _JobList_jobName
source: Job name:
ru: Название работы:

# _JobList_btn_logout
source: Logout
de: Abmelden
ru: Выйти

# AmountOfWorker_Settings
source: Amount of workers:
de: Anzahl der Arbeitsthreads:
ru: Количество работников:

# _JobList_btn_download
source: Load
de: Laden
ru: нагрузка

# _JobList_col_Date
source: Date
de: Datum
ru: Дата

# _JobList_EpochProgress
source: Epoch:
de: Epoche:
ru: Эпоха:

# _ResetPW_enterVerificationData_2
source: Please enter the verification code and your new password below.
de: Bitte geben Sie den Code und ihr neues Passwort ein.
ru: Введите код подтверждения и новый пароль ниже.

# _Confirm_Job_Deletion_Text
source: The job will be permanently removed from the cloud. The result and progress will be lost. Are you sure?
ru: Работа будет удалена из облака навсегда. Результат и прогресс будут потеряны. Ты уверен?

# _Confirm_Job_Deletion_Title
source: Confirm job deletion.
ru: Подтвердите удаление задания.

# _Remember_me
source: Save login data
de: Zugangsdaten speichern
ru: Сохранить данные для входа

# _JobList_LoggedInAs
source: Logged in as:
de: Eingeloggt als:
ru: Вы вошли как:

# _infoVerificationCode
source: A verification code was sent to the provided email address.
de: Ein Verifizierungscode wurde an die angegebene Email-Adresse gesendet.
ru: Код подтверждения был отправлен на указанный адрес электронной почты.

# _JobList_helpText
source: Click on one of the open buttons to participate in a job.
de: Klicken Sie auf einen der "Öffnen"-Buttons, um an einem Job teilzunehmen.
ru: Нажмите на одну из открытых кнопок, чтобы участвовать в задании.

# _JobList_JobId
source: Job ID:
ru: Идентификатор работы:

source: Write performance log
de: Schreibe Performance-Log
ru: Журнал производительности записи

# _JobList_col_JobSize
source: Size
de: Größe
ru: Размер

# _Remember_me_tooltip
source: Username and password will be saved encrypted and restored at the next startup of CrypCloud.
de: Benutzername und Passwort werden verschlüsselt gespeichert und beim nächsten Starten von CrypCloud automatisch wiederhergestellt.
ru: Имя пользователя и пароль будут сохранены в зашифрованном виде и восстановлены при следующем запуске CrypCloud.

# JobList_btn_delete_tooltip
source: Delete the job from CrypCloud
de: Löscht den Job aus der CrypCloud
ru: Удалить задание из CrypCloud

# _JobList_btn_createNew_tooltip
source: Create a new job and upload it to CrypCloud
de: Erstellt einen neuen Job und lädt ihn in die CrypCloud hoch
ru: Создайте новое задание и загрузите его в CrypCloud

# _JobList_btn_refresh_tooltip
source: Refresh the joblist by requesting joblists of neighbor peers
de: Aktualisiert die Jobliste, indem Joblisten von Nachbar-Peers angefordert werden
ru: Обновите список заданий, запросив список рабочих мест соседей-сверстников

# JobList_btn_download_tooltip
source: Download the job from CrypCloud
de: Lädt den Job aus der CrypCloud herunter
ru: Загрузите задание из CrypCloud

# JobList_btn_logout_tooltip
source: Closes the connection to CrypCloud
de: Beendet die Verbindung mit der CrypCloud
ru: Закрывает соединение с CrypCloud

# JobList_btn_open_tooltip
source: Open the job to participate in calculations. To start the computation in the newly opened workspace press the Play button.
de: Öffnet den Job, um an der Berechnung teilzunehmen. Zum Starten der Berechnung muss in dem neu geöffneten Workspace der Starten-Button gedrückt werden.
ru: Откройте работу для участия в расчетах. Чтобы начать вычисление в недавно открытом рабочем пространстве, нажмите кнопку «Воспроизвести».

source: IP Address
de: IP-Adresse
ru: Айпи адрес

source: Peer Id
ru: Идентификатор сверла

source: Port
ru: порт

source: Copy job information
de: Kopiere Job-Informationen
ru: Копировать информацию о работе

# _JobList_instructions
source: a) The list above contains long-running jobs which can be solved faster by running parallel sub-jobs. So different people can contribute by running the same job and computing different sub-jobs on their computers. b) Select a job in the list and click "Open" to contribute. d) After clicking "Open" the according job is downloaded and opened in a new CT2 workspace tab. e) Please click "Play" (F5) to run the downloaded CT2 workspace in the new tab. The CrypCloud component in the workspace then shares the results with all other participating contributors. If someone of the contributors found a solution, this solution is also shared with all others and is immediately visible. There is no information shared about the contributors themselves. The list below contains all peers (IP-address and port), which this computer is currently connected to.
de: Die obige Liste enthält Jobs mit langer Laufzeit, die durch die Ausführung paralleler Sub-Jobs schneller gelöst werden können. So können sich verschiedene Personen an demselben Job beteiligen und verschiedene Sub-Jobs auf ihren Computern bearbeiten: a) Um sich zu beteiligen, wählen Sie einen Job in der Liste aus und klicken Sie auf "Öffnen". b) Nach Klick auf "Öffnen" wird der entsprechende Job heruntergeladen und in einer neuen Registerkarte in einem neuen CT2-Workspace (Arbeitsbereich) geöffnet. c) Klicken Sie dann auf "Starten" (F5), um den heruntergeladenen CT2-Arbeitsbereich in der neuen Registerkarte auszuführen. Die CrypCloud-Komponente im Arbeitsbereich teilt dann die Ergebnisse mit allen anderen beteiligten Mitwirkenden. Wenn einer der Mitwirkenden eine Lösung gefunden hat, wird diese Lösung auch für alle anderen freigegeben und ist sofort sichtbar. Es werden keine Informationen über die Mitwirkenden selbst weitergegeben. Die folgende Liste enthält alle Peers (IP-Adresse und Port), mit denen dieser Computer derzeit direkt verbunden ist.
ru: a) Этот список содержит долго выполняющиеся задания, которые можно решить быстрее, запустив параллельные подзадачи. Это позволяет различным людям вносить свой вклад, выполняя одну и ту же работу и работая над разными подзадачами на своих компьютерах. б) Выберите работу в списке и нажмите «Открыть», чтобы внести свой вклад. d) После нажатия «Открыть», соответствующее задание загружается и открывается на новой вкладке в новом CT2 Workspace Manager. e) Нажмите «Play» (F5), чтобы запустить загруженное рабочее пространство CT2 на новой вкладке. Затем компонент CrypCloud в рабочей области делится результатами со всеми другими участниками. Если один из участников нашел решение, это решение будет передано всем остальным и будет сразу же видно. Нет информации о самих участниках. Список ниже содержит все одноранговые узлы (IP-адрес и порт), к которым в данный момент подключен этот компьютер.

# _Login_anonymous
source: To login without registration use "anonymous/anonymous".
de: Um sich ohne Registrierung einzuloggen, benutzen Sie "anonymous/anonymous".
ru: Для входа без регистрации используйте «anonymous/anonymous».

source: Copy
de: Kopieren
ru: копия

# _JobList_col_Action
source: Action
de: Aktion
ru: действие

# CrypCloudSettingsTitle
source: CrypCloud settings
de: CrypCloud-Einstellungen
ru: CrypCloud настройки

source: General
de: Allgemein
ru: в целом

# _JobList_bitmask
source: Bitmask:
de: Bitmaske:
