Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/AESVisualization/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# inputKeyDescription
source: Input of the key used for the encryption
de: Eingabe des Schlüssels, der für die Verschlüsselung verwendet wird
ru: Ввод ключа, используемого для шифрования
zh_cn: 输入用于加密的密钥

# inputKeyName
source: Key input
de: Schlüsseleingabe
ru: Ввод ключа
zh_cn: 按键输入

# inputTextDescription
source: Input of the text that is to be encrypted
de: Eingabe des Textes, der verschlüsselt werden soll.
ru: Ввод текста, который должен быть зашифрован
zh_cn: 输入要加密的文本

# inputTextName
source: Text input
de: Texteingabe
ru: Ввод текста
zh_cn: 文字输入

# KeysizeCaption
source: Keysize
de: Schlüsselgröße
zh_cn: 密钥大小

# KeysizeTooltip
source: Select the size of the key.
de: Geben Sie die Größe des Schlüssels an.
ru: Выберите размер ключа.
zh_cn: 选择密钥的大小。

# OutputStreamCaption
source: Text output
de: Textausgabe
ru: Вывод текста
zh_cn: 文字输出

# OutputStreamTooltip
source: Output of the ciphertext
de: Ausgabe des Geheimtextes
ru: Вывод зашифрованного текста
zh_cn: 密文输出

# PluginCaption
source: AES Visualization
de: AES-Visualisierung
ru: Визуализация AES
zh_cn: AES可视化

# PluginTooltip
source: Visualization of AES encryption
de: Visualisierung der AES-Verschlüsselung
ru: Визуализация шифрования AES
zh_cn: AES加密的可视化

# addKeyButton
source: Add Key
ru: Добавить ключ
zh_cn: 新增金钥

# addKeyExplanation
source: The round key is added to the current state by XORing the bytes.
de: Der Rundenschlüssel wird addiert, indem die einzelnen Bytes miteinander per XOR verrechnet werden.
ru: Круглый ключ добавляется в текущее состояние посредством XORing байтов.
zh_cn: 通过对字节进行XOR运算，将回合密钥添加到当前状态。

# autoButton
source: Auto
ru: Авто
zh_cn: 汽车

# encButton
source: Skip Expansion
de: Zur Verschlüsselung
ru: Пропустить расширение
zh_cn: 跳过扩展

# encryptionIntro1
source: Encryption
de: Verschlüsselung
ru: шифрование
zh_cn: 加密

# encTextBlock
source: Encryption
de: Verschlüsselung
ru: шифрование
zh_cn: 加密

# endButton
source: End
de: Ende
ru: Конец
zh_cn: 结束

# expansionExplanation
source: First, the last four bytes of the previous key are taken. Afterwards, the last byte is placed at the front.
de: Zuerst werden die letzten vier Bytes des vorherigen Schlüssels genommen und das letzte Byte an den Anfang gestellt.
ru: Сначала берутся последние четыре байта предыдущего ключа. Впоследствии последний байт помещается спереди.
zh_cn: 首先，获取上一个密钥的最后四个字节。之后，最后一个字节放在最前面。

# expansionExplanation1
source: Every byte in the state matrix is exchanged with the corresponding byte from the S-box.
de: Jedes Byte der State-Matrix wird mit dem entsprechenden Byte aus der S-Box ausgetauscht.
ru: Каждый байт обменивается с соответствующим байтом из S-box.
zh_cn: 每个字节都与S-box中的相应字节交换。

# expansionExplanation2
source: A round constant is added.
de: Die Rundenkonstante wird addiert.
ru: Добавляется круглая константа.
zh_cn: 添加一个舍入常数。

# expansionExplanation3
source: Adding the first four bytes of the previous key gives you the first four bytes of the next key.
de: Die ersten vier Bytes des vorherigen Schlüssels werden addiert. Das Ergebnis sind die ersten vier Bytes des neuen Schlüssels.
ru: Добавление первых четырех байтов предыдущего ключа дает первые четыре байта следующего ключа.
zh_cn: 将上一个键的前四个字节相加即可得到下一个键的前四个字节。

# expansionExplanation4
source: For column x of the new key you XOR column x from the previous key with column x-1 from the new key.
de: Für Spalte x des neuen Schlüssels wird Spalte x des vorherigen Schlüssels mit Spalte x-1 des neuen Schlüssels per XOR verrechnet.
ru: Для столбца x нового ключа вы столбец XOR x из предыдущего ключа с столбцом x-1 из нового ключа.
zh_cn: 对于新密钥的x列，您可以将前一个密钥的x列与新密钥的x-1列进行XOR运算。

# expansionIntro1
source: Key Expansion
de: Schlüsselerweiterung
ru: Расширение ключа
zh_cn: 关键扩展

# expButton
source: To Expansion
de: Zur Expansion
ru: К расширению
zh_cn: 扩展

# expTextBlock
source: Expansion
ru: расширение
zh_cn: 扩张

# initialRoundTextBlock
source: Initial Round
de: Initialrunde
ru: Начальный раунд
zh_cn: 首轮比赛

# introduction
source: Advanced Encryption Standard
ru: Расширенный стандарт шифрования
zh_cn: 先进的加密标准

# introduction2
source: Visualization of this modern block cipher
de: Visualisierung dieser modernen Blockchiffre
ru: Визуализация этого современного блочного шифрования
zh_cn: 可视化这种现代分组密码

# mixColButton
source: Mix Col.
zh_cn: 混合色

# mixColExplanation
source: One column is taken from the current state and placed next to the multiplication matrix.
de: Eine Spalte des aktuellen Zustandes wird genommen und neben der Multiplikationsmatrix platziert.
ru: Один столбец берется из текущего состояния и помещается рядом с матрицей умножения.
zh_cn: 从当前状态中取出一列，并将其放在乘法矩阵的旁边。

# mixColExplanation1
source: Then it is multiplied with the multiplication matrix to determine the next column of the next state.
de: Danach wird sie mit der Multiplikationsmatrix verrechnet, um die nächste Spalte des nächsten Zustandes zu ermitteln.
ru: Затем он умножается на матрицу умножения, чтобы определить следующий столбец следующего состояния.
zh_cn: 然后将其与乘法矩阵相乘，以确定下一状态的下一列。

# playButton
source: Next
ru: следующий
zh_cn: 下一个

# prevOperationButton
source: Prev. Operation
de: Vorherige Operation
ru: Пред. операция
zh_cn: 上一个运作方式

# prevRoundButton
source: Prev. Round
de: Vorherige Runde
ru: Пред. Круглый
zh_cn: 上一个回合

source: Round 1
de: Runde 1
ru: Раунд 1
zh_cn: 第1轮

source: Round 10
de: Runde 10
ru: Раунд 10
zh_cn: 第十回合

source: Round 11
de: Runde 11
ru: 11 раунд
zh_cn: 回合11

source: Round 12
de: Runde 12
ru: Круглый 12
zh_cn: 第十二回合

source: Round13
de: Runde13
zh_cn: 回合13

source: Round14
de: Runde14
zh_cn: 回合14

source: Round 2
de: Runde 2
ru: Раунд 2
zh_cn: 第二回合

source: Round 3
de: Runde 3
ru: Раунд 3
zh_cn: 第三回合

source: Round 4
de: Runde 4
ru: Раунд 4
zh_cn: 第四回合

source: Round 5
de: Runde 5
ru: Раунд 5
zh_cn: 第五回合

source: Round 6
de: Runde 6
ru: Круглый 6
zh_cn: 第六回合

source: Round 7
de: Runde 7
ru: Раунд 7
zh_cn: 第七回合

source: Round 8
de: Runde 8
ru: Раунд 8
zh_cn: 第八回合

source: Round 9
de: Runde 9
ru: Круглый 9
zh_cn: 第9回合

# shiftRowButton
source: Shift Row
zh_cn: 排档

# shiftRowExplanation
source: First, the second row is shifted once to the left. Then, the third row is shifted twice towards the left, and finally the forth row is shifted three times to the left. The overlapping bytes are transferred to the right to form a 4 x 4 matrix.
de: Zuerst werden die Zeilen der Matrix nach links verschoben: die erste Zeile um 0, die zweite um 1, die dritte um 2 und die vierte um 3 Spalten. Danach werden die überstehenden Bytes nach rechts übertragen, um wieder eine 4 x 4 Matrix zu bilden.
ru: Во-первых, вторая строка сдвигается один раз влево. Затем третья строка сдвигается дважды влево, и, наконец, четвертая строка сдвигается три раза влево. Перекрывающиеся байты передаются вправо для формирования матрицы 4 x 4.
zh_cn: 首先，第二行向左移动一次。然后，第三行向左移动两次，最后第四行向左移动三次。重叠的字节向右转移以形成4 x 4矩阵。

# skipOperationButton
source: Skip Operation
de: Operation überspringen
ru: Пропустить операцию
zh_cn: 跳过操作

# skipRoundButton
source: Skip Round
de: Runde überspringen
ru: Пропустить раунд
zh_cn: 跳过回合

# startButton
source: Start
ru: Начало
zh_cn: 开始

# subBytesButton
source: Sub Bytes
ru: Суббайты
zh_cn: 子字节

# subBytesExplanation
source: First, a byte is transferred from the state matrix to the transition spot and split up.
de: Zuerst wird ein Byte aus der Zustandsmatrix genommen und aufgeteilt.
ru: Во-первых, байт переносится из матрицы состояний в пятно перехода и разбивается.
zh_cn: 首先，将一个字节从状态矩阵传输到过渡点并拆分。

# subBytesExplanation1
source: The corresponding byte in the S-box is determined and placed into the result matrix.
de: Das entsprechende Byte aus der S-Box wird ermittelt und in die Ergebnismatrix übertragen.
ru: Соответствующий байт в S-поле определяется и помещается в матрицу результатов.
zh_cn: 确定S-box中的相应字节并将其放入结果矩阵。

# resultTextBlock
source: Result
de: Ergebnis
ru: результат
zh_cn: 结果

# introTextBlock
source: AES is a modern block cipher. AES takes two inputs: the plaintext that is to be encrypted and a key. After the encryption AES outputs the ciphertext.
de: AES ist eine moderne Blockchiffre. Es gibt zwei Eingabewerte: zum einen den Klartext, der verschlüsselt werden soll, und zum anderen den Schlüssel. Nach der Verschlüsselung gibt AES den Geheimtext aus.
ru: AES - это современный блок-шифр. AES использует два входа: открытый текст, который должен быть зашифрован, и ключ. После шифрования AES выводит зашифрованный текст.
zh_cn: AES是一种现代的分组密码。 AES接受两个输入：要加密的纯文本和一个密钥。加密后，AES输出密文。

# introTextBlock1
source: AES starts with the "Key Expansion" in which round keys are derived from the original key. After the expansion an initial round takes place, in which the original key is applied to the plaintext. Depending on the key length the algorithm will go through 9, 11, or 13 rounds. Each round consists of the four operations: "SubBytes", "ShiftRow", "MixColumns", and "AddRoundKey". Once these rounds are completed one last round is performed, which has no "MixColumn" step.
de: AES beginnt mit der Schlüsselexpansion, in der die Rundenschlüssel vom Hauptschlüssel abgeleitet werden. Danach gibt es eine Initialrunde, in der der Hauptschlüssel mit dem Klartext verrechnet wird. Als nächstes gibt es -- abhängig von der Schlüssellänge -- 9, 11 oder 13 Hauptrunden. Jede Runde besteht aus vier Operationen: "SubBytes", "ShiftRow", "MixColumns" und "AddRoundKey". Nachdem diese Runden abgeschlossen sind, gibt es noch eine letzte Runde ohne "MixColumns"-Operation.
ru: AES начинается с «Key Expansion», в котором круглые клавиши производятся от исходного ключа. После расширения начинается первоначальный раунд, в котором исходный ключ применяется к открытому тексту. В зависимости от длины ключа алгоритм будет проходить через 9, 11 или 13 раундов. Каждый раунд состоит из четырех операций: «SubBytes», «ShiftRow», «MixColumns» и «AddRoundKey». Как только эти раунды завершены, выполняется последний раунд, который не имеет шага «MixColumn».
zh_cn: AES以“密钥扩展”开头，其中圆形密钥是从原始密钥派生的。扩展后，将进行初始回合，其中原始密钥将应用于明文。根据密钥长度，算法将经过9、11或13轮。每个回合包含四个操作：“ SubBytes”，“ ShiftRow”，“ MixColumns”和“ AddRoundKey”。一旦完成这些回合，就执行最后一个回合，该回合没有“ MixColumn”步骤。

source: Back
de: Zurück
ru: назад
zh_cn: 背部

# intro1
source: Intro
ru: вступление
zh_cn: 介绍

# IntroText
source: Intro
ru: вступление
zh_cn: 介绍

source: Ciphertext
de: Geheimtext
ru: зашифрованный
zh_cn: 密文

# KeyText
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

source: Plaintext
de: Klartext
ru: Простой текст
zh_cn: 纯文本
