Repository: CrypToolProject/CrypTool-2
Catalog: CrypWin/Resources/Resource.*.resx
Languages: de, zh_cn

source: Analysis
de: Analyse
zh_cn: 分析

source: Author
de: Autor
zh_cn: 作者

# email_subject
source: CrypTool 2 -> Component:
de: CrypTool 2 -> Komponente:
zh_cn: CrypTool 2-&gt;组件：

# PluginManager_TypeLoadException
source: Can't load the component:
de: Komponente kann nicht geladen werden:
zh_cn: 无法加载组件：

# plugin_has_no_icon
source: Can't get icon from component: {0}. Component can't be used.
de: Kein Icon in Komponente: {0}. Komponente kann nicht benutzt werden.
zh_cn: 无法从组件{0}获取图标。组件无法使用。

# plugin_no_algo_settings
source: Component has no parameters.
de: Diese Komponente hat keine Parameter.
zh_cn: 组件没有参数。

source: Title
de: Titel
zh_cn: 标题

source: Write email to author.
de: Schreibe E-Mail an den Autor.
zh_cn: 写电子邮件给作者。

source: Go to:
de: Gehe zu:
zh_cn: 去：

source: Affiliation
de: Zugehörigkeit
zh_cn: 联系

# HTML_fileFilter
source: HTML Files (*.html)|*.html
de: HTML-Dateien (*.html)|*.html
zh_cn: HTML文件（* .html）| * .html

# adjusting_selection_both
source: Adjusting algorithm selection to RibbonTab and NavigationPane.
zh_cn: 将算法选择调整为RibbonTab和NavigationPane。

# adjusting_selection_navipane
source: Adjusting algorithm selection to NavigationPane.
zh_cn: 将算法选择调整为NavigationPane。

# adjusting_selection_ribbon
source: Adjusting algorithm selection to RibbonTab.
zh_cn: 将算法选择调整为RibbonTab。

source: Delete
de: Löschen
zh_cn: 删除

# missing_plugin_info_attribute
source: Missing PluginInfoAttribute on component: {0}
de: Vermisse PluginInfoAttribute an Komponente: {0}
zh_cn: 组件{0}上缺少PluginInfoAttribute

# tutorial_file_not_available
source: The tutorial file is not available.
de: Die Tutorialdatei ist nicht verfügbar.
zh_cn: 教程文件不可用。

# pluginManager
source: Component Manager
de: Komponentenverwalter
zh_cn: 组件经理

# found_new_plugins
source: Found new components: {0}
de: Neue Komponenten gefunden: {0}
zh_cn: 找到了新组件：{0}

# no_new_plugins_found
source: Can't find new components.
de: Kann neue Komponente nicht finden.
zh_cn: 找不到新的组件。

# plugin_signature
source: Component signature: unknown signer or not signed
de: Komponentensignatur: unbekannter Signierer oder nicht signiert
zh_cn: 组件签名：未知签名者或未签名

# plugin_version
source: Component version:
de: Komponentenversion:
zh_cn: 组件版本：

# show_plugin_description
source: Show description
de: Zeige Beschreibung
zh_cn: 显示说明

source: Classic Ciphers
de: Klassische Chiffre
zh_cn: 经典密码

source: _Show Quick Access Toolbar below the Ribbon
de: Zeige _Schnellzugriff-Werkeugleiste unter dem Ribbon
zh_cn: _在功能区下方显示快速访问工具栏

source: started and ready!
de: gestartet und bereit!
zh_cn: 准备好了！

source: Copy to clipboard
de: Kopiere in Zwischenablage
zh_cn: 复制到剪贴板

# plugin_has_no_description
source: This component has no description.
de: Diese Komponente hat keine Beschreibung.
zh_cn: 该组件没有描述。

# no_plugin_info_attribute
source: Component "{0}" has no plugin info attribute and will not be added to GUI.
de: Komponente "{0}" hat kein Komponenten-Infoattribut und wird nicht zur GUI hinzugefügt.
zh_cn: 组件“ {0}”没有插件信息属性，因此不会添加到GUI。

# autostart_enabled
source: Workspace has been started automatically due to the command line option.
de: Der Arbeitsbereich wurde automatisch gestartet aufgrund der Kommandozeilenoption.
zh_cn: 由于命令行选项，工作区已自动启动。

# workspace_loading
source: Using {0} as a workspace file and loading it into the editor.
de: Benutze {0} als Arbeitsbereichsdatei und lade es in den Editor.
zh_cn: 使用{0}作为工作空间文件并将其加载到编辑器中。

# MainWindow_ShowHelpPage_Error_trying_to_open_documentation___0__
source: Error trying to open documentation: {0}!
de: Fehler während des Versuchs, die Dokumentation zu laden: {0}!
zh_cn: 尝试打开文档时出错：{0}！
