Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Contains/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# building_search_structure
source: Building search structure now. This may take a few seconds...
de: Die Such-Struktur wird erzeugt. Dies kann einige Sekunden dauern...
ru: Создание структуры поиска сейчас. Это может занять несколько секунд ...
zh_cn: 现在建立搜寻结构。这可能需要几秒钟的时间...

# PluginCaption
source: Contains
de: Wörterbuch-Suche
ru: Содержит
zh_cn: 包含

# PluginTooltip
source: Searches strings in a dictionary
de: Suche Wörter in einer Wortliste oder einem Text
ru: Ищет строки в словаре
zh_cn: 搜索字典中的字符串

# finished_building_search_structure
source: ...finished builing search structure in: "{0}" seconds.
de: ...Such-Struktur fertig in "{0}" Sekunden.
ru: ... законченная структура поиска в блоке: «{0}» секунд.
zh_cn: ...以“ {0}”秒为单位完成了builing搜索结构。

source: No dictionary.
de: Kein Wörterbuch.
ru: Нет словаря.
zh_cn: 没有字典。

source: No input string.
de: Kein Suchwort.
ru: Нет входной строки.
zh_cn: 没有输入字符串。

# InputStringCaption
source: Input
de: Eingabe
ru: вход
zh_cn: 输入值

# InputStringTooltip
source: Word list or text in which to search for the search words.
de: Wortliste oder Text, in dem nach den angegebenen Suchworten gesucht werden soll.
ru: Список слов или текст, в котором нужно искать слова поиска.
zh_cn: 在其中搜索搜索词的单词列表或文本。

# DictionaryInputStringCaption
source: Search word
de: Suchwort
ru: Поисковое слово
zh_cn: 搜索词

# DictionaryInputStringTooltip
source: Word or list of words for which to search in the input.
de: Wort oder Liste von Worten, nach denen in der Eingabe gesucht werden soll (durch Angabe eines Trennzeichens können mehrere Suchworte spezifiziert werden).
ru: Word или список слов для поиска на вкладке.
zh_cn: 在输入中要搜索的单词或单词列表。

# HitsCaption
source: Number of hits to find.
de: Anzahl der zu findenden Treffer
ru: Количество просмотров.
zh_cn: 查找的命中数。

# HitsTooltip
source: Search method needs to find n hits to return true.
de: Anzahl der Treffer, die die Suche mindestens finden muss, damit das Plugin 'wahr' zurückgibt.
ru: Метод поиска должен найти n хитов, чтобы вернуть true.
zh_cn: 搜索方法需要找到n个匹配项才能返回true。

# ResultCaption
source: Search result
de: Suchergebnis
ru: Результат поиска
zh_cn: 搜索结果

# ResultTooltip
source: The search result is based on the current input and the given parameters.
de: Das Suchergebnis hängt von der momentanen Eingabe und den gegebenen Parametern ab.
ru: Результат поиска основан на текущем вводе и заданных параметрах.
zh_cn: 搜索结果基于当前输入和给定的参数。

# HitCountCaption
source: Number of Hits
de: Anzahl der Treffer
ru: Количество хитов
zh_cn: 命中数

# HitCountTooltip
source: The search result is based on the current input and the given parameters.
de: Das Suchergebnis hängt von der momentanen Eingabe und den gegebenen Parametern ab.
ru: Результат поиска основан на текущем вводе и заданных параметрах.
zh_cn: 搜索结果基于当前输入和给定的参数。

# CountWordsOnlyOnceCaption
source: Count each word only once
de: Zähle jedes Wort nur einmal
ru: Подсчитайте каждое слово только один раз
zh_cn: 每个字只计数一次

# CountWordsOnlyOnceTooltip
source: Count each word only once (even if the same word appears several times)
de: Zähle jedes Wort nur einmal (selbst wenn es mehrfach auftritt)
ru: Считайте каждое слово только один раз (даже если одно и то же слово появляется несколько раз)
zh_cn: 每个单词仅计数一次（即使同一单词出现几次）

# DelimiterDictionaryCaption
source: Delimiter Search words
de: Trennzeichen Suchworte
ru: Разделитель Поисковые слова
zh_cn: 分隔符搜索词

# DelimiterDictionaryTooltip
source: The delimiter for the 'Search word' input to split up the words.
de: Trennzeichen, das die Suchwort-Eingabe in Liste von Worten zerlegt
ru: Разделитель для ввода слова «Поиск слова» для разделения слов.
zh_cn: “搜索词”输入的定界符，用于分割词。

# DelimiterInputStringCaption
source: Delimiter Input
de: Trennzeichen Eingabe
ru: Ввод разделителя
zh_cn: 定界符输入

# DelimiterInputStringTooltip
source: The delimiter for the input text to split up the words.
de: Trennzeichen, das den Eingabetext in Liste von Worten zerlegt
ru: Разделитель входного текста разделяет слова.
zh_cn: 输入文本的分隔符，用于拆分单词。

# HitPercentFromInputStringCaption
source: Hits as percent value
de: Trefferzahl als Prozentwert
ru: Хиты как процентное значение
zh_cn: 命中百分比值

# HitPercentFromInputStringTooltip
source: Hits value is interpreted as percent value based on input string.
de: Die Trefferzahl wird als ein vom Eingabetext abhängiger Prozentwert interpretiert.
ru: Значение хитов интерпретируется как процентное значение на основе входной строки.
zh_cn: 命中值被解释为基于输入字符串的百分比值。

# SearchSettingCaption
source: Search Type
de: Suchmethode
ru: Тип поиска
zh_cn: 搜索类型

# SearchSettingTooltip
source: Select search method.
de: Wählen Sie die Suchmethode.
ru: Выберите метод поиска.
zh_cn: 选择搜索方式。

# ToLowerCaption
source: Ignore case
de: Groß-/Kleinschreibung ignorieren
ru: Игнорировать дело
zh_cn: 忽略大小写

# ToLowerTooltip
source: Ignore case
de: Groß-/Kleinschreibung ignorieren
ru: Игнорировать дело
zh_cn: 忽略大小写

# SearchSettingList1
source: Hashtable
de: Hash-Tabelle
ru: Хеш-таблица
zh_cn: 哈希表

# LabelHits
source: Hits: 0
de: Treffer: 0
ru: Просмотров: 0
zh_cn: 点击数：0

# LabelWordIndex
source: [word], [index]
de: [Wort], [Index]

# LabelHits1
source: Hits:
de: Treffer:
ru: Хиты:
zh_cn: 点击数：

# LabelTarget
source: Target:
de: Ziel:
ru: Цель:
zh_cn: 目标：

# IgnoreDiacriticsCaption
source: Ignore Diacritics
de: Diakritische Zeichen ignorieren
ru: Игнорировать диакритические знаки
zh_cn: 忽略变音符号

# IgnoreDiacriticsTooltip
source: Ignore Diacritics
de: Akzente, Häkchen und Zirkumflexe ignorieren
ru: Игнорировать диакритические знаки
zh_cn: 忽略变音符号

# SearchSettingList2
source: Aho-Corasick
ru: Ахо-Corasick
