Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/KeySearcher/Properties/Resources.*.resx
Languages: de, ru, zh_cn

source: Anonymize machine name
de: Maschinenname anonymisieren
ru: Анонимное имя машины
zh_cn: 匿名机器名称

source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

source: Machine name:
de: Maschinenname:
ru: Название машины:
zh_cn: 机器名称：

source: Network:
de: Netzwerk:
ru: Сеть:
zh_cn: 网络：

source: Number of machine name characters to show:
de: Anzahl darzustellender Zeichen des Maschinennamens:
ru: Количество символов имени машины для отображения:
zh_cn: 要显示的机器名称字符数：

source: Text
ru: Текст
zh_cn: 文本

source: Value
de: Wert
ru: Стоимость
zh_cn: 值

# Combo_characters
source: {0} character(s)
de: {0} Zeichen
ru: {0} символ (ы)
zh_cn: {0}个字符

source: day
de: Tag
ru: день
zh_cn: 天

source: days
de: Tage
ru: дней
zh_cn: 天

source: hour
de: Stunde
ru: час
zh_cn: 小时

source: hours
de: Stunden
ru: часов
zh_cn: 小时

source: minute
ru: минут
zh_cn: 分钟

source: minutes
de: Minuten
ru: минут
zh_cn: 分钟

source: second
de: Sekunde
ru: второй
zh_cn: 第二

source: seconds
de: Sekunden
ru: секунд
zh_cn: 秒

# Copy_all
source: Copy all lines
de: Kopiere alle Zeilen
ru: Скопировать все строки
zh_cn: 复制所有行

source: Copy key
de: Kopiere Schlüssel
ru: Копировать ключ
zh_cn: 复制键

# Copy_line
source: Copy selected line
de: Kopiere ganze Zeile
ru: Копировать выбранную строку
zh_cn: 复制所选行

source: Copy text
de: Kopiere Text
ru: Копировать текст
zh_cn: 复制文字

source: Copy value
de: Kopiere Wert
ru: Копировать значение
zh_cn: 复制值

# Abort_Chunks_
source: Aborted blocks:
de: Abgebrochene Blöcke:
ru: Отремонтированные блоки:
zh_cn: 中止的块：

source: Avg. time per chunk:
de: Zeit pro Block:
ru: Avg. время на кусок:
zh_cn: 平均每块时间：

# global_throughput_sec
source: Throughput / sec:
de: Durchsatz / sec:
ru: Производительность / сек:
zh_cn: 吞吐量/秒：

# JobName
source: Job:
ru: Работа, вакансии:
zh_cn: 工作：

# local_throughput_sec
source: Throughput / sec:
de: Durchsatz / sec:
ru: Производительность / сек:
zh_cn: 吞吐量/秒：

# settings__caption_numberOfChunks
source: Number of blocks (log)
ru: Количество блоков (лог)
zh_cn: 块数（对数）

# settings__caption_useNetwork
source: Enable CrypCloud
de: Aktiviere CrypCloud
ru: Включить CrypCloud
zh_cn: 启用CrypCloud

# settings__tooltip_numberOfChunks
source: To distribute the Calculation, it will be splitted into independed chunks.
de: Um die Berechnung verteilen zu können, wird sie in unabhängige Blöcke aufgeteilt.
ru: Чтобы распределить расчет, он будет разделен на необработанные куски.
zh_cn: 为了分发计算，它将被分成独立的块。

# settings__tooltip_useNetwork
source: Use internal network 'CrypCloud' to distribute this workspace.
de: Verwende internes Netzwerk 'CrypCloud', um diesen Arbeitsbereich zu verteilen.
ru: Используйте внутреннюю сеть CrypCloud для распространения этого рабочего пространства.
zh_cn: 使用内部网络“ CrypCloud”来分发此工作空间。

# ChunkSizeCaption
source: Block size
de: Blockgröße
ru: Размер блока
zh_cn: 块大小

# ChunkSizeTooltip
source: Number of keys calculated by one peer per time. This value is the exponent of the square of the block size.
de: Anzahl an Schlüsseln, die von einem Peer zu einem Zeitpunkt berechnet werden. Dieser Wert ist der Exponent des Quadrats der Blockgröße.
ru: Количество ключей, рассчитанных одним одноранговым узлом за раз. Это значение является показателем квадрата размера блока.
zh_cn: 每次由一个对等方计算的密钥数。该值是块大小的平方的指数。

# settings__caption_numberOfBlocks
source: Number of blocks
de: Anzahl der Blöcke
ru: Количество блоков
zh_cn: 块数

# settings__tooltip_numberOfBlocks
source: Enter the number of blocks into which the calculation should be split.
de: Geben Sie die Anzahl der Blöcke ein, in die die Berechnung aufgeteilt werden soll.
ru: Введите количество блоков, в которые следует разделить расчет.
zh_cn: 输入应将计算拆分为的块数。

# Dataspace
source: Dataspace Size:
de: Datenraumgröße:
ru: Размер Dataspace:
zh_cn: 数据空间大小：

# You_have_to_connect_the_KeySearcher_with_the_Cost_Control_
source: You have to add a cost function to the KeySearcher!
de: Sie müssen dem Schlüsselsucher eine Kostenfunktion hinzufügen!
ru: Вы должны добавить функцию стоимости в KeySearcher!
zh_cn: 您必须向KeySearcher添加一个成本函数！

# JobID_
source: ID:
ru: Я БЫ:
