Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/KeySearcher/Properties/Resources.*.resx
Languages: de, ru, zh_cn

source: Assigning new job with Guid {0} to client!
de: Weise dem Client neuen Job mit Guid {0} zu!
ru: Назначение нового клиента Guid {0} клиенту!
zh_cn: 用向导{0}分配新工作给客户！

source: Best match: {0} with {1}
de: Bester Treffer: {0} mit {1}
ru: Наилучшее совпадение: {0} с {1}
zh_cn: 最佳匹配：{0}与{1}

source: Brute force was stopped, not saving results...
de: Erschöpfende Suche wurde gestoppt, speichere Resultate nicht...
ru: Грубая сила была остановлена, а не спасла результаты ...
zh_cn: 蛮力停止了，没有保存结果...

source: Bytes used not valid:
de: Benutzte Bytes nicht valide:
ru: Использованные байты недействительны:
zh_cn: 使用的字节无效：

source: Calculating global statistics
de: Berechne globale Statistiken
ru: Расчет глобальной статистики
zh_cn: 计算全球统计

# Calculating_pattern_
source: Calculating chunk
de: Berechne Block
ru: Расчетный кусок
zh_cn: 计算块

source: Calculation complete.
de: Berechnung vollständig.
ru: Расчет завершен.
zh_cn: 计算完成。

# Chunks_
source: Blocks:
de: Blöcke:
ru: Блоки:
zh_cn: 方块：

source: Client disconnected!
de: Client getrennt!
ru: Клиент отключен!
zh_cn: 客户端已断开连接！

source: Client returned result of job with Guid {0}!
de: Client berichtet Ergebnis des Jobs mit Guid {0}!
ru: Клиент вернул результат работы с Guid {0}!
zh_cn: 客户返回了Guid {0}的工作结果！

source: Client tried to connect, but only one client allowed!
de: Client versuchte zu verbinden, aber nur ein Client erlaubt!
ru: Клиент пытался подключиться, но разрешен только один клиент!
zh_cn: 客户端尝试连接，但只允许一个客户端！

source: Client {0} connected!
de: Client {0} verbunden!
ru: Клиент {0} подключен!
zh_cn: 客户端{0}已连接！

source: Connection lost! Waiting for reconnection to store the results!
de: Verbindung verloren! Warte auf Neuverbindung, um Resultate zu speichern!
ru: Соединение потеряно! Ожидание повторного подключения для хранения результатов!
zh_cn: 连接断开！等待重新连接以存储结果！

# ControlMasterTooltip
source: Used for bruteforcing
de: Benutzt für erschöpfende Suche
ru: Используется для принудительной работы
zh_cn: 用于暴力破解

# ControlMasterCaption
source: Control Master
de: Master
ru: Мастер управления
zh_cn: 控制主

# CostMasterTooltip
source: Used for cost calculation
de: Für Kostenkalkulation verwendet
ru: Используется для расчета стоимости
zh_cn: 用于成本计算

# CostMasterCaption
source: Cost Master
de: Kostenkalkulation
ru: Мастер затрат
zh_cn: 成本大师

source: Could not store results:
de: Konnte Resultate nicht speichern:
ru: Не удалось сохранить результаты:
zh_cn: 无法存储结果：

# CSEncryptedDataTooltip
source: Encrypted data out of an Encryption Plugin
de: Verschlüsselte Daten aus einer Verschlüsselungsfunktion
ru: Зашифрованные данные из модуля шифрования
zh_cn: 来自加密插件的加密数据

# CSEncryptedDataCaption
source: CS Encrypted Data
de: CS Verschlüsselte Daten
ru: Зашифрованные данные CS
zh_cn: CS加密数据

# Current_Chunk_
source: Current blocks:
de: Derzeitige Blöcke:
ru: Текущие блоки:
zh_cn: 当前块：

source: Devices:
de: Geräte:
ru: Устройства:
zh_cn: 设备：

source: Days
de: Tage
ru: дней
zh_cn: 天

source: Machines
de: Rechner
ru: Машины
zh_cn: 机器

source: Users
de: Teilnehmer
ru: пользователей
zh_cn: 用户数

source: , last reservation date
de: , letztes Reservierungsdatum
ru: , последняя дата бронирования
zh_cn: ，最后预订日期

source: '. Bruteforcing TimeSpan:
de: '. Laufzeit der erschöpfenden Suche:
zh_cn: &#39;。暴力破解时间跨度：

# AutoconnectPeerToPeerCaption
source: Autoconnect network
de: Automatisch verbinden
ru: Автосоединение сети
zh_cn: 自动连接网络

# AutoconnectPeerToPeerTooltip
source: Establish a connection to the network if the workspace is started without the background connection being active.
de: Soll automatisch eine Verbindung zur verteilten Berechnungsplattform aufgebaut werden?
ru: Установите соединение с сетью, если рабочее пространство запущено без активного подключения фона.
zh_cn: 如果在没有激活后台连接的情况下启动工作空间，则建立与网络的连接。

# StatusKeyButtonCaption
source: Copy status key
de: Kopiere Statusschlüssel
ru: Копировать статус
zh_cn: 复制状态键

# StatusKeyButtonTooltip
source: Copy status key to clipboard. The key can than be used to upload it together with the job using the P2PEditor.
de: Kopiere Statusschlüssel in die Zwischenablage. Der Schlüssel kann zum Upload der Projektdatei im Netzwerkmanager verwendet werden.
ru: Скопировать код состояния в буфер обмена. Ключ можно использовать для загрузки его вместе с заданием с помощью P2PEditor.
zh_cn: 将状态键复制到剪贴板。然后可以使用P2PEditor将密钥与作业一起上传。

# CoresUsedCaption
source: CoresUsed
de: Benutzte Kerne
zh_cn: 使用的磁芯

# CoresUsedTooltip
source: Choose how many cores should be used
de: Wie viele CPU-Kerne sollen verwendet werden?
ru: Выберите, сколько ядер необходимо использовать
zh_cn: 选择应使用多少个内核

# CsvPathCaption
source: Select the Comma-Seperated-Values file
de: Auswahl der CSV-Datei
ru: Выберите файл Comma-Seperated-Values
zh_cn: 选择逗号分隔值文件

# CsvPathTooltip
source: Select the folder and csv file you want to use.
de: Wählen Sie Pfad und CSV-Datei aus.
ru: Выберите папку и файл csv, который вы хотите использовать.
zh_cn: 选择要使用的文件夹和csv文件。

# EvaluationDatabaseCaption
source: Database
de: Datenbank
ru: База данных
zh_cn: 数据库

# EvaluationDatabaseTooltip
source: Name of the evaluation database
de: Name der Evaluationsdatenbank
ru: Название базы данных оценки
zh_cn: 评估数据库名称

# DefaultPathCaption
source: Default file
de: Standardpfad
ru: Файл по умолчанию
zh_cn: 默认文件

# DefaultPathTooltip
source: Use the default folder %APPDATA%\\Local\\CrypTool2
de: Soll der Standardpfad %APPDATA%\\Local\\CrypTool2 verwendet werden?
ru: Использовать папку по умолчанию% APPDATA% \\ Local \\ CrypTool2
zh_cn: 使用默认文件夹％APPDATA％\\ Local \\ CrypTool2

# Client__0__tried_to_auth_with_invalid_password
source: Client '{0}' tried to authenticate using an invalid password
ru: Клиент '{0}' пытался аутентифицироваться с использованием недопустимого пароля
zh_cn: 客户端“ {0}”尝试使用无效密码进行身份验证

source: Aggregate Statistics
de: Gesamt Statistik
ru: Совокупная статистика
zh_cn: 汇总统计

source: Current information
ru: Текущая информация
zh_cn: 当前信息

source: Information
ru: Информация
zh_cn: 信息

# DisableUpdateCaption
source: Disable statistic update
de: Deaktiviere Statistik-Update
ru: Отключить статистическое обновление
zh_cn: 禁用统计信息更新

# DisableUpdateTooltip
source: Disables the statistic update
de: Deaktiviert das Statistik-Update
ru: Отключает статистическое обновление
zh_cn: 禁用统计信息更新

# VerbosePeerToPeerDisplayCaption
source: Display verbose information
de: Ausführliche Informationen
ru: Отображать подробные сведения
zh_cn: 显示详细信息

# VerbosePeerToPeerDisplayTooltip
source: Display verbose information about network requests in the quick watch.
de: Sollen ausführliche Informationen über Netzwerkanfragen angezeigt werden?
ru: Отображать подробные сведения о сетевых запросах в режиме быстрого просмотра.
zh_cn: 在快速监视中显示有关网络请求的详细信息。

source: dummykey
de: Schlüsselplatzhalter
zh_cn: 假钥匙

# EncryptedDataTooltip
source: Encrypted data out of an Encryption PlugIn
de: Verschlüsselte Daten aus einer Verschlüsselungsfunktion
ru: Зашифрованные данные из подключаемого модуля шифрования
zh_cn: 加密插件中的加密数据

# Elapsed_
source: Elapsed time:
de: Vergangen:
ru: Пройденное время:
zh_cn: 经过时间：

# EncryptedDataCaption
source: Encrypted Data
de: Verschlüsselte Daten
ru: Шифрованные данные
zh_cn: 加密数据

# Ended_bruteforcing_pattern__
source: Finished brute-force attack on key pattern '
de: Beendete erschöpfende Suche auf Schlüsselmuster '
ru: Законченная атака грубой силы на ключевой шаблон '
zh_cn: 完成对密钥模式&#39;的暴力攻击

source: Endgame mode
de: Endmodus
ru: Режим эндшпиля
zh_cn: 残局模式

# End_
source: Estimated end:
de: Ende:
ru: Предполагаемый конец:
zh_cn: 预计结束时间：

# ExternalClientPasswordCaption
source: Password
de: Passwort
ru: пароль
zh_cn: 密码

# ExternalClientPasswordTooltip
source: Password used for authenticating external clients
de: Passwort mit dem sich externe Clients authentifizieren müssen
ru: Пароль, используемый для аутентификации внешних клиентов
zh_cn: 用于认证外部客户端的密码

# Finding_next_leaf_to_calculate
source: Finding next chunk to calculate
de: Suche nächsten Block zum Berechnen
ru: Поиск следующего фрагмента для вычисления
zh_cn: 查找下一个要计算的块

# Finished_Chunks_
source: Finished blocks:
de: Fertige Blöcke:
ru: Готовые блоки:
zh_cn: 成品块：

# GroupEvaluation
source: Evaluation
ru: оценка
zh_cn: 评价

# GroupExternalClient
source: External Client
de: Externer Client
ru: Внешний клиент
zh_cn: 外部客户

# GroupPeerToPeer
source: Peer-to-Peer network
de: Netzwerk
ru: Одноранговая сеть
zh_cn: 对等网络

# GroupStatisticPath
source: Statistic
de: Statistik Speicherpfad
ru: статистика
zh_cn: 统计

# EvaluationHostCaption
source: Host
ru: хозяин
zh_cn: 主办

# EvaluationHostTooltip
source: Database host with evaluation database
de: Hostname der Evaluationsdatenbank
ru: Хост базы данных с оценочной базой данных
zh_cn: 具有评估数据库的数据库主机

source: incalculable :-)
de: unberechenbar :-)
ru: неисчислимый :-)
zh_cn: 无法估量的:-)

# InitVectorCaption
source: Initialization Vector
de: Initialisierungsvektor
ru: Вектор инициализации
zh_cn: 初始化向量

source: Initializing connection to the peer-to-peer system
de: Initialisiere Verbindung zum Netzwerk
ru: Инициализация соединения с одноранговой системой
zh_cn: 初始化与对等系统的连接

source: Initializing distributed key pool tree
de: Initialisiere verteilten Schlüsselbaum
ru: Инициализация распределенного дерева пула ключей
zh_cn: 初始化分布式密钥池树

# InitVectorTooltip
source: Initialization vector with which the data were encrypted
de: Initialisierungsvektor, mit dem die Daten verschlüsselt wurden
ru: Инициализационный вектор, с которым данные были зашифрованы
zh_cn: 用于加密数据的初始化向量

source: in a galaxy far, far away...
de: In einer weit, weit entfernten Galaxis...
ru: в галактике далеко, далеко ...
zh_cn: 在一个遥远的星系中

# KeysearcherSettings
source: KeySearcher
zh_cn: 关键字搜索器

# Keysearcher_Fullstop__Please_Update_your_Version_
source: Keysearcher can't proceed. Please update your version.
de: KeySearcher gestoppt. Bitte aktualisieren Sie Ihre Version.
ru: Keysearcher не может продолжаться. Обновите свою версию.
zh_cn: Keysearcher无法继续。请更新您的版本。

source: KeySearcher must be running to copy the status key.
de: KeySearcher muss ausgeführt werden, um den Statusschlüssel zu kopieren.
ru: KeySearcher должен быть запущен для копирования ключа состояния.
zh_cn: KeySearcher必须正在运行才能复制状态键。

# KeyCaption
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# KeyTooltip
source: Key pattern used to bruteforce
de: Schlüssel, der für die erschöpfende Suche verwendet wird
ru: Ключевые шаблоны, используемые для brutforce
zh_cn: 用于暴力破解的密钥模式

source: Keys per chunk:
de: Schlüssel pro Block:
ru: Ключи на кусок:
zh_cn: 每块密钥：

source: Keys / sec:
de: Schlüssel / sec:
ru: Ключи / сек:
zh_cn: 键/秒：

source: Keys/sec (CPU):
de: Schlüssel / sec (CPU):
ru: Ключи / сек (ЦП):
zh_cn: 密钥/秒（CPU）：

source: Launching p2p based bruteforce logic...
de: Starte Logik der verteilten Schlüsselsuche...
ru: Запуск логики грубой силы p2p ...
zh_cn: 正在启动基于P2P的蛮力逻辑...

source: Local
de: Lokal
ru: Местный
zh_cn: 本地

source: Global
zh_cn: 全球

# Node_was_already_calculated_
source: Chunk was already calculated.
de: Block wurde bereits berechnet.
ru: Чанк уже рассчитан.
zh_cn: 块已经计算过了。

# No_ressources_to_BruteForce_available__Check_the_KeySearcher_settings_
source: No ressources assigned for brute force. Please check the KeySearcher parameters.
de: Kann erschöpfende Suche nicht starten. Überprüfen Sie die KeySearcher-Einstellungen!
ru: Нет ресурсов, предназначенных для грубой силы. Проверьте параметры KeySearcher.
zh_cn: 没有为蛮力分配资源。请检查KeySearcher参数。

source: Only using external client to brute force!
de: Benutze nur externen Client für erschöpfende Suche!
ru: Только использование внешнего клиента для перебора!
zh_cn: 仅使用外部客户端进行暴力破解！

source: Overhead (abs):
de: Verwaltungskosten (Abs):
ru: Накладные расходы (абс.):
zh_cn: 开销（绝对值）：

# Overhead_Perc_
source: Overhead (%):
de: Verwaltungskosten (%):
ru: Накладные расходы (%):
zh_cn: 高架 （％）：

# P2P_network_could_not_be_connected_
source: Could not connect to P2P network.
de: Konnte nicht zum Netzwerk verbinden.
ru: Не удалось подключиться к сети P2P.
zh_cn: 无法连接到P2P网络。

source: P2P network not connected and autoconnect disabled. Cannot compute job.
de: Nicht zum Netzwerk verbunden, automatisches Verbinden abgeschaltet. Kann Job nicht berechnen.
ru: Сеть P2P не подключена и автоматически подключена. Невозможно вычислить работу.
zh_cn: P2P网络未连接且自动连接已禁用。无法计算作业。

# P2P_network_was_connected_due_to_plugin_setting_
source: Connected automatically to P2P network.
de: Verbindung zum Netzwerk automatisch aufgebaut.
ru: Автоматически подключается к сети P2P.
zh_cn: 自动连接到P2P网络。

source: P2P not connected.
de: Netzwerk nicht verbunden.
ru: P2P не подключен.
zh_cn: P2P未连接。

source: Participants:
de: Teilnehmer:
ru: Участники:
zh_cn: 参加者：

# EvaluationPasswordCaption
source: Password
de: Passwort
ru: пароль
zh_cn: 密码

# EvaluationPasswordTooltip
source: Password for evaluation database
de: Passwort für die Evaluationsdatenbank
ru: Пароль для базы данных оценки
zh_cn: 评估数据库密码

source: Chunk #{0} was reserved before it could be reserved for this CrypTool instance.
de: Block #{0} wurde bereits von einem anderen Teilnehmer reserviert.
ru: Chunk # {0} зарезервирован, прежде чем он может быть зарезервирован для этого экземпляра CrypTool.
zh_cn: 块＃{0}已被保留，然后才可以为此CrypTool实例保留。

source: Per chunk:
de: Pro Block:
ru: За кусок:
zh_cn: 每块：

source: PLEASE UPDATE
de: BITTE AKTUALISIEREN
ru: ПОЖАЛУЙСТА ОБНОВИТЕ
zh_cn: 请更新

# PluginCaption
source: KeySearcher
de: Schlüsselsucher
ru: Ключевой поиск
zh_cn: 关键字搜索器

# PluginTooltip
source: Performs a brute-force attack on a ciphertext
de: Führt eine erschöpfende Schlüsselsuche auf einem Geheimtext durch
ru: Выполняет атаку грубой силы на зашифрованный текст
zh_cn: 对密文执行强力攻击

# PortCaption
source: Port
ru: порт
zh_cn: 港口

# PortTooltip
source: Port on which to listen for external clients.
de: Auf welchem Port soll auf Anfragen von externen Clients gehorcht werden?
ru: Порт для прослушивания внешних клиентов.
zh_cn: 侦听外部客户端的端口。

source: Processing results of calculation
de: Werte Ergebnis der Berechnung aus
ru: Обработка результатов расчета
zh_cn: 计算结果

source: Progress
de: Fortschritt
ru: Прогресс
zh_cn: 进展

source: Pushing statistics to evaluation database
de: Füge Statistiken der Evaluationsdatenbank hinzu
ru: Нажатие статистики в базу данных оценки
zh_cn: 将统计信息推送到评估数据库

# Ration_
source: Ratio:
de: Anteil:
zh_cn: 比：

source: Ready for calculation
de: Fertig zur Berechnung
ru: Готовы к расчёту
zh_cn: 准备计算

source: Received late job result {0} from client '{1}'
ru: Получен поздний результат работы {0} из клиента '{1}'
zh_cn: 从客户“ {1}”收到迟到的工作结果{0}

source: Received (link):
de: Empfangen (Link):
ru: Получено (ссылка):
zh_cn: 收到（链接）：

source: Received (payload):
de: Empfangen (Nutzlast):
ru: Получено (полезная нагрузка):
zh_cn: 收到（有效载荷）：

# Remaining_
source: Remaining time:
de: Verbleibend:
ru: Оставшееся время:
zh_cn: 剩余时间：

# Removed_reservation_of_pattern___0_
source: Removed reservation of chunk #{0}
de: Reservierung von Block #{0} entfernt
ru: Удалено резервирование фрагмента # {0}
zh_cn: 删除了块＃{0}的保留

source: Remove:
de: Entfernte:
ru: Удалить:
zh_cn: 去掉：

source: Requests
de: Anfragen
ru: Запросы
zh_cn: 要求

# Rereserving_pattern_failed_
source: Rereserving chunk failed!
de: Erneute Reservierung des Blocks fehlgeschlagen!
ru: Перезагрузочный кусок не удался!
zh_cn: 保留块失败！

# Rereserving_pattern_failed__because_there_is_no_connection_
source: Rereserving chunk failed, because there is no connection to P2P network.
de: Erneute Reservierung des Blocks fehlgeschlagen, weil keine Verbindung besteht!
ru: Ошибка повторного прослушивания, поскольку соединение с сетью P2P отсутствует.
zh_cn: 保留块失败，因为没有到P2P网络的连接。

# Rereserving_pattern___0_
source: Rereserving chunk #{0}
de: Erneute Reservierung des Blocks #{0}
ru: Резервуар # {0}
zh_cn: 保留块＃{0}

source: Reservation has been removed by another participant. To avoid a state in limbo, proceeding to first available chunk...
de: Blockreservierung wurde von einem anderen Teilnehmer entfernt. Suche nach anderem freien Block...
ru: Бронирование было удалено другим участником. Чтобы избежать состояния в подвешенном состоянии, переходя к первому доступному фрагменту ...
zh_cn: 预订已被其他参与者删除。为了避免陷入困境，请继续使用第一个可用的区块...

# ResetCaption
source: Reset
ru: Сброс
zh_cn: 重启

# ResetTooltip
source: Reset Key
de: Reset Schlüssel
ru: Сбросить ключ
zh_cn: 重设金钥

source: Retrieve:
de: Empfangen:
ru: Получить:
zh_cn: 检索：

# Running_pattern___0__of__1_
source: Processing chunk #{0} of {1}
de: Berechne Block #{0} von {1}
ru: Обработка фрагмента # {0} из {1}
zh_cn: 正在处理{1}中的块＃{0}

source: Sent (link):
de: Gesendet (Link):
ru: Отправлено (ссылка):
zh_cn: 发送（链接）：

source: Sent (payload):
de: Gesendet (Nutzlast):
ru: Отправлено (полезная нагрузка):
zh_cn: 已发送（有效负载）：

source: Start:
ru: Начало:
zh_cn: 开始：

# Start_bruteforcing_pattern__
source: Starting brute-force attack on key pattern '
de: Starte erschöpfende Suche auf dem Schlüsselmuster '
ru: Запуск атаки грубой силы на ключевой шаблон '
zh_cn: 对密钥模式&#39;发起暴力攻击

source: Static
de: Statisch
ru: статический
zh_cn: 静态的

source: Statistics
de: Statistiken
ru: Статистика
zh_cn: 统计

source: Status key '{0}' has been copied to clipboard.
de: Statusschlüssel '{0}' wurde in die Zwischenablage kopiert.
ru: Ключ состояния «{0}» скопирован в буфер обмена.
zh_cn: 状态键“ {0}”已复制到剪贴板。

source: Store:
de: Gespeichert:
ru: Хранить:
zh_cn: 商店：

# Tested_Bits_
source: Bits to be tested:
de: Getestete Bits:
ru: Протестированные биты:
zh_cn: 要测试的位：

# There_must_be_an_error__because_we_bruteforced_too_much_keys___
source: Data inconsistency error, we seem to have calculated more keys than expected...
de: Fehler aufgrund inkonsistenter Anzahl von berechneten Schlüsseln...
ru: Ошибка несогласованности данных, мы, похоже, вычислили больше ключей, чем ожидалось ...
zh_cn: 数据不一致错误，我们似乎计算出了比预期更多的键...

# Top1KeyTooltip
source: The best key found
de: Der beste gefundene Schlüssel
ru: Найден лучший ключ
zh_cn: 找到最好的钥匙

# Top1MessageTooltip
source: The best message found
de: Die beste gefundene Nachricht
ru: Самое лучшее сообщение найдено
zh_cn: 找到最好的消息

# Top1KeyCaption
source: Top1 Key
de: Top1 Schlüssel
ru: Ключ Top1
zh_cn: Top1键

# Top1MessageCaption
source: Top1 Message
de: Top1 Nachricht
ru: Сообщение Top1
zh_cn: Top1讯息

source: Top Ten
de: Beste
ru: Топ десять
zh_cn: 前十

source: Total:
de: Gesamt:
ru: Всего:
zh_cn: 总：

# Total_amount_of_patterns___0___each_containing__1__keys_
source: Total amount of chunks: {0}, each containing {1} keys.
de: Gesamtanzahl an Blöcken: {0}, jeder enthält {1} Schlüssel.
ru: Общее количество кусков: {0}, каждый из которых содержит {1} ключи.
zh_cn: 块总数：{0}，每个块包含{1}个密钥。

# Total_Chunks_
source: Total blocks:
de: Anzahl Blöcke:
ru: Всего блоков:
zh_cn: 总块数：

source: Total (link):
de: Gesamt (Link):
ru: Всего (ссылка):
zh_cn: 总计（链接）：

source: Total (payload):
de: Gesamt (Nutzlast):
ru: Итого (полезная нагрузка):
zh_cn: 总计（有效负载）：

source: Total Blocks Tested
de: Geprüfte Blöcke
ru: Всего протестированных блоков
zh_cn: 测试的总块数

source: Total Blocks to Search
de: Anzahl Blöcke
ru: Всего блоков для поиска
zh_cn: 搜索总块数

source: Total Keys Tested
de: Geprüfte Schlüssel
ru: Всего проверенных ключей
zh_cn: 测试的总键数

source: Total Keys to Search
de: Anzahl Schlüssel
ru: Всего ключей для поиска
zh_cn: 搜索总键

source: Traffic
de: Netzwerkaufkommen
ru: Трафик
zh_cn: 交通

source: Unable to use peer-to-peer system.
de: Konnte die verteilte Berechnung nicht durchführen.
ru: Невозможно использовать одноранговую систему.
zh_cn: 无法使用对等系统。

source: Under Construction
de: Unter Konstruktion
ru: В разработке
zh_cn: ��正在施工🚧

# UpdateTimeCaption
source: Update interval (minutes)
de: Update-Intervall (in Minuten)
ru: Интервал обновления (минуты)
zh_cn: 更新间隔（分钟）

# UpdateTimeTooltip
source: Set the minute interval to update the keysearcher statistics
de: Setze das Minuten-Intervall, in dem die KeySearcher-Statistik erneuert werden soll.
ru: Установите минутный интервал, чтобы обновить статистику keyearcher
zh_cn: 设置分钟间隔以更新keysearcher统计信息

source: Updating statistic
de: Aktualisiere Statistik
ru: Обновление статистики
zh_cn: 更新统计

source: Updating status in DHT
de: Aktualisiere Status in DHT
ru: Обновление статуса в DHT
zh_cn: 在DHT中更新状态

# UseExternalClientCaption
source: Use external client
de: Verwende externen Client
ru: Использовать внешний клиент
zh_cn: 使用外部客户端

# UseExternalClientTooltip
source: If checked, external clients are allowed to connect to this CrypTool 2 instance to support the bruteforce process (this is not the same as p2p-distributed computing).
de: Soll ein Port geöffnet werden, um externen Clients die Verbindung zu ermöglichen? Externe Clients sind direkt an der Schlüsselsuche beteiligt und können diese beschleunigen, aber auch manipulieren.
ru: Если флажок установлен, внешним клиентам разрешено подключаться к этому экземпляру CrypTool 2 для поддержки процесса bruteforce (это не то же самое, что p2p-распределенные вычисления).
zh_cn: 如果选中，则允许外部客户端连接到此CrypTool 2实例以支持暴力破解过程（这与p2p分布式计算不同）。

# EvaluationUserCaption
source: User
de: Teilnehmer
ru: пользователь
zh_cn: 用户

# EvaluationUserTooltip
source: Username for evaluation database
de: Benutzername für die Evaluationsdatenbank
ru: Имя пользователя для базы данных оценки
zh_cn: 评估数据库的用户名

source: Waiting for external client!
de: Warte auf externen Client!
ru: Ожидание внешнего клиента!
zh_cn: 等待外部客户！

source: Work Items:
de: Blöcke:
ru: Рабочие элементы:
zh_cn: 工作项目：

source: Wrong key pattern!
de: Falsches Schlüsselmuster!
ru: Неверный шаблон ключа!
zh_cn: 按键样式错误！

# You_have_to_connect_the_KeySearcher_with_the_Decryption_Control_
source: You have to add a decryption function to the KeySearcher!
de: Sie müssen dem Schlüsselsucher eine Entschlüsselungsfunktion hinzufügen!
ru: Вы должны добавить функцию дешифрования в KeySearcher!
zh_cn: 您必须向KeySearcher添加解密功能！

# StatisticsPresentation_SetCurrentRate
source: {0:0,0} key/sec
de: {0:0,0} Schlüssel / sec
ru: {0: 0,0} ключ / сек.
zh_cn: {0：0,0}键/秒

source: Connection lost. Waiting for reconnect...
ru: Соединение потеряно. Ожидание повторного подключения ...
zh_cn: 连接断开。正在等待重新连接...

source: KeyPool Tree
de: Schlüsselbaum
ru: Дерево KeyPool
zh_cn: 密钥池树

source: Total Users
de: Anzahl Benutzer
ru: Всего пользователей
zh_cn: 总用户

source: Next Update Time:
de: Nächste Updatezeit:
ru: Следующее обновление:
zh_cn: 下次更新时间：

source: Average Rate
de: Durchschnittsrate
ru: Средняя оценка
zh_cn: 平均率

source: Current Stats
de: Momentan
ru: Текущая статистика
zh_cn: 当前统计

source: Current machines
de: Momentane Machinen
ru: Текущие машины
zh_cn: 目前的机器

source: Current rate
de: Momentanrate
ru: Текущая ставка
zh_cn: 当前利率

source: Current users
de: Momentane Benutzer
ru: Текущие пользователи
zh_cn: 当前用户

source: Last Update Time:
de: Letzte Updatezeit:
ru: Последнее обновление:
zh_cn: 最后更新时间：

source: Percent Complete
de: Gesamtprozent
ru: Процент завершен
zh_cn: 完成百分比

source: Top Machine
ru: Верхняя машина
zh_cn: 顶机

source: Top User
de: Top Benutzer
ru: Лучшие пользователи
zh_cn: 最高用户

source: Total Machines
de: Anzahl Maschinen
ru: Всего машин
zh_cn: 机器总数

source: Working Days
de: Tage in Arbeit
ru: Рабочие дни
zh_cn: 工作日

source: Hide Dead Machines
de: Inaktive Maschinen ausblenden
ru: Скрыть мертвые машины
zh_cn: 隐藏死机

source: Hide Dead User
de: Inaktive User ausblenden
ru: Скрыть мертвого пользователя
zh_cn: 隐藏死用户

source: S t a t i s t i c s
de: S t a t i s t i k e n
ru: S статистика
zh_cn: 统计

source: Bytes offset not valid:
de: Bytes Offset nicht valide:
ru: Недопустимое смещение байтов:
zh_cn: 字节偏移量无效：

# Finished_Chunks_Tooltip
source: Total locally finished blocks (locally finished blocks in this session)
de: Alle lokal berechneten Blöcke (lokal berechnete Blöcke während dieser Sitzung)
ru: Всего локально готовых блоков (локально завершенных блоков в этом сеансе)
zh_cn: 本地完成的块总数（此会话中的本地完成的块）
