Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Solitaire/Properties/Resources.*.resx
Languages: de, ru

# PluginTooltip
source: Solitaire cipher from the novel 'Cryptonomicon'
de: Solitaire-Chiffre aus dem Roman 'Cryptonomicon'
ru: Шифр пасьянса из романа «Криптономикон»

# InputStringCaption
source: Text input
de: Texteingabe
ru: Ввод текста

# InputStringTooltip
source: Input a string to be processed
de: Geben Sie den zu verarbeitenden Text ein.
ru: Введите строку для обработки

# PasswordCaption
source: Keyword input
de: Schlüsselwort-Eingabe
ru: Ввод ключевого слова

# PasswordTooltip
source: Input the keyword with which the initial deck will be generated
de: Geben Sie das Schlüsselwort an, mit dem der initiale Kartenstapel generiert werden soll.
ru: Введите ключевое слово, с которым будет создана начальная колода

# DeckstateCaption
source: Deckstate input
de: Eingabe des Kartenstapels
ru: Вход в декестат

# DeckstateTooltip
source: Input a deckstate, the sequence represents the deck from top to bottom. Each card is represented by a number, the highest two being the jokers. Seperate the cards with a comma, e.g. '1,2,3,4'. Maximum number of cards is 54.
de: Geben Sie die Reihenfolge der Karten im Kartenstapel an (von oben nach unten). Jede Karte wird durch eine Zahl repräsentiert, wobei die beiden größten Zahlen für die beiden Joker stehen. Trennen Sie die Zahlen durch Kommas, z.B. '1,2,3,4'. Sie können maximal 54 Karten angeben.
ru: Введите состояние стойки, последовательность представляет колоду сверху вниз. Каждая карта представлена ​​числом, самые высокие из которых являются джокерами. Разделите карты запятой, например «1,2,3,4». Максимальное количество карточек - 54.

# OutputStringCaption
source: Text Output
de: Textausgabe
ru: Текстовый вывод

# OutputStringTooltip
source: The string after processing with the Solitaire cipher
de: Der mit dem Solitaire-Verfahren erzeugte Ausgabetext.
ru: Строка после обработки с помощью шифрования Solitaire

# InitialDeckCaption
source: Initial Deck
de: Initialer Kartenstapel
ru: Начальная колода

# InitialDeckTooltip
source: The initial deck which is used.
de: Der initiale Kartenstapel, mit dem die Ver-/Entschlüsselung beginnt.
ru: Используется начальная колода.

# FinalDeckCaption
source: Final Deck
de: Letzter Kartenstapel
ru: Заключительная колода

# FinalDeckTooltip
source: The deck after generating the last keystream letter.
de: Der Kartenstapel, nachdem das letzte Zeichen des Schlüsselstroms erzeugt wurde.
ru: Палуба после генерации последней буквой ключей.

# OutputStreamCaption
source: Stream Output
de: Ausgabe Schlüsselstrom
ru: Вывод потока

# OutputStreamTooltip
source: The stream used to encrypt or decrypt the text.
de: Der Schlüsselstrom, mit dem die Eingabe ver-/entschlüsselt wird.
ru: Поток, используемый для шифрования или дешифрования текста.

# ActionTypeCaption
source: Action Type
de: Aktion
ru: Тип действия

# ActionTypeTooltip
source: Choose whether to encrypt or decrypt
de: Soll das Plugin verschlüsseln oder entschlüsseln?
ru: Выберите, следует ли шифровать или расшифровывать

# GenerationTypeCaption
source: Deck Generation
de: Initialisierung des Kartenstapels
ru: Поколение колоды

# GenerationTypeTooltip
source: Choose the method of generation for the initial deck: - Ascending: sorts the cards in ascending order (starting with the lowest). - Descending: sorts the cards in descending order (starting with the highest). - Given state: use a deckstate as entered - Keyword: generate the initial deck from a keyword - Random: randomly generate the initial deck
de: Wie soll der initiale Kartenstapel erzeugt werden? - Aufsteigend: sortiere die Karten in aufsteigender Reihenfolge (beginnend mit der niedrigsten) - Absteigend: sortiere die Karten in absteigender Reihenfolge (beginnend mit der höchsten) - Eingabe: verwende angegebene Reihenfolge - Schlüsselwort: erzeuge Reihenfolge mittels eines Schlüsselwortes - Zufall: erzeuge eine zufällige Reihenfolge
ru: Выберите метод генерации для начальной колоды: - По возрастанию: сортирует карты в порядке возрастания (начиная с самого низкого). - По убыванию: сортирует карты в порядке убывания (начиная с самого высокого). - Введенное состояние: используйте начальное состояние в форме - Ключевое слово: сгенерируйте начальную колоду из ключевого слова - Случайное: произвольно генерируйте начальную колоду

# NumberOfCardsCaption
source: Cards
de: Karten
ru: Карты

# NumberOfCardsTooltip
source: Select the number of cards in your deck. The normal setting is 54 cards, the normal 52 playing cards and 2 jokers, which is also the maximum number of cards. The minimum setting is 3 cards, a single card and 2 jokers.
de: Geben Sie die Anzahl der zu verwendenden Karten an. Die Grundeinstellung ist 54 Karten (52 normale Karten und 2 Joker). Dies ist die maximale Anzahl. Es müssen mindestens 3 Karten verwendet werden (1 normale Karte und 2 Joker).
ru: Выберите количество карт в колоде. Обычная настройка - 54 карты, обычные 52 игральные карты и 2 шутника, что также является максимальным количеством карт. Минимальная настройка - 3 карты, одна карта и 2 шутника.

# StreamTypeCaption
source: Stream Generation
de: Schlüsselstrom-Erzeugung
ru: Потоковое поколение

# StreamTypeTooltip
source: Choose the stream generation: - Automatic: the cipherstream is automatically generated and the final result is shown. - Manual: one can manually go through the five different steps. The cards that change after each step will be printed bold.
de: Wählen Sie die Art der Schlüsselstrom-Erzeugung: - Automatisch: der Schlüsselstrom wird automatisch erzeugt und das Ergebnis wird angezeigt. - Manuell: Darstellung der 5 Einzelschritte. Die veränderten Karten werden fett angezeigt.
ru: Выберите генерацию потока: - Автоматически: автоматически генерируется шифрованный поток и отображается конечный результат. - Руководство: можно вручную пройти пять различных шагов. Карты, которые меняются после каждого шага, будут выделены жирным шрифтом.

# ActionTypeList1
source: Encrypt
de: Verschlüsselung
ru: шифровать

# ActionTypeList2
source: Decrypt
de: Entschlüsselung
ru: расшифровывать

# GenerationTypeList1
source: Ascending
de: Aufsteigend
ru: Восходящий

# GenerationTypeList2
source: Descending
de: Absteigend
ru: нисходящий

# GenerationTypeList3
source: Given State
de: Eingabe
ru: Данное государство

# GenerationTypeList4
source: Keyword
de: Schlüsselwort
ru: Ключевое слово

# GenerationTypeList5
source: Random
de: Zufall
ru: случайный

# StreamTypeList1
source: Automatic
de: Automatisch
ru: автоматическая

# StreamTypeList2
source: Manual
de: Manuell
ru: Руководство

# labelAutomatic
source: Automatic
de: Automatisch
ru: автоматическая

# labelCipherStream
source: Cipher Stream
de: Schlüsselstrom

# labelDeck
source: Deck
de: Kartenstapel
ru: колода

# labelInitialize
source: Initialize
de: Initialisierung
ru: инициализировать

# labelInputText
source: Input Text
de: Eingabetext
ru: Входной текст

# labelOutputText
source: Ciphertext
de: Ausgabetext
ru: зашифрованный

# labelStep1
source: Step 1
de: Schritt 1
ru: Шаг 1

# labelStep2
source: Step 2
de: Schritt 2
ru: Шаг 2

# labelStep3
source: Step 3
de: Schritt 3
ru: Шаг 3

# labelStep4
source: Step 4
de: Schritt 4
ru: Шаг 4

# labelStep5
source: Step 5
de: Schritt 5
ru: Шаг 5

# PluginCaption
source: Solitaire
ru: Пасьянс
