Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/FrequencyTest/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: Frequency Test
de: Häufigkeitsanalyse
ru: Частотный тест
zh_cn: 频率测试

# PluginTooltip
source: Calculates the frequency of letters or groups of letters in a string
de: Ermittelt die Häufigkeiten von Zeichen oder Zeichengruppen im Eingabetext
ru: Вычисляет частоту букв или групп букв в строке
zh_cn: 计算字符串中字母或字母组的频率

# StringInputCaption
source: The string to be analyzed
de: Der zu analysierende Text
ru: Строка, подлежащая анализу
zh_cn: 要分析的字符串

# StringInputTooltip
source: Text Input
de: Texteingabe
ru: Ввод текста
zh_cn: 文字输入

# StringOutputCaption
source: Text output
de: Textausgabe
ru: Вывод текста
zh_cn: 文字输出

# StringOutputTooltip
source: letter:absolute frequency of the letter:relative frequency of the letter (in %)
de: Zeichen:absolute Häufigkeit des Zeichens:relative Häufigkeit des Zeichens (in %)
ru: буква: абсолютная частота буквы: относительная частота буквы (в%)
zh_cn: 字母：字母的绝对频率：字母的相对频率（％）

# ArrayOutputCaption
source: List output
de: Listenausgabe
ru: Вывести список
zh_cn: 清单输出

# ArrayOutputTooltip
source: absolute frequency of a letter
de: Absolute Buchstabenhäufigkeiten
ru: абсолютная частота буквы
zh_cn: 字母的绝对频率

# DictionaryOutputCaption
source: Dictionary output
de: Wörterbuch-Ausgabe
ru: Выход словаря
zh_cn: 字典输出

# DictionaryOutputTooltip
source: Found n-grams and their quantities in different scalings
de: Die gefundenen N-Gramme und ihre Häufigkeiten in verschiedenen Darstellungen.
ru: Найденные n-граммы и их количества в разных условиях
zh_cn: 在不同比例下发现n克及其数量

# AutozoomTooltip
source: Should the chart perform autozoom?
de: Soll sich die Diagrammgröße automatisch anpassen?
ru: Должна ли диаграмма выполнять автозапуск?
zh_cn: 图表应执行自动缩放吗？

# BoundaryFragmentsCaption
source: Word boundary fragments
de: Fragmente an Wortgrenzen
ru: Фрагменты границы слова
zh_cn: 词边界片段

# BoundaryFragmentsTooltip
source: Include additional fragments with whitespaces at word boundary? Only relevant for gram length >= 2.
de: Sollen Fragmente mit Leerzeichen an Wortgrenzen berücksichtigt werden? Dies ist nur sinnvoll für N-Gramme mit mehr als einem Zeichen.
ru: Включить дополнительные фрагменты с пробелами на границе слова? Только для длины графа >= 2.
zh_cn: 在单词边界是否包含带有空格的其他片段？仅与克长度&gt; = 2有关。

# CaseSensitivityCaption
source: Alphabet case sensitivity
de: Groß-/Kleinschreibung
ru: Чувствительность к алфавиту
zh_cn: 字母区分大小写

# CaseSensitivityTooltip
source: Should upper and lower case be treated differently? (Should a == A?)
de: Sollen Groß- und Kleinbuchstaben gleich behandelt werden?
ru: Следует ли обрабатывать верхний и нижний регистр по-разному? (Если a == A?)
zh_cn: 大写和小写应该区别对待吗？ （是否== A？）

# ChartHeightCaption
source: Chart height
de: Diagrammhöhe
ru: Высота диаграммы
zh_cn: 图表高度

# ChartHeightTooltip
source: This is the chart height, if autozoom is disabled
de: Die Höhe des Diagramms, falls 'Autozoom' deaktiviert ist
ru: Это высота диаграммы, если autozoom отключен
zh_cn: 这是图表高度，如果禁用了自动缩放

# GrammLengthCaption
source: Enter the length of the n-grams to be investigated.
de: Länge der N-Gramme
ru: Введите длину n-граммов для исследования.
zh_cn: 输入要调查的n-gram的长度。

# GrammLengthTooltip
source: Groups of how many characters should be checked?
de: Untersuche den Eingabetext nach Zeichengruppen der angegebenen Länge.
ru: Группы из числа символов должны быть проверены?
zh_cn: 每组应检查多少个字符？

# ProcessUnknownSymbolsCaption
source: Handling of unknown characters
de: Behandlung ungültiger Zeichen
ru: Обработка неизвестных символов
zh_cn: 处理未知字符

# ProcessUnknownSymbolsTooltip
source: What should be done with encountered characters in the word which are not in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
ru: Что нужно делать с встречающимися символами в слове, которые не находятся в алфавите?
zh_cn: 如果单词中遇到的字符不在字母表中，该怎么办？

# ScaleTooltip
source: Zoom the chart
de: Diagramm vergrößern/verkleinern
ru: Увеличить масштаб
zh_cn: 放大图表

# CaseSensitivityList1
source: Case insensitive
de: Groß-/Kleinschreibung nicht beachten
ru: Без учета регистра
zh_cn: 不区分大小写

# CaseSensitivityList2
source: Case sensitive
de: Groß-/Kleinschreibung beachten
ru: Деликатный случай
zh_cn: 区分大小写

# ProcessUnknownSymbolsList1
source: Don't count
de: nicht zählen
ru: Не считайте
zh_cn: 不算

# ProcessUnknownSymbolsList2
source: Count
de: zählen
ru: подсчитывать
zh_cn: 计数

# PresentationGroup
source: Presentation
de: Darstellung
ru: презентация
zh_cn: 介绍

# BoundaryFragmentsList1
source: No fragments at boundary
de: Keine Fragmente an Wortgrenzen
ru: Никаких фрагментов на границе
zh_cn: 边界处无碎片

# BoundaryFragmentsList2
source: Include fragments
de: Fragmente berücksichtigen
ru: Включить фрагменты
zh_cn: 包含片段

source: No data available yet!
de: Noch keine Daten vorhanden!
ru: Пока данных нет!
zh_cn: 尚无可用数据！

# SortFrequenciesCaption
source: Sort frequencies
de: Häufigkeiten sortieren
ru: Частоты сортировки
zh_cn: 排序频率

# SortFrequenciesTooltip
source: If enabled the bars of the graph are sorted based on the frequencies.
de: Wenn aktiviert, werden die Balken des Diagramms anhand der Häufigkeiten sortiert.
ru: Если включено, столбцы графика сортируются по частотам.
zh_cn: 如果启用，则根据频率对图表的条形进行排序。

# CountOverlappingCaption
source: Count overlapping
de: Überlappend zählen
ru: Подсчет перекрытия
zh_cn: 计数重叠

# CountOverlappingTooltip
source: When this is enabled, overlapping n-grams are also counted. Otherwise, only non-overlapping n-grams are counted.
de: Wenn dies aktiviert ist, werden auch überlappende n-Gramme gezählt. Andernfalls werden nur nicht-überlappende n-Gramme gezählt.
ru: Когда это включено, перекрывающиеся n-граммы также учитываются. В противном случае учитываются только непересекающиеся n-граммы.
zh_cn: 启用此功能后，也会计算重叠的n-gram。否则，仅计算非重叠的n-gram。

# AbsoluteValues
source: (as absolute values)
de: (als Absolutwerte)
ru: (как абсолютные значения)
zh_cn: （作为绝对值）

source: Bigram frequencies
de: Bigramm-Häufigkeiten
ru: Биграмные частоты
zh_cn: 双频频率

# EmptyAlphabetInvalidMessage
source: Alphabet must not be empty. Abort frequency analysis
de: Alphabet darf nicht leer sein. Breche Häufigkeitsanalyse ab
ru: Алфавит не может быть пустым. Отменить частотный анализ
zh_cn: 字母不能为空。中止频率分析

source: Heptagram frequencies
de: Heptagramm-Häufigkeiten
ru: Гептаграмма частот
zh_cn: 七卦频率

source: Hexagram frequencies
de: Hexagramm-Häufigkeiten
ru: Частоты гексаграммы
zh_cn: 卦图频率

# MaxNumberOfShownNGrammsCaption
source: Maximum number of shown n-grams
de: Maximale Anzahl angezeigter N-Gramme
ru: Максимальное количество отображаемых грамм N
zh_cn: 显示的最大n克数

# MaxNumberOfShownNGrammsTooltip
source: Sets the number of maximum shown n-grams in the graph.
de: Legt die Anzahl der maximal angezeigten n-Grammen im Diagramm fest.
ru: Определяет количество максимальных n-грамм, показанных на диаграмме.
zh_cn: 设置图形中显示的最大n克数。

# nGram
source: -gram frequencies
de: -gramm-Häufigkeiten
ru: -грамма частот
zh_cn: 克频率

source: Octagram frequencies
de: Octogramm-Häufigkeiten
ru: Частоты октограммы
zh_cn: 八卦频率

source: Pentagram frequencies
de: Pentagramm-Häufigkeiten
ru: Частоты пентаграммы
zh_cn: 五角星频率

# ShowAbsoluteValuesCaption
source: Show absolute values
de: Zeige Absolutwerte
ru: Показать абсолютные значения
zh_cn: 显示绝对值

# ShowAbsoluteValuesTooltip
source: If this setting is checked, frequencies are shown as absolute values.
de: Wenn diese Einstellung aktiviert ist, werden Häufigkeiten als Absolutwerte angezeigt.
ru: Если этот параметр активирован, частоты отображаются в виде абсолютных значений.
zh_cn: 如果选中此设置，则频率将显示为绝对值。

source: Tetragram frequencies
de: Tetragramm-Häufigkeiten
ru: Частоты тетраграмм
zh_cn: 四卦频率

source: Trigram frequencies
de: Trigramm-Häufigkeiten
ru: Частоты триграмм
zh_cn: Trigram频率

source: Unigram frequencies
de: Unigramm-Häufigkeiten
ru: Униграмма частот
zh_cn: 会标频率

# AlphabetTooltip
source: The alphabet defines the characters that are counted
de: Das Alphabet definiert die Zeichen, die gezählt werden sollen
ru: Алфавит определяет символы для подсчета
zh_cn: 字母定义要计数的字符

# ShowTotalCaption
source: Show total
de: Zeige Gesamtzahl
ru: Показать всего
zh_cn: 显示总计

# ShowTotalTooltip
source: If this setting is checked, the total number of n-grams is shown as absolut value.
de: Wenn diese Einstellung aktiviert ist, wird die Gesamtzahl der n-Gramme als absoluter Wert angezeigt.
ru: Если этот параметр установлен, общее количество n-грамм отображается как абсолютное значение.
zh_cn: 如果选中此设置，则n克总数显示为绝对值。

# AnalysisModeCaption
source: Analysis mode
de: Analyse-Modus

# AnalysisModeTooltip
source: The mode which should be used during analysis
de: Der Modus der während der Analyse durchgeführt werden soll

# SymbolSeparatorsCaption
source: Symbol separators
de: Symbol-Trennzeichen

# SymbolSeparatorsTooltip
source: With which symbols should the text be separated
de: Mit welchen Symbolen soll der Text getrennt werden?

source: Frequencies
de: e Häufigkeiten

source: NGrams
de: N-Gramme

source: Symbol-separated
de: Symbolgetrennt

# ScaleCaption
source: Zoom
ru: Увеличить
zh_cn: 放大

# InPercent
source: (in %)
ru: (в% к весу)

# AlphabetCaption
source: Alphabet
ru: Алфавит
zh_cn: 字母

# AutozoomCaption
source: Autozoom
zh_cn: 自动变焦
