Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/M138Analyzer/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# CiphertextTooltip
source: Ciphertext to be used
de: Geheimtext, der analysiert werden soll.
ru: Шифрованный текст, который будет использоваться
zh_cn: 使用的密文

# CurrentAnalysedKeylengthLabel
source: Current analyzed offset:
de: Aktuell analysierter Offset:
ru: Текущее проанализированное смещение:
zh_cn: 当前分析的偏移量：

# ElapsedLabel
source: Elapsed time:
de: Vergangene Zeit:
ru: Пройденное время:
zh_cn: 经过时间：

# EndLabel
source: Estimated end time:
de: Geschätzte Endzeit:
ru: Расчетное время окончания:
zh_cn: 预计结束时间：

# LanguageList1
source: English
de: Englisch
ru: английский
zh_cn: 英语

# FastConvergeCaption
source: Fast converge
de: Schnelle Konvergenz
ru: Быстрая сходимость
zh_cn: 快速收敛

# FastConvergeTooltip
source: Select whether "Fast converge" should be used. Explanation can be found in the online help.
de: Auswahl, ob die schnelle Konvergenz aktiviert werden soll. Erklärung siehe Hilfe.
ru: Выберите, следует ли использовать «Быстрый сближение». Объяснение можно найти в интерактивной справке.
zh_cn: 选择是否应使用“快速收敛”。可以在在线帮助中找到说明。

# LanguageList2
source: German
de: Deutsch
ru: Немецкий
zh_cn: 德语

# MethodList2
source: Partially-known plaintext
de: Teilweise bekannter Klartext
ru: Частично известный открытый текст
zh_cn: 部分已知的纯文本

# HillClimbRestartsCaption
source: Number of restarts
de: Anzahl der Neustarts
ru: Количество перезапуска
zh_cn: 重新启动次数

# HillClimbRestartsTooltip
source: Set the number of restarts for each offset.
de: Anzahl der Neustarts, die für jeden Offset ausgeführt werden sollen
ru: Задайте количество перезапуска для каждого смещения.
zh_cn: 设置每个偏移量的重新启动次数。

# KeyHeader
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# KeyLengthCaption
source: Keylength
de: Schlüssellänge
ru: Keyledagth
zh_cn: 键长

# KeyLengthTooltip
source: Set the keylength to be used for analysis.
de: Schlüssellänge, die für die Analyse benutzt werden soll
ru: Задайте длину ключевого слова, которая будет использоваться для анализа.
zh_cn: 设置用于分析的密钥长度。

# KeyLengthHeader
source: Offset
ru: офсет
zh_cn: 抵消

# CalculatedKeyCaption
source: Calculated key
de: Berechneter Schlüssel
ru: Вычисленный ключ
zh_cn: 计算键

# CalculatedKeyTooltip
source: Best key found
de: Bester gefundener Schlüssel.
ru: Найден лучший ключ
zh_cn: 找到最好的钥匙

# KeysPerSecondAverageLabel
source: Average keys / sec:
de: Durchschnittliche Schlüssel / sec:
ru: Средние ключи / сек:
zh_cn: 平均密钥/秒：

# KeysPerSecondCurrentLabel
source: Current keys / sec:
de: Aktuelle Schlüssel / sec:
ru: Текущие клавиши / сек:
zh_cn: 当前密钥/秒：

# MethodList1
source: Known plaintext
de: Bekannter Klartext
ru: Известный открытый текст
zh_cn: 已知明文

# LanguageCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# LanguageTooltip
source: Select the language the plaintext is most likely written in.
de: Sprache, in der der Klartext wahrscheinlich verfasst ist
ru: Выберите язык, на котором, скорее всего, написан текст.
zh_cn: 选择最有可能使用明文书写的语言。

# LocalLabel
source: Facts
de: Fakten
ru: факты
zh_cn: 事实

# MaxOffsetCaption
source: Maximum offset
de: Maximaler Offset
ru: Максимальное смещение
zh_cn: 最大偏移

# MaxOffsetTooltip
source: Set the maximum offset to be analyzed.
de: Maximaler Offset, der analysiert werden soll
ru: Установите максимальное смещение, которое необходимо проанализировать.
zh_cn: 设置要分析的最大偏移量。

# MethodCaption
source: Method
de: Methode
ru: метод
zh_cn: 方法

# MethodTooltip
source: Select the method that should be used to attack the cipher.
de: Wähle die Methode, mit der die Verschlüsselung angegriffen werden soll.
ru: Выберите метод, который следует использовать для атаки шифрования.
zh_cn: 选择用于攻击密码的方法。

# MinOffsetCaption
source: Minimum offset
de: Minimaler Offset
ru: Минимальное смещение
zh_cn: 最小偏移

# MinOffsetTooltip
source: Set the minimum offset to be analyzed
de: Minimaler Offset, der analysiert werden soll
ru: Установите минимальное смещение, подлежащее анализу
zh_cn: 设置要分析的最小偏移

# MethodList3
source: Hill Climbing
ru: Скалолазание
zh_cn: 爬山

# PlaintextCaption
source: Plaintext
de: Klartext
ru: Простой текст
zh_cn: 纯文本

# PlaintextTooltip
source: Known plaintext to be used
de: Bekannter Klartext, der verwendet werden soll
ru: Известный открытый текст, который будет использоваться
zh_cn: 使用已知的明文

# PluginCaption
source: M-138 Analyzer
de: M-138 Analysewerkzeug
ru: Анализатор M-138
zh_cn: M-138分析仪

# PluginTooltip
source: A selection of attacks on the M-138 explaining the used hill climbing in detail
de: Eine Auswahl von möglichen Angriffen auf die M-138 und detaillierter Beschreibung des verwendeten Hill-Climbings
ru: Выбор атак на M-138, подробно объясняющий используемый холминг
zh_cn: 对M-138的攻击选择，详细解释了二手爬坡

# ResultTextCaption
source: Resulting plaintext
de: Resultierender Klartext
ru: Результат открытого текста
zh_cn: 产生的纯文本

# ResultTextTooltip
source: Resulting plaintext using the best found key
de: Resultierender Klartext unter Benutzung des besten gefundenen Schlüssels
ru: Результат открытого текста с использованием наилучшего найденного ключа
zh_cn: 使用找到的最佳关键字生成的纯文本

# StartLabel
source: Start time:
de: Startzeit:
ru: Время начала:
zh_cn: 开始时间：

# TextHeader
source: Plaintext
de: Klartext
ru: Простой текст
zh_cn: 纯文本

# TopTenL
source: Top ranking keys
de: Bestenliste der Schlüssel
ru: Лучшие рейтинговые ключи
zh_cn: 排名最高的键

# ValueHeader
source: Value
de: Wert
ru: Стоимость
zh_cn: 值

# CiphertextCaption
source: Ciphertext
de: Geheimtext
ru: зашифрованный
zh_cn: 密文

# StripsCaption
source: Strips
de: Streifen
ru: полоски
zh_cn: 带子

# StripsTooltip
source: Enter the strips as string, where each line defines one strip.
de: Geben Sie die zu verwendenden Streifen als String ein, wobei jeder Streifen in einer Zeile steht.
ru: Введите полосы как строку, где каждая строка определяет одну полосу.
zh_cn: 输入条带作为字符串，其中每一行定义一个条带。

# LanguageList3
source: Spanish
de: Spanisch
ru: испанский
zh_cn: 西班牙文

# RemainingLabel
source: Remaining:
de: Verbleibend:
ru: Осталось:
zh_cn: 剩余的：

# OffsetHeader
source: Offset
ru: офсет
zh_cn: 抵消

# Copy_all
source: Copy all lines
de: Kopiere alle Zeilen
ru: Скопировать все строки
zh_cn: 复制所有行

source: Copy key
de: Kopiere Schlüssel
ru: Копировать ключ
zh_cn: 复制键

source: Copy key phrase
de: Kopiere Schlüsselwort
ru: Скопировать ключевую фразу
zh_cn: 复制关键短语

# Copy_line
source: Copy selected line
de: Kopiere ganze Zeile
ru: Копировать выбранную строку
zh_cn: 复制所选行

source: Copy text
de: Kopiere Text
ru: Копировать текст
zh_cn: 复制文字

source: Copy value
de: Kopiere Wert
ru: Копировать значение
zh_cn: 复制值

# MethodList4
source: Simulated Annealing
ru: Имитация отжига
zh_cn: 模拟退火

# HighscoreBeepCaption
source: Highscore Beep
ru: Рекордный сигнал
zh_cn: 高分蜂鸣

# HighscoreBeepTooltip
source: Make a sound if a new highscore has been found. Highscores in the first 10 seconds are ignored.
de: Gebe Signalton wieder, wenn ein neuer Highscore gefunden wurde. In den ersten 10 Sekunden der Suche wird kein Ton wiedergegeben.
ru: Сделайте звук, если будет найден новый рекорд. Рекорды в течение первых 10 секунд игнорируются.
zh_cn: 如果找到新的高分，请发出声音。前10秒的高分将被忽略。

# KillCounterCaption
source: Kill counter
de: Stop-Zähler
ru: Убить счетчика
zh_cn: 杀死计数器

# KillCounterTooltip
source: After how many iterations without finding a better value should the search be abandoned?
de: Nach wie vielen Versuchen ohne Verbesserung des Highscores soll die Suche abgebrochen werden?
ru: После того, сколько итераций, не найдя лучшего значения, следует отказаться от поиска?
zh_cn: 在经过几次迭代后没有找到更好的值时，应该放弃搜索吗？
