Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Keccak/Properties/Resources.*.resx
Languages: de

# CapacityTooltip
source: Size of capacity in bit
de: Größe der Capacity in bit

# DebugDataStreamTooltip
source: Output stream for debug information
de: Ausgabestrom für Debuginformationen

# DebugStreamCaption
source: Debug output stream
de: Debug-Ausgabestrom

# InputDataStreamTooltip
source: Input data to be hashed
de: Eingabedaten, deren Hashwert berechnet wird

# InputStreamCaption
source: Input stream
de: Eingabedatenstrom

# KECCAKFunctionTooltip
source: Select the version of Keccak
de: Auswahl der Keccak-Variante

# ManualSettingsCaption
source: Adjust manually
de: Manuell einstellen

# ManualSettingsTooltip
source: Specify the Keccak parameters manually
de: Keccak-Parameter manuell festlegen

# OutputDataStreamTooltip
source: Output data
de: Ausgabedaten

# OutputLengthCaption
source: Output length
de: Ausgabelänge

# OutputLengthTooltip
source: Size of output length in bit (must be divisible by 8)
de: Ausgabelänge in bit (muss durch 8 teilbar sein)

# OutputStreamCaption
source: Output stream
de: Ausgabestrom

# ParametersCaption
source: Parameters
de: Parameter

# PluginDescription
source: Keccak algorithm
de: Keccak-Algorithmus

# SelectedStateSizeCaption
source: State size
de: State-Größe

# SelectedStateSizeTooltip
source: Set the size of the state in bit (must match the sum of bit rate and capacity)
de: Größe des States in bit festlegen (muss mit der Summe von Bitrate und Kapazität übereinstimmen)

# OutputMatchError
source: Output length must be divisible by 8.
de: Ausgabelänge muss durch 8 teilbar sein.

# OutputTooLongWarning
source: Output too long. It will be truncated to 174,760 bit.
de: Die Ausgabe ist zu lang. Sie wird auf 174.760 bit gekürzt.

# RateTooltip
source: Set the Size of bit rate in bit (must be divisible by 8)
de: Größe der bit-Rate in bit festlegen (muss durch 8 teilbar sein)

# StateSizeMatchError
source: The sum of bit rate and capacity must match the selected state size.
de: Die Summe aus bit-Rate und Capacity muss mit der Größe des States übereinstimmen.

# PresentationCaption
source: Enable presentation
de: Präsentation einschalten

# PresentationGroupCaption
source: Presentation
de: Präsentation

# PresentationTooltip
source: Check if presentation should be shown
de: Auswählen, ob die Präsentation angezeigt werden soll.

# PresInitialization
source: Initialization
de: Initialisierung

# PresIntroduction
source: Introduction
de: Einführung

# PresAbsorbingPhaseExplanation
source: Input block #{0} is XORed on the state. When examining the state before and after the absorbtion it can be observed that the capacity part (the lower part of the state) is unmodified.
de: Eingabeblock #{0} wird auf den r-bit-Anteil des States geXORed. Bei genauerer Betrachtung des States kann man sehen, dass der Capacity-Anteil (unterer Teil des States) nicht verändert wird.

# PresAbsorbingPhaseText
source: Every block p of the padded input is absorbed by the sponge state with an XOR operation. The input blocks affect the {0} bit of the r-bit part. The c-bit part is not affected. After the absorbtion the Keccak permutation (Keccak-f) is executed to diffuse the state bits.
de: Jeder Block p der gepaddeten Eingabedaten wird mit einer XOR-Operation von dem Sponge-State "aufgesaugt". Die Eingabeblöcke betreffen die {0} bit des r-bit-Anteils. Der c-bit-Anteil wird nicht beeinflusst. Nach dem Aufsaugen wird die Keccak-Permutation (Keccak-f) ausgeführt, um die State-Bits zu vermischen.

# PresChiPhaseText
source: Chi iterates over each row of the state.
de: Chi iteriert über jede Zeile des States.

# PresChiStepText
source: Each bit of a row is XORed with the logical conjunction of the two bits to the right of the considered bit. The first bit of those two bits is inverted before the logical conjunction.
de: Jedes bit einer Zeile wird XOR-verknüpft mit der Konjunktion der beiden Bits zur Rechten des betrachteten Bits. Das erste von den beiden Bits wird vor der Konjunktion invertiert.

# PresExecution
source: Execution
de: Ausführung

# PresExecutionInfoBitRateSize
source: Bit rate size: {0} bit
de: Größe der bit-Rate: {0} bit

# PresExecutionInfoCapacitySize
source: Capacity size: {0} bit
de: Größe der Capacity: {0} bit

# PresExecutionInfoStateSize
source: State size: {0} bit
de: Größe des State: {0} bit

# PresExecutionMessageLength
source: Input length: {0} bit = {1} byte
de: Länge der Eingabedaten: {0} bit = {1} Byte

# PresExecutionNumberOfBlocks
source: Number of input blocks (padded input length / bit rate size): {0}
de: Anzahl Eingabeblöcke (Länge der gepaddeten Eingabe / bit-Rate-Größe): {0}

# PresExecutionPaddedMessageLength
source: Padded input length: {0} bit = {1} byte
de: Länge der gepaddeten Eingabe: {0} bit = {1} Byte

# PresInitializationText
source: The state of the sponge construction is initialized. Each of the {0} bit of the state is initialized to 0. The state is partitioned into two parts: Capacity ({1} bit) and Bit Rate ({2} bit). You can freely adjust the parameters if you choose the Keccak version "Keccak" in the settings.
de: Der Zustand (State) der Sponge-Konstruktion wird initialisiert. Jedes der {0} State-Bits wird mit dem Wert 0 initialisiert. Der State ist in zwei Teile geteilt: Capacity ({1} bit) und bit-Rate ({2} bit). Sie können diese Parameter frei anpassen, wenn Sie als Keccak-Version in den Einstellungen die Option "Keccak" auswählen.

# PresInputInformation
source: Input Information
de: Eingabe-Information

# PresIotaPhaseText
source: Iota XORs a round constant on the first lane (x=1, y=1).
de: Iota XORed eine Runden-Konstante mit der ersten Lane (x=1, y=1).

# PresIotaStepText
source: The value of the current round constant is presented in the red rectangle between the green blocks. The green blocks present the old and new value of the lane. The round constants differ in each round.
de: Die Runden-Konstante der aktuellen Runde ist in dem roten Rechteck zu sehen. Die grünen Blöcke stellen den alten und neuen Wert der Lane dar. Die Runden-Konstanten unterscheiden sich in jeder Runde.

# PresKeccakFIterations
source: {0} Iterations
de: {0} Runden

# PresKeccakFPhaseText
source: The Keccak-f permutation performs 12 + 2 * l rounds. For the selected state size l equals {0} which makes a total of {1} rounds. Each round consists of five step mappings which permute the state in different ways.
de: Keccak-f besteht aus 12 + 2 * l Runden. Bei der eingestellten State-Größe entspricht l dem Wert {0} und die Gesamtanzahl an Runden beträgt 24. In jeder Runde werden fünf "Step-Mappings" ausgeführt, die den State auf unterschiedliche Weise permutieren.

# PresKeccakFStateMapping
source: To facilitate the presentation of the step mappings, the state is represented as a three-dimensional cube. The row and column size is fixed to 5 bits. The lane size depends on the state size ({1} bit for the selected state size).
de: Damit die Step-Mappings einfacher dargestellt werden können, wird der State durch einen dreidimensionalen Würfel repräsentiert. Die Länge der Reihen (row) und Spalten (column) ist jeweils 5 bit. Die Länge der Lanes hängt von der State-Größe ab (bei der ausgewählten State-Größe beträgt die Länge der Lanes {1} bit).

# PresOverview
source: Overview
de: Übersicht

# PresPiPhaseText
source: Pi permutes the positioning of the lanes within the state. The lane coordinates of the cube are shifted for improved visualization.
de: Pi permutiert die Anordnung der Lanes. Zur anschaulichen Visualisierung sind die Koordinaten des Würfels verschoben.

# PresPiStepText
source: Every lane except the lane at x=1, y=1 (black) is moved to a different position. The right cube presents the new lane positions of the colored lanes. Already moved lanes are grayed out.
de: Jede Lane außer der Lane bei x=1, y=1 (schwarz) wird an eine neue Position verschoben. Der rechte Würfel zeigt die neuen Positionen der eingefärbten Lanes. Bereits verschobene Lanes werden grau dargestellt.

# PresRhoPhaseText
source: Rho iterates over each lane of the state.
de: Rho iteriert über jede Lane des States.

# PresRhoStepText
source: Each lane is right-rotated by a certain value (depicted in the red rectangle). The upper green block represents the lane before rotation, the lower green block represents the lane after rotation.
de: Jede Lane wird um einen bestimmten Wert (rot markiert) nach rechts rotiert. Der obere grüne Block stellt die Lane vor der Rotation dar, der untere grüne Block nach der Rotation.

# PresRoundOfRounds
source: Round {0}/{1}
de: Runde {0}/{1}

# PresSpongeConstructionParameter
source: Sponge Construction Parameter
de: Parameter der Sponge-Konstruktion

# PresSqueezingPhaseExplanation
source: The {0}-bit hash value is extracted from the bit rate part (upper part of the state).
de: Der {0}-bit Hashwert wird aus dem bit-Rate-Anteil (oberer Teil des States) extrahiert.

# PresSqueezingPhaseText
source: The hash value is extracted from the r-bit part of the state (z). If the size of the requested output is larger than r, the state is permuted repetitively and more output is extracted between the permutations until the required output length is obtained.
de: Der Hashwert wird aus dem r-bit Anteil des States extrahiert (z). Sofern die angeforderte Ausgabelänge größer ist als r, wird der State mehrfach permutiert und zwischen den Permutationen werden weitere Ausgaben extrahiert, bis die gewünschte Ausgabelänge erreicht ist.

# PresThetaPhaseText
source: Theta iterates over each column of the state.
de: Theta iteriert über jede Spalte des States.

# PresThetaStepText
source: The parities of two nearby columns (turquoise and light green) are XORed. The result is XORed with each bit of the considered column (green).
de: Die Paritäten zweier benachbarter Spalten (türkis und hellgrün) werden XOR-verknüpft. Das Ergebnis wird XOR-verknüpft mit jedem bit der betrachteten Spalte (grün).

# PresAutorun
source: Autorun
de: Autoschritt

# PresAutorunSpeed
source: Speed
de: Tempo

# PresNewState
source: New State
de: Neuer State

# PresNext
source: Next
de: Weiter

# PresNextBlock
source: Skip f
de: Überspringe f

# PresNextStep
source: Skip Step
de: Überspringe Schritt

# PresOldState
source: Old State
de: Alter State

# PresOutputHash
source: Hash Output
de: Hash Ausgabe

# PresSkipIntroduction
source: Skip Introduction
de: Einführung überspringen

# PresOutputLengthError
source: The selected output length is not supported by the presentation. Please select an output length that is smaller or equal to the selected bit rate.
de: Die angegebene Ausgabelänge wird nicht von der Präsentation unterstützt. Bitte eine Ausgabelänge wählen, die kleiner oder gleich der ausgewählten bit Rate ist.

# PresStateSizeError
source: The selected state size is not supported by the presentation. Please select a state size of atleast 200 bit.
de: Die ausgewählte Größe für den State wird nicht von der Präsentation unterstützt. Bitte eine State Größe von mindestens 200 bit auswählen.

# PresStepPresentationNotAvailable
source: The presentation for {0} is only supported for a state size of 1600 bit.
de: Die Präsentation von {0} ist nur bei einer State Größe von 1600 bit möglich.

# PresRotationOffset
source: Rotation Offset:
de: Rotations-Offset:

# PresPresentation
source: Presentation
de: Präsentation

# SuffixBitsInvalidError
source: The domain separation bit string contains invalid characters. Only binary characters (0 and 1) are allowed.
de: Der Domain-Separation bit-String enthält ungültige Zeichen. Es sind nur binäre Zeichen (0 und 1) erlaubt.

# SuffixBitsTooLongError
source: The maximum length of the domain separation bit string is 8 bit.
de: Die maximale Länge des Domain-Separation bit-Strings beträgt 8 bit.

# SuffixBitsTooltip
source: Specify a bit string of up to 8 bits which is appended to the input to enable domain separation.
de: Festlegen eines bis zu 8 bit langen bit-Strings, welcher hinter die Eingabe angehängt wird und zur Domänen-Trennung verwendet wird.
