Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Huffman/Properties/Resources.*.resx
Languages: ru, zh_cn

# ActionCaption
source: Action
ru: действие
zh_cn: 行动

# ActionList1
source: Compress
ru: Компресс
zh_cn: 压缩

# ActionList2
source: Decompress
ru: Распаковка
zh_cn: 解压缩

# ActionTooltip
source: Select the algorithm action.
ru: Выберите действие алгоритма.
zh_cn: 选择算法操作。

# CharacterCaption
source: Character
ru: символ
zh_cn: 字符

# CodeCaption
source: Code
ru: Код
zh_cn: 码

# CodeTableCaption
source: Code table
ru: Таблица кодов
zh_cn: 代码表

# CompressedSizeCaption
source: Compressed size:
ru: Сжатый размер:
zh_cn: 压缩大小：

# CompressionRateCaption
source: Compression rate:
ru: Степень сжатия:
zh_cn: 压缩率：

# EncodingCaption
source: Input data encoding
ru: Кодирование входных данных
zh_cn: 输入数据编码

# EncodingList5
source: ASCII
zh_cn: ASCII码

# EncodingTooltip
source: Select the encoding of the input data.
ru: Выберите кодировку входных данных.
zh_cn: 选择输入数据的编码。

# FrequencyCaption
source: Frequency
ru: частота
zh_cn: 频率

# InputBytesCaption
source: byte[] input
ru: байт []
zh_cn: 字节[]输入

# InputBytesTooltip
source: Input data to be processed by the Huffman algorithm
ru: Входные данные для обработки алгоритмом Хаффмана
zh_cn: 使用霍夫曼算法处理的输入数据

# InputHuffmanTreeCaption
source: Huffman tree input
ru: Вход дерева Хаффмана
zh_cn: 霍夫曼树输入

# InputHuffmanTreeTooltip
source: Input Huffman tree used for compressing input data
ru: Входное дерево Хаффмана, используемое для сжатия входных данных
zh_cn: 输入霍夫曼树，用于压缩输入数据

# OutputBytesCaption
source: byte[] output
ru: байт []
zh_cn: byte []输出

# OutputBytesTooltip
source: Data processed by the Huffman algorithm
ru: Данные, обработанные алгоритмом Хаффмана
zh_cn: 霍夫曼算法处理的数据

# OutputHuffmanTreeCaption
source: Huffman tree output
ru: Выход дерева Хаффмана
zh_cn: 霍夫曼树输出

# OutputHuffmanTreeTooltip
source: Huffman tree used for compressing input data
ru: Дерево Хаффмана, используемое для сжатия входных данных
zh_cn: 霍夫曼树用于压缩输入数据

# PluginCaption
source: Huffman
ru: Хаффман
zh_cn: 霍夫曼

# PluginTooltip
source: Data compression algorithm
ru: Алгоритм сжатия данных
zh_cn: 数据压缩算法

# PresentationCaption
source: Presentation format
ru: Формат презентации
zh_cn: 简报格式

# PresentationList1
source: Text
ru: Текст
zh_cn: 文本

# PresentationList2
source: Binary
ru: двоичный
zh_cn: 二元

# PresentationTooltip
source: Select the format to be used for presenting input data.
ru: Выберите формат, который будет использоваться для представления входных данных.
zh_cn: 选择用于显示输入数据的格式。

# UncompressedSizeCaption
source: Uncompressed size:
ru: Несжатый размер:
zh_cn: 未压缩大小：
