Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/MorseCode/Properties/Resources.*.resx
Languages: de

# ActionCaption
source: Action
de: Aktion

# ActionTooltip
source: The action to be done
de: Die Aktion die durchgeführt werden soll

# CodeCaption
source: Code type
de: Code-Art

# CodeTooltip
source: Switches between different types of morse code and tap code
de: Schaltet zwischen verschiedenen Morse-Code-Typen und Klopfcode um

source: Decode
de: Decodieren

source: Encode
de: Encodieren

# FrequencyCaption
source: Frequency
de: Frequenz

# FrequencyTooltip
source: Sets the frequency of the morse tones.
de: Legt die Frequenz der Morse-Töne fest.

# InputTextCaption
source: Text input
de: Eingabetext

# InputTextTooltip
source: The text to be encoded or decoded
de: Der Text der encodiert oder decodiert werden soll

# OutputTextCaption
source: Text output
de: Ausgabetext

# OutputTextTooltip
source: The encoded or decoeded text
de: Der encodierte oder decodierte Text

source: Play
de: Abspielen

# PluginTooltip
source: Encodes a text to Morse code or decodes a Morse code to text
de: Encodiert einen Text in einen Morsecode oder decodiert einen Morsecode in einen Text

# SoundOutputCaption
source: Sound output
de: Sound-Ausgabe

# SoundOutputTooltip
source: Generated sound samples are outputted here
de: Generierte Sound-Samples werden hier ausgegeben

source: Tap Code
de: Klopfcode

# TickDurationCaption
source: Tick duration
de: Tick-Dauer

# TickDurationTooltip
source: The time of a "tick" in miliseconds
de: Die Zeit die ein "Tick" in Millisekunden lang ist

# VolumeCaption
source: Volume
de: Lautstärke

# VolumeTooltip
source: Volume of the generated audio
de: Lautstärke des generierten Audios
