Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DCAKeyRecovery/Properties/Resources.*.resx
Languages: de, zh_cn

# AnyRoundAttackDataColHeader1
source: key candidate
de: Schlüsselkandidat
zh_cn: 关键候选人

# AnyRoundAttackDataColHeader2
source: Number of hits
de: Anzahl Treffer
zh_cn: 命中数

# AnyRoundAttackDataColHeader3
source: Probability
de: Wahrscheinlichkeit
zh_cn: 可能性

# AnyRoundAttackEnd
source: End:
de: Ende:
zh_cn: 结束：

# AnyRoundAttackRound
source: Attacked encryption round:
de: Angegriffene Verschlüsselungsrunde:
zh_cn: 被攻击的加密回合：

# AnyRoundAttackRoundResults
source: Result
de: Ergebnis
zh_cn: 结果

# AnyRoundAttackStart
source: Start:
zh_cn: 开始：

# AnyRoundAttackStatus
source: Status
zh_cn: 状态

# AnyRoundExpectedHitCount
source: Expected number of hits:
de: Erwartete Trefferzahl:
zh_cn: 预期的点击数：

# AnyRoundExpectedProbability
source: Expected probability:
de: Erwartete Wahrscheinlichkeit:
zh_cn: 预期概率：

# AnyRoundMessagePairCount
source: Count of message pairs (unfiltered/filtered):
de: Anzahl Nachrichtenpaare (ungefiltert/gefiltert):
zh_cn: 消息对数（未过滤/已过滤）：

# AnyRoundRecoveredRoundKey
source: Recovered round key:
de: Wiederhergesteller Rundenschlüssel:
zh_cn: 恢复的回合密钥：

# AttackLastRoundHeader
source: {0} key recovery
de: {0} Schlüsselwiederherstellung
zh_cn: {0}密钥恢复

source: Automatic mode
de: Automatischer Modus
zh_cn: 自动模式

# AutomaticModeToolTip
source: No user input required in automatic mode
de: Im automatischen Modus ist keine Eingabe durch den Anwender notwendig
zh_cn: 在自动模式下无需用户输入

# BtnNextKey
source: Skip key
de: Schlüssel überspringen
zh_cn: 跳过键

# BtnNextMessage
source: Skip message pair
de: Nachrichten-Paar überspringen
zh_cn: 跳过消息对

# BtnSkip
source: Skip
de: Überspringen
zh_cn: 跳跃

# BtnStart
source: Start
zh_cn: 开始

# ChoiceOfAlgorithm
source: Choice of cipher
de: Wahl der Chiffre
zh_cn: 密码选择

# ChoiceOfAlgorithmToolTop
source: At this point, you can select one of the ciphers contained in the list. This can be examined by differential cryptanalysis.
de: An dieser Stelle kann eine der in der Liste enthaltenen Chiffren ausgewählt werden. Diese kann mittels differenzieller Kryptoanalyse untersucht werden.
zh_cn: 此时，您可以选择列表中包含的一种密码。这可以通过差分密码分析来检查。

# Cipher1
source: Cipher 1 (16 bit block size, 2 round keys, 32 bit key length)
de: Chiffre 1 (16 bit Blockgröße, 2 Rundenschlüssel, 32 bit Schlüssellänge)
zh_cn: 密码1（16位块大小，2个圆形密钥，32位密钥长度）

# Cipher1CipherViewCol
source: key candidate
de: Schlüsselkandidat
zh_cn: 关键候选人

# Cipher1SummaryResultViewTotalSummary
source: Total
zh_cn: 总

# Cipher2
source: Cipher 2 (16 bit block size, 4 round keys, 64 bit key length)
de: Chiffre 2 (16 bit Blockgröße, 4 Rundenschlüssel, 64 bit Schlüssellänge)
zh_cn: 密码2（16位块大小，4个圆形密钥，64位密钥长度）

# Cipher2SummaryResultViewRound1
source: Round 1
de: Runde 1
zh_cn: 第1轮

# Cipher2SummaryResultViewRound2
source: Round 2
de: Runde 2
zh_cn: 第二回合

# Cipher2SummaryResultViewRound3
source: Round 3
de: Runde 3
zh_cn: 第三回合

# Cipher2SummaryResultViewTotalSummary
source: Total
de: Gesamt
zh_cn: 总

# Cipher3
source: Cipher 3 (16 bit block size, 6 round keys, 96 bit key length)
de: Chiffre 3 (16 bit Blockgröße, 6 Rundenschlüssel, 96 bit Schlüssellänge)
zh_cn: 密码3（16位块大小，6个圆形密钥，96位密钥长度）

# Cipher3SummaryResultViewRound1
source: Round 1
de: Runde 1
zh_cn: 第1轮

# Cipher3SummaryResultViewRound2
source: Round 2
de: Runde 2
zh_cn: 第二回合

# Cipher3SummaryResultViewRound3
source: Round 3
de: Runde 3
zh_cn: 第三回合

# Cipher3SummaryResultViewRound4
source: Round 4
de: Runde 4
zh_cn: 第四回合

# Cipher3SummaryResultViewRound5
source: Round 5
de: Runde 5
zh_cn: 第五回合

# Cipher3SummaryResultViewTotalSummary
source: Total
de: Gesamt
zh_cn: 总

# DifferentialInput
source: Differential
de: Differenzial
zh_cn: 微分

# DifferentialInputToolTip
source: Input for the differential
de: Eingang für das Differenzial
zh_cn: 差动输入

# EncryptedMessagePairsInput
source: ciphertext message pairs
de: Geheimtext-Nachrichtenpaare
zh_cn: 密文消息对

# EncryptedMessagePairsInputToolTip
source: Input for the ciphertext message pairs
de: Eingang für die Geheimtext-Nachrichtenpaare
zh_cn: 密文消息对的输入

# ExpectedDifferential
source: Expected difference
zh_cn: 预期差异

# ExpectedDifferentialToolTip
source: Output for the expected difference
zh_cn: 预期差异的输出

# FinishedOutput
source: Finished
de: Fertig
zh_cn: 已完成

# FinishedOutputToolTip
source: The output indicates to the DCA PathFinder component that the calculation has been completed.
de: Der Ausgang zeigt der DKA-PfadFinder-Komponente an, dass die Berechnung abgeschlossen ist
zh_cn: 输出向DCA PathFinder组件指示计算已完成。

# Lang
source: GER
zh_cn: 德国

# LastRoundAttackCurrentCiphertext
source: Current ciphertext:
de: Aktueller Schlüsseltext:
zh_cn: 当前密文：

# LastRoundAttackCurrentKeyCandidate
source: Current key candidate:
de: Aktueller Schlüsselkandidat:
zh_cn: 目前的主要候选人：

# LastRoundAttackCurrentKeyOfAll
source: Number of keys to be tested:
de: Anzahl zu testende Schlüssel:
zh_cn: 要测试的密钥数：

# LastRoundAttackCurrentPlaintext
source: Current plaintext:
de: Aktueller Klartext:
zh_cn: 当前的纯文本：

# LastRoundAttackDataColHeader1
source: Iteration
zh_cn: 迭代

# LastRoundAttackDataColHeader2
source: Remaining key candidates
de: Verbleibende Schlüsselkandidaten
zh_cn: 其余主要候选人

# LastRoundAttackEnd
source: End:
de: Ende:
zh_cn: 结束：

# LastRoundAttackExpectedDifference
source: Expected difference:
de: Erwartete Differenz:
zh_cn: 预期差异：

# LastRoundAttackNumberOfExaminedPairs
source: Examined plaintext/ciphertext pairs:
de: Untersuchte Klartext-/Schlüsseltext-Paare:
zh_cn: 检查的明文/密文对：

# LastRoundAttackRemainingKeyCandidates
source: Remaining key candidates:
de: Verbleibende Schlüsselkandidaten:
zh_cn: 其余主要候选人：

# LastRoundAttackRound
source: Attacked encryption round:
de: Angegriffene Verschlüsselungsrunde:
zh_cn: 被攻击的加密回合：

# LastRoundAttackRoundResults
source: Iterations
de: Iterationen
zh_cn: 迭代次数

# LastRoundAttackStart
source: Start:
zh_cn: 开始：

# LastRoundAttackStatus
source: Status
zh_cn: 状态

# MessageDifferenceOutput
source: Expected difference:
de: Erwartete Differenz
zh_cn: 预期差异：

# MessageDifferenceOutputToolTip
source: Output for the expected difference
de: Ausgang für die erwartete Differenz
zh_cn: 预期差异的输出

# MessageNoResult
source: The last round keys could not be restored. This can happen if one of the previous round keys was incorrectly calculated. Possibly the parameters in the DCA PathFinder component should be selected again.
de: Die letzten Rundenschlüssel konnten nicht wiederhergestellt werden. Das kann passieren, wenn einer der vorigen Rundenschlüssel falsch berechnet wurde. Möglicherweise sollten die Parameter in der DKA-PfadFinder-Komponente neu gewählt werden.
zh_cn: 最后一轮密钥无法恢复。如果以前的回合密钥之一计算不正确，则会发生这种情况。可能应再次选择DCA PathFinder组件中的参数。

# NeededMessageCountOutput
source: Number of message pairs
de: Anzahl Nachrichtenpaare
zh_cn: 消息对数

# NeededMessageCountOutputToolTip
source: Output for the number of requested message pairs
de: Ausgang für die Anzahl an angeforderten Nachrichtenpaare
zh_cn: 输出请求的消息对数

# nextStepTextRun1
source: Differential cryptanalysis is continued in the
de: Die differenzielle Kryptoanalyse wird in der
zh_cn: 继续进行差分密码分析。

# nextStepTextRun2
source: DCA PathFinder componend
de: DKA-PfadFinder-Komponente fortgesetzt
zh_cn: DCA PathFinder组件

# PerformanceSettingsGroup
source: Speed options
de: Geschwindigkeitsoptionen
zh_cn: 速度选项

# PluginCaption
source: DCA KeyRecovery
de: DKA-KeyRecovery
zh_cn: DCA密钥恢复

# PluginTooltip
source: This component performs the recovery of key bits from round keys.
de: Diese Komponente führt die Wiederherstellung von Schlüsselbits von Rundenschlüsseln durch.
zh_cn: 该组件从轮回密钥中执行密钥位的恢复。

# RoundKeysOutput
source: Round keys
de: Rundenschlüssel
zh_cn: 圆键

# RoundKeysOutputToolTip
source: Output of the round keys
de: Ausgabe der Rundenschlüssel
zh_cn: 回合键的输出

# SummaryResultViewCountOfDecryptions
source: Number of decryptions:
de: Anzahl Entschlüsselungen:
zh_cn: 解密次数：

# SummaryResultViewCountOfMessages
source: Number of messages:
de: Anzahl Nachrichten:
zh_cn: 讯息数量：

# SummaryResultViewCurrentRound
source: Attacked encryption round:
de: Angegriffene Verschlüsselungsrunde:
zh_cn: 被攻击的加密回合：

# SummaryResultViewEndTime
source: End:
de: Ende:
zh_cn: 结束：

# SummaryResultViewRecoveredK0
source: Restored round key k0:
de: Wiederhergestellter Rundenschlüssel K0:
zh_cn: 恢复回合密钥k0：

# SummaryResultViewRecoveredK1
source: Restored round key k1:
de: Wiederhergestellter Rundenschlüssel K1:
zh_cn: 恢复回合密钥k1：

# SummaryResultViewRecoveredK2
source: Restored round key k2:
de: Wiederhergestellter Rundenschlüssel K2:
zh_cn: 恢复回合密钥k2：

# SummaryResultViewRecoveredK3
source: Restored round key k3:
de: Wiederhergestellter Rundenschlüssel K3:
zh_cn: 恢复回合密钥k3：

# SummaryResultViewRecoveredK4
source: Restored round key k4:
de: Wiederhergestellter Rundenschlüssel K4:
zh_cn: 恢复回合密钥k4：

# SummaryResultViewRecoveredK5
source: Restored round key k5:
de: Wiederhergestellter Rundenschlüssel K5:
zh_cn: 恢复回合密钥k5：

# SummaryResultViewStartTime
source: Start:
zh_cn: 开始：

# SummaryResultViewTestedKeys
source: Tested keys:
de: Getestete Schlüssel:
zh_cn: 经过测试的按键：

# TabItemHeaderCipher
source: Detailed view
de: Detaillierte Ansicht
zh_cn: 详细视图

# TabItemHeaderRoundSummary
source: Round status
de: Rundenstatus
zh_cn: 回合状态

# TabItemHeaderSummary
source: Overall status
de: Gesamtstatus
zh_cn: 整体状况

# ThreadCount
source: Threads to be used
de: Nutzbare Threads
zh_cn: 要使用的线程

# ThreadCountToolTip
source: Specifies the number of threads to use for the calculation.
de: Spezifiziert die Anzahl an Threads, die zur Berechnung verwendet werden.
zh_cn: 指定用于计算的线程数。

# ThreadSettingError
source: The maximum number of threads for your system is {0} threads. This number is limited by your processor.
de: Die maximale Anzahl an Threads für Ihr System beträgt {0} Threads. Diese Anzahl ist durch Ihren Prozessor limitiert.
zh_cn: 您系统的最大线程数为{0}个线程。此数字受您的处理器的限制。

# TutorialSettingsGroup
source: Tutorial options
de: Tutorialoptionen
zh_cn: 教程选项

# UIUpdateWhileExecution
source: Update of the user interface during calculations
de: Update der Benutzerschnittstelle während Berechnungungen
zh_cn: 计算过程中用户界面的更新

# UIUpdateWhileExecutionToolTip
source: Determines whether the user interface is updated during calculations or only after the calculation has been completed. This setting affects the execution speed of the component.
de: Legt fest, ob die Benutzerschnittstelle während Berechnungen aktualisiert wird oder erst nach Fertigstellung der Berechnung. Diese Einstellung beeinflusst die Ausführungsgeschwindigkeit der Komponente.
zh_cn: 确定是在计算过程中还是仅在计算完成后才更新用户界面。此设置影响组件的执行速度。

# UnencryptedMessagePairsInput
source: Plaintext message pairs
de: Klartext-Nachrichtenpaare
zh_cn: 纯文本消息对

# UnencryptedMessagePairsInputToolTip
source: Input for the plaintext message pairs
de: Eingang für die Klartext-Nachrichtenpaare
zh_cn: 纯文本消息对的输入
