Repository: CrypToolProject/CrypTool-2
Catalog: Startcenter/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginTooltip
source: Easy access to the CT2 functions in the Startcenter
de: Einfacher Einstieg in alle CT2-Funktionen im Startcenter
ru: Легкий доступ к функциям CT2 в Startcenter
zh_cn: 轻松访问Startcenter中的CT2功能

source: Date:
de: Datum:
ru: Дата:
zh_cn: 日期：

source: Main functions
de: Hauptfunktionen
ru: Основные функции
zh_cn: 主要功能

source: News
de: Neues
ru: Новости
zh_cn: 新闻

# RecentFiles
source: Recently opened workspaces
de: Zuletzt geöffnete Arbeitsflächen
ru: Последние открытые рабочие поверхности
zh_cn: 最近打开的工作区

source: Templates
de: Vorlagen
ru: Шаблоны
zh_cn: 范本

source: Title:
de: Titel:
ru: Заглавие:
zh_cn: 标题：

source: Loading RSS feed
de: Lade RSS Feed
ru: Загрузка RSS-ленты
zh_cn: 加载RSS feed

source: Please wait...
de: Bitte warten...
ru: Пожалуйста, подождите...
zh_cn: 请耐心等待...

# This_is_an_AnotherEditor_file_
source: This is a project file of the deprecated AnotherEditor
de: Dies ist eine Datei des veralteten AnotherEditor
ru: Это файл проекта устаревшего AnotherEditor
zh_cn: 这是不推荐使用的AnotherEditor的项目文件

# This_is_a_WorkspaceManager_file_
source: This is a workspace editor file
de: Dies ist eine Datei des Workspace-Editors
ru: Это файл редактора рабочей области
zh_cn: 这是一个工作区编辑器文件

source: This is a standalone component
de: Dies ist eine alleinstehende Komponente
ru: Это автономный компонент
zh_cn: 这是一个独立的组件

# This_is_a_template
source: This is a project template
de: Dies ist eine Projektvorlage
ru: Это шаблон проекта
zh_cn: 这是一个项目模板

source: Connect to the distributed computing platform
de: Verbinden Sie sich mit der verteilten Berechnungsplattform
ru: Подключитесь к распределенной вычислительной платформе
zh_cn: 连接到分布式计算平台

source: Create a new workspace with the graphical editor
de: Erstellen Sie einen neuen Workspace mit dem grafischen Editor
ru: Создайте новое рабочее пространство с графическим редактором
zh_cn: 使用图形编辑器创建新的工作区

source: Read the online documentation
de: Lesen Sie die Online-Dokumentation
ru: Прочтите онлайн-документацию
zh_cn: 阅读在线文档

# Search
source: Enter one or more search terms. Press Ctrl + R to update the template list
de: Geben Sie einen oder mehrere Suchbegriffe ein. Drücken Sie Strg + R, um die Vorlagenliste zu aktualisieren
ru: Введите один или несколько условий поиска. Нажмите Ctrl + R, чтобы обновить список шаблонов
zh_cn: 输入一个或多个搜索词。按Ctrl + R更新模板列表

# Use_the_wizard_to_easily_try_some_CrypTool_2_0_features_
source: Use the wizard to easily try some CrypTool 2 features
de: Erkunden Sie CrypTool 2 mit dem Wizard
ru: Используйте мастер, чтобы легко попробовать некоторые функции CrypTool 2
zh_cn: 使用向导轻松尝试一些CrypTool 2功能

# Visit_the_official_CrypTool_2_0_website_
source: Visit the official CrypTool 2 website
de: Besuchen Sie die offizielle Website von CrypTool 2
ru: Посетите официальный сайт CrypTool 2
zh_cn: 访问官方CrypTool 2网站

# Welcome_to_CrypTool_2_0
source: Welcome to CrypTool 2. There are two ways for a quick start: Click on the wizard button in the section “Main Functions” to get a guided tour, or load one of the pre-defined workflows in the section “Templates” which demonstrate the program functionality in cryptographic scenarios.
de: Willkommen bei CrypTool 2: Eine geführte Tour erhalten Sie durch einen Klick auf die Wizard-Schaltfläche (in der Sektion "Hauptfunktionen"). Fertige kryptografische Szenarien können Sie in der Sektion "Vorlagen" aufrufen und anpassen.
ru: Добро пожаловать в CrypTool 2. Есть два способа быстрого запуска: нажмите кнопку мастера в разделе «Основные функции», чтобы получить экскурсию, или загрузите один из предопределенных рабочих процессов в разделе «Шаблоны», которые демонстрируют функциональности программы в криптографических сценариях.
zh_cn: 欢迎使用CrypTool2。有两种快速入门的方法：单击“主要功能”部分中的向导按钮以进行导览，或在“模板”部分中加载预定义的工作流程之一，以演示加密方案中的程序功能。

source: Search
de: Suche
ru: Поиск
zh_cn: 搜索

# ClearList
source: Clear list of recently opened templates
de: Liste der zuletzt geöffneten Vorlagen löschen
ru: Очистить недавно открытый список шаблонов
zh_cn: 清除最近打开的模板列表

# Delete
source: Delete this entry
de: Diesen Eintrag löschen
ru: Удалить эту запись
zh_cn: 删除此项

# StartTemplate
source: Start this entry
de: Diesen Eintrag starten
ru: Запустить эту запись
zh_cn: 开始此项

# Follow_us_on_Facebook_
source: Visit us on Facebook
de: Besuchen Sie uns auf Facebook
ru: Посетите нас на Facebook
zh_cn: 在Facebook上访问我们

# CrypTutorials
source: Watch videos about CrypTool 2
de: Schauen Sie sich Videos über CrypTool 2 an
ru: Смотрите видео о CrypTool 2
zh_cn: 观看有关CrypTool 2的视频

# Visit_the_ct_book_page_
source: Visit the CrypTool Book page on the CrypTool portal
de: Besuchen Sie die Seite des CrypTool-Buchs auf dem CrypTool-Portal

source: Collapse all
de: Alle zuklappen
ru: Свернуть все
zh_cn: 全部收缩

source: Expand all
de: Alle aufklappen
ru: Расширить все
zh_cn: 展开全部

source: Copy description
de: Beschreibung kopieren
ru: Описание копирования
zh_cn: 复制说明

source: Open template
de: Öffne Vorlage
ru: открытый шаблон
zh_cn: 开启范本

source: Open CrypTool Store
de: Öffnen Sie den CrypTool-Store
ru: Откройте CrypTool Store
zh_cn: 打开CrypTool商店

# Visit_official_YouTube_channel
source: Visit the official YouTube channel: You will learn how to use CrypTool 2 and how to add your own functions
de: Besuchen Sie den offiziellen YouTube-Kanal (Englisch): Sie erfahren, wie man CrypTool 2 benutzt und um eigene Funktionen erweitert
ru: Посетите официальный канал YouTube (английский): вы узнаете, как использовать CrypTool 2 и добавите свои собственные функции
zh_cn: 访问官方YouTube频道：您将学习如何使用CrypTool 2并添加自己的功能

source: Category:
de: Kategorie:
ru: категория:
zh_cn: 类别：

source: (double click to open)
de: (Doppelklick zum Öffnen)
ru: (двойной щелчок, чтобы открыть)
zh_cn: （双击打开）

# View_CT2_Tutorial
source: View a tutorial video about CrypTool 2 on YouTube
de: Sehen Sie sich ein (englisches) Tutorial-Video zu CrypTool 2 auf YouTube an
ru: Посмотрите обучающее видео на английском языке о CrypTool 2 на YouTube
zh_cn: 在YouTube上观看有关CrypTool 2的教程视频

source: External resources
de: Externe Ressourcen
ru: Внешние ресурсы

# FileListClearQuestion
source: Do you really want to clear the recently opened files list?
de: Möchten Sie wirklich die Liste der zuletzt geöffneten Dateien löschen?

# FileListClearQuestionTitle
source: Clear recently opened files list
de: Liste der zuletzt geöffneten Dateien löschen

# CTBookURL
source: https://www.cryptool.org/en/documentation/ctbook/
de: https://www.cryptool.org/de/documentation/ctbook/

# PluginCaption
source: Startcenter
zh_cn: 起始中心

# RSS_error_Message
source: RSS error
ru: RSS-ошибка
zh_cn: RSS错误

source: Exception
ru: исключение
zh_cn: 例外

source: CrypTool Store
zh_cn: CrypTool商店

source: YouTube videos
ru: YouTube видео
zh_cn: YouTube视频
