Repository: CrypToolProject/CrypTool-2
Catalog: CrypWin/SettingsTabs/Resources/res.*.resx
Languages: de

# balloonTooltip
source: This is a balloon
de: Das ist eine Sprechblase

# MainSettings
source: General settings
de: Generelle Einstellungen

# NotificationIconSettings
source: Notification icon
de: Benachrichtigungssymbol

# checkLabelContent
source: Update-check preferences (changes are firstly effective after a restart of CT2)
de: Update-Check-Präferenzen (Geänderte Einstellungen erst nach Neustart von CT2 wirksam)

# checkPeriodicallyContent
source: Check periodically
de: Periodisch auf Updates prüfen

# checkPeriodicallyText1Content
source: Check for updates every
de: Alle

# checkPeriodicallyText2Content
source: minutes
de: Minuten nach Updates suchen

# checkPeriodicallyToolTip
source: Check to check for updates periodically
de: Markieren, um periodisch nach Updates zu suchen

# checkPeriodicallyWarningContent
source: Please enter a valid integer
de: Bitte eine gültige Ganzzahl eintragen

# minutesInputToolTip
source: The checking time interval (in minutes)
de: Zeitintervall (in Minuten), in dem nach Updates gesucht wird

# autoDownloadContent
source: Download automatically
de: Automatisch herunterladen

# autoDownloadToolTip
source: Check to download updates automatically (if available)
de: Markieren, um Updates automatisch herunterzuladen (falls verfügbar)

# autoInstallContent
source: Install automatically
de: Automatisch installieren

# autoInstallToolTip
source: Check to install updates automatically
de: Markieren, um Updates automatisch zu installieren

# autoLabelContent
source: Auto download/install options
de: Optionen für Auto-Download und Installation

# checkStartupContent
source: Check on startup
de: Bei Start prüfen

# checkStartupToolTip
source: Check to check for updates on startup
de: Markieren, um beim Start nach Updates zu suchen

source: Show balloon log messages in balloon
de: Zeige Sprechblasennachrichten in Sprechblase

source: Show error log messages in balloon
de: Zeige Fehlernachrichten in Sprechblase

source: Preferred language
de: Bevorzugte Sprache

# Please_restart_CrypTool
source: Please restart CT2 for the change to take effect
de: Bitte starten Sie CT2 neu, damit die Änderungen sichtbar werden

# Show_balloon_log_messages_in_balloon_tooltip
source: Check this to show the balloon log messages in the tray icon balloon!
de: Markieren Sie dies, um Sprechblasennachrichten in der Trayicon-Sprechblase anzuzeigen!

# Show_error_log_messages_in_balloon_tooltip
source: Check this to show the error log messages in the tray icon balloon!
de: Markieren Sie dies, um Fehlernachrichten in der Trayicon-Sprechblase anzuzeigen!

# Reopen_last_opened_file
source: Reopen last opened workspaces on startup
de: Öffne die letzten offenen Arbeitsflächen beim Start von CT2

# Reopen_last_opened_file_tooltip
source: Check this to reopen the last opened file on CT2 startup
de: Markieren Sie dies, um die letzten offenen Arbeitsflächen beim nächsten Start von CT2 wieder zu öffnen

# PluginSettings
source: Settings of single components
de: Einstellungen zu Einzel-Komponenten

# BackgroundingContent
source: Hide in background when CT2 is closing and workspaces are still running
de: CT2 im Hintergrund verstecken, wenn beim Schließen Arbeitsflächen ausgeführt werden

# BackgroundingLabelContent
source: Backgrounding options
de: Hintergrund-Ausführung

# BackgroundingToolTip
source: Check to background CT2 when clicking close if there are running tasks
de: Markieren, um auch nach dem Schließen laufende Arbeitsflächen im Hintergrund weiter auszuführen

# PowerModeLabelContent
source: Power saving options
de: Energiespar-Optionen

# SavePowerContent
source: Stop workspaces if power mode is offline
de: Arbeitsflächen anhalten bei Batteriebetrieb

# SavePowerToolTip
source: Check to save power
de: Markieren, um bei Batteriebetrieb Energie zu sparen.

source: Show debug log messages in balloon
de: Zeige Debugnachrichten in Sprechblase

# Show_debug_log_messages_in_balloon_tooltip
source: Check this to show the debug log messages in the tray icon balloon!
de: Markieren Sie dies, um Debugnachrichten in der Trayicon-Sprechblase anzuzeigen!

source: Show info log messages in balloon
de: Zeige Informationsnachrichten in Sprechblase

# Show_info_log_messages_in_balloon_tooltip
source: Check this to show the info log messages in the tray icon balloon!
de: Markieren Sie dies, um Informationsnachrichten in der Trayicon-Sprechblaseanzuzeigen!

source: Show warning log messages in balloon
de: Zeige Warnungsnachrichten in Sprechblase

# Show_warning_log_messages_in_balloon_tooltip
source: Check this to show the warning log messages in the tray icon balloon
de: Markieren Sie dies, um Warnungsnachrichten in der Trayicon-Sprechblase anzuzeigen

# cultureBox_tooltip
source: Set your preferred language for CT2 here
de: Wählen Sie Ihre bevorzugte Sprache für CT2 hier aus

source: Startup behaviour
de: Startverhalten

# Restart_Button_Content
source: Restart now
de: Jetzt neu starten

# BalloonDuration_Tooltip
source: Set the duration of the balloon visibility in seconds
de: Geben Sie hier die Dauer der Sichtbarkeit für Sprechblasen an

source: Deselect all
de: alle abwählen

# EditorOpeningContent
source: New editor opening behaviour
de: Verhalten bei Öffnen eines neuen Editors

# HeaderDescription
source: Description
de: Beschreibung

# HeaderDisabled
source: Disabled
de: deaktiviert

# HeaderPluginName
source: Component name
de: Komponenten-Name

source: Invert selection
de: Auswahl invertieren

# RecentFileListLength
source: Length of the list of recently opened cwm files:
de: Anzahl der Einträge in der Liste zuletzt geöffneter cwm-Dateien:

source: seconds
de: Sekunden lang

# SelectEditorLabel
source: Select preferred editor:
de: Wähle bevorzugten Editor:

# SelectEditorTooltip
source: Choose the editor you want to open when clicking the "New" button here
de: Wählen Sie den Editor, der geöffnet werden soll, wenn der "Neu"-Button geklickt wird

source: Select all
de: alle wählen

source: Show balloon for
de: Zeige Sprechblase

# UseLastEditorContent
source: Use last editor
de: Verwende letzten Editor

# UseLastEditorTooltip
source: Check this to always open the last used editor when clicking the "New" button
de: Markieren, um immer den zuletzt verwendeten Editor zu öffnen, wenn der "Neu"-Button gedrückt wird

# UseLastPathContent
source: Use last path in file dialog
de: Verwende letzten Pfad im Datei-Dialog

# UseLastPathTooltip
source: Check this to ensure that the file dialog always shows the last path
de: Markieren, damit der Datei-Dialog immer den zuletzt verwendeten Pfad öffnet

# Copy_all
source: Copy all lines
de: Kopiere alle Zeilen

source: Copy line
de: Kopiere Zeile

# SingletonApplication
source: Start CT2 as singleton application (Global setting: a change of the setting here has no effect. It has to be manually edited in CrypWin.exe.config file in the CT2 installation directory).
de: Starte CT2 als Singleton-Anwendung (Globale Einstellungen: Eine Änderung der Einstellung hier hat keine Auswirkung. Sie muss manuell in der Datei CrypWin.exe.config im Installationsverzeichnis von CT2 bearbeitet werden).

# SingletonApplicationTooltip
source: When checked only one CT2 application instance is started. Disable in CrypWin.exe.config file in the CT2 installation directory for allowing CT2 being started multiple times
de: Wenn diese Option aktiviert ist, wird nur eine CT2-Anwendungsinstanz gestartet. Deaktivieren Sie diese Einstellung in der Datei "CrypWin.exe.config" im Installationsverzeichnis von CrypTool 2, damit CT2 mehrmals gestartet werden kann. Hier wird nur der Status angezeigt.

source: Write log file
de: Logdatei schreiben

# WriteLogFileTooltip
source: If this setting is enabled, CT2 automatically writes all of its log to a logfile
de: Wenn diese Einstellung aktiviert ist, schreibt CrypTool 2 automatisch das gesamte Log in eine Logdatei

source: General settings
de: Generelle Einstellungen

source: Message settings
de: Nachrichten-Einstellungen

# NotificationIconSettingsTitle
source: Notification icon settings
de: Benachrichtigungssymbol-Einstellungen

# UpdaterSettingsTitle
source: Updater settings
de: Updater-Einstellungen

source: Component Settings
de: Komponenten-Einstellungen

# EnableDisableComponents
source: Enable/disable components (for developers)
de: Komponenten ein-/ausschalten (für Entwickler)

# DoYouReallyWantReset
source: Do you really want to reset CT2's settings to default values? A restart is performed then.
de: Möchten Sie die CT2-Einstellungen wirklich auf die Standardwerte zurücksetzen? Dann wird ein Neustart durchgeführt.

# ResetCrypTool2Button
source: Reset CT2 to default setting values
de: CrypTool 2 auf Standardeinstellungen zurücksetzen

# ResetCrypTool2Label
source: Reset CrypTool 2 (General settings, workspace, and updates)
de: CrypTool 2 zurücksetzen (Generelle Einstellungen, Arbeitsfläche und Updates)

source: Reset to default values
de: Zu Standardeinstellungen zurücksetzen

# LogLevelTooltip
source: Sets the default loglevel, which is used in the CT2 log window. For example: If the level is set to 'Info', only logs with level 'Info' and above are shown.
de: Legt die Standard-Logstufe fest, die im CT2-Log verwendet wird. Beispiel: Wenn das Level auf "Info" eingestellt ist, werden nur Logs mit dem Level "Info" und höher angezeigt

source: Error
de: Fehler

source: Warning
de: Warnung

source: Show status bar
de: Zeige Statusleiste

# ShowStatusBarTooltip
source: Enables/disables the CrypTool 2 status bar
de: Statusleiste von CrypTool 2 ein-/ausschalten
