Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DCAPathFinder/Properties/Resources.*.resx
Languages: de, zh_cn

# AbortingPolicy1
source: Global maximum
de: Globales Maximum
zh_cn: 全局最大值

# AbortingPolicy2
source: Global threshold
de: Globaler Schwellwert
zh_cn: 全球门槛

# AbortingThresholdBestCharacteristicSearch
source: Threshold value for abort (best characteristic)
de: Schwellwert zum Abbruch (beste Charakteristik)
zh_cn: 中止的阈值（最佳特性）

# AbortingThresholdBestCharacteristicSearchToolTip
source: Determines the probability at which the search for the best characteristic will be aborted.
de: Legt fest, bei welcher Wahrscheinlichkeit die Suche nach der besten Charakteristik abgebrochen wird
zh_cn: 确定中止搜索最佳特性的概率。

# AbortingThresholdDifferentialSearch
source: Threshold value for abort (differential)
de: Schwellwert zum Abbruch (Differenzial)
zh_cn: 中止的阈值（微分）

# AbortingThresholdDifferentialSearchToolTip
source: Determines the probability at which the search for characteristics for differential formation is aborted.
de: Legt fest, bei welcher Wahrscheinlichkeit die Suche nach Charakteristiken zur Differenzialbildung abgebrochen wird
zh_cn: 确定中止差异搜索特征的概率。

source: Automatic mode
de: Automatischer Modus
zh_cn: 自动模式

# AutomaticModeHeader
source: DCA PathFinder works in automatic mode.
de: PfadFinder arbeitet im automatischen Modus.
zh_cn: DCA PfadFinder在自动模式下工作。

# AutomaticModeToolTip
source: No user input required in automatic mode
de: Im automatischen Modus ist keine Eingabe durch den Anwender notwendig
zh_cn: 在自动模式下无需用户输入

# BtnPrevChapter
source: Chapter back
de: Kapitel zurück
zh_cn: 回章

# BtnSkipChapter
source: Skip chapter
de: Kapitel überspringen
zh_cn: 跳过章节

# CharacteristicCount
source: #Characteristics:
de: #Charakteristiken:
zh_cn: ＃特点：

# ChoiceAbortingPolicyPolicy
source: Aborting policy
de: Abbruchstrategie
zh_cn: 中止政策

# ChoiceOfAbortingPolicyGroup
source: search options
de: Suchoptionen
zh_cn: 搜索选项

# ChoiceOfAbortingPolicyToolTop
source: By selecting the aborting policy, the behavior of the search for the best differential is controlled.
de: Durch Auswahl der Abbruchstrategie wird das Verhalten der Suche nach dem besten Differenzial gesteuert
zh_cn: 通过选择中止策略，可以控制搜索最佳差异的行为。

# ChoiceOfAlgorithm
source: Choice of the cipher
de: Wahl der Chiffre
zh_cn: 密码选择

# ChoiceOfAlgorithmGroup
source: Tutorial options
de: Tutorial-Optionen
zh_cn: 教程选项

# ChoiceOfAlgorithmToolTop
source: At this point, you can select one of the ciphers contained in the list. This can be examined by differential cryptanalysis.
de: An dieser Stelle kann eine der in der Liste enthaltenen Chiffren ausgewählt werden. Diese kann mittels differenzieller Kryptoanalyse untersucht werden.
zh_cn: 此时，您可以选择列表中包含的一种密码。这可以通过差分密码分析来检查。

# ChoiceOfSearchPolicy
source: Search policy
de: Suchstrategie
zh_cn: 搜索政策

# ChoiceOfSearchPolicyGroup
source: Search options
de: Suchoptionen
zh_cn: 搜索选项

# ChoiceOfSearchPolicyToolTop
source: By selecting a search policy, the behavior of the search for the best differential is controlled.
de: Durch Auswahl einer Suchstrategie wird das Verhalten der Suche nach dem besten Differenzial gesteuert
zh_cn: 通过选择搜索策略，可以控制搜索最佳差异的行为。

# ChosenMessagePairsCount
source: Number of message pairs
de: Anzahl Nachrichten-Paare
zh_cn: 消息对数

# ChosenMessagePairsCountToolTip
source: Determines the number of message pairs to be generated.
de: Bestimmt die Anzahl der zu generierenden Nachrichten-Paare
zh_cn: 确定要生成的消息对的数量。

# Cipher1
source: Tutorial 1: Cipher 1 (16 bit block size, 2 round keys, 32 bit key length)
de: Tutorial 1: Chiffre 1 (16 bit Blockgröße, 2 Rundenschlüssel, 32 bit Schlüssellänge)
zh_cn: 教程1：密码1（16位块大小，2个圆形密钥，32位密钥长度）

# Cipher2
source: Tutorial 2: Cipher 2 (16 bit block size, 4 round keys, 64 bit key length)
de: Tutorial 2: Chiffre 2 (16 bit Blockgröße, 4 Rundenschlüssel, 64 bit Schlüssellänge)
zh_cn: 教程2：密码2（16位块大小，4个圆形密钥，64位密钥长度）

# Cipher3
source: Tutorial 3: Cipher 3 (16 bit block size, 6 round keys, 96 bit key length)
de: Tutorial 3: Chiffre 3 (16 bit Blockgröße, 6 Rundenschlüssel, 96 bit Schlüssellänge)
zh_cn: 教程3：密码3（16位块大小，6个圆形密钥，96位密钥长度）

# Cipher4
source: Tutorial 4: Cipher 4 (4 bit block size , 4 round keys, 16 bit key length)
de: Tutorial 4: Chiffre 4 (4 bit Blockgröße , 4 Rundenschlüssel, 16 bit Schlüssellänge)
zh_cn: 教程4：密码4（4位块大小，4个圆形密钥，16位密钥长度）

# DCAOptions
source: Differential cryptanalysis Options
de: Differenzielle Kryptoanalyse Optionen
zh_cn: 差分密码分析选项

# DescriptionContent2
source: Tutorial 1 uses cipher 1 of the DCA ToyCipher component. This cipher works on 16 bit blocks and uses two 16 bit round keys. One encryption round is executed. In this tutorial both unknown round keys are restored.
de: Tutorial 1 verwendet Chiffre 1 der DKA-ToyCipher-Komponente. Diese Chiffre arbeitet auf 16 bit Blöcken und verwendet zwei je 16 bit lange Rundenschlüssel. Es wird eine Verschlüsselungsrunde ausgeführt. In diesem Tutorial werden beide unbekannte Rundenschlüssel wiederhergestellt.
zh_cn: 教程1使用DCA ToyCipher组件的密码1。该密码适用于16位块，并使用两个16位轮回密钥。执行一轮加密。在本教程中，将还原两个未知的回合密钥。

# DescriptionContent3
source: Tutorial 2 uses cipher 2 of the DCA ToyCipher component. This cipher works on 16 bit blocks and uses four 16 bit round keys. Three encryption rounds are executed. In this tutorial all unknown round keys are restored.
de: Tutorial 2 verwendet Chiffre 2 der DKA-ToyCipher-Komponente. Diese Chiffre arbeitet auf 16 bit Blöcken und verwendet vier je 16 bit lange Rundenschlüssel. Es werden drei Verschlüsselungsrunden ausgeführt. In diesem Tutorial werden alle unbekannte Rundenschlüssel wiederhergestellt.
zh_cn: 教程2使用DCA ToyCipher组件的密码2。该密码适用于16位块，并使用四个16位轮回密钥。执行三轮加密。在本教程中，将还原所有未知的回合密钥。

# DescriptionContent4
source: Tutorial 3 uses cipher 3 of the DCA ToyCipher component. This cipher works on 16 bit blocks and uses six 16 bit round keys. Five encryption rounds are executed. In this tutorial all unknown round keys are restored.
de: Tutorial 3 verwendet Chiffre 3 der DKA-ToyCipher-Komponente. Diese Chiffre arbeitet auf 16 bit Blöcken und verwendet sechs je 16 bit lange Rundenschlüssel. Es werden fünf Verschlüsselungsrunden ausgeführt. In diesem Tutorial werden alle unbekannte Rundenschlüssel wiederhergestellt.
zh_cn: 教程3使用DKA ToyCipher组件的密码3。该密码适用于16位块，并使用六个16位轮回密钥。执行五轮加密。在本教程中，将还原所有未知的回合密钥。

# DescriptionHeader
source: Description of the tutorials
de: Beschreibung der Tutorials
zh_cn: 教程说明

# DescriptionSubHeader1
source: Tutorial 1
zh_cn: 教程1

# DescriptionSubHeader2
source: Tutorial 2
zh_cn: 教程2

# DescriptionSubHeader3
source: Tutorial 3
zh_cn: 教程3

source: display options
de: Darstellungsoptionen
zh_cn: 显示选项

# EndTime
source: End:
de: Ende:
zh_cn: 结束：

# ExpectedDifferential
source: Expected difference
de: Erwartete Differenz
zh_cn: 预期差异

# ExpectedDifferentialToolTip
source: Output for the expected difference
de: Ausgang für die erwartete Differenz
zh_cn: 预期差异的输出

# InputDiffHeader1
source: Input difference
de: Eingabedifferenz
zh_cn: 输入差异

# InputDiffR1Header1Run1
source: u
zh_cn: ü

# InputDiffR2Header1Run1
source: u
zh_cn: ü

# InputDiffR3Header1Run1
source: u
zh_cn: ü

# InputDiffR4Header1Run1
source: u
zh_cn: ü

# InputDiffR5Header1Run1
source: u
zh_cn: ü

# MessageCount
source: message pair count
de: Nachrichtenanzahl
zh_cn: 消息对数

# MessageCountToolTip
source: Output for the message pair count
de: Ausgang für die Nachrichtenanzahl
zh_cn: 消息对计数的输出

# NoCharacteristicFoundError
source: No characteristics found. Please check the settings for the search and abort policy
de: Es wurden keine Charakteristik(en) gefunden. Bitte die Einstellungen zur Such- und Abbruchstrategie kontrollieren.
zh_cn: 找不到特征。请检查搜索和中止策略的设置

# OverviewContent1
source: Welcome to the differential cryptanalysis (DCA) tutorial. This method for the analysis of round-based symmetric block ciphers aims at recovering single bits up to complete round keys. This procedure was published in 1991 by the two Israeli researchers Eli Biham and Adi Shamir.
de: Herzlich willkommen zum Tutorial zur differenziellen Kryptoanalyse (DKA). Dieses Verfahren zur Analyse rundenbasierter symmetrischer Blockchiffren hat das Ziel, einzelne Bits bis hin zu vollständigen Rundenschlüsseln wiederherzustellen. Veröffentlicht wurde dieses Verfahren 1991 von den zwei israelischen Forschern Eli Biham und Adi Shamir.
zh_cn: 欢迎来到差分密码分析（DCA）教程。这种用于分析基于回合的对称分组密码的方法的目的是恢复单个位直到完整的回合密钥。该程序由以色列的两位研究人员伊莱·比厄姆（Eli Biham）和阿迪·沙米尔（Adi Shamir）于1991年发表。

# OverviewContent2
source: This tutorial covers the DCA in three parts. Part 1 conveys the basic idea of the DCA by means of a cipher with only a single encryption round. Part 2 deepens this idea using a cipher with three encryption rounds. Part 3 deepens the knowledge by increasing the complexity of the cipher to five encryption rounds.
de: Dieses Tutorial behandelt die DKA in drei Teilen. Teil 1 vermittelt die grundlegende Idee der DKA anhand einer Chiffre mit nur einer einzigen Verschlüsselungsrunde. Teil 2 vertieft diese Idee anhand einer Chiffre mit drei Verschlüsselungsrunden. In Teil 3 wird das vermittelte Wissen vertieft durch Erhöhung der Komplexität der Chiffre auf fünf Verschlüsselungsrunden.
zh_cn: 本教程分三部分介绍DCA。第1部分通过带有加密回合的密码来传达DCA的基本思想。第2部分使用带有三轮加密的密码加深了这个想法。第3部分通过将密码的复杂性增加到五轮加密来加深知识。

# OverviewContent3
source: In the configuration of this component the number of the tutorial and the tutorial mode can be selected.
de: In der Konfiguration dieser Komponente können die Nummer des Tutorials und der Tutorial-Modus ausgewählt werden.
zh_cn: 在此组件的配置中，可以选择教程的编号和教程模式。

# OverviewContent4
source: Have fun trying out and breaking the ciphers!
de: Viel Spaß beim Ausprobieren und Brechen der Chiffren!
zh_cn: 尝试并打破密码，玩得开心！

# OverviewContent5
source: (This introduction can be skipped by starting the workspace)
de: (Diese Einführung kann durch Starten des Workspaces übersprungen werden)
zh_cn: （可以通过启动工作空间来跳过此介绍）

# OverviewHeader
source: Differential Cryptanalysis Tutorial
de: Tutorial zur differenziellen Kryptoanalyse
zh_cn: 差分密码分析教程

# OverviewPreambleHeader
source: Preamble
de: Vorwort
zh_cn: 前言

# Path
source: Differential
de: Differenzial
zh_cn: 微分

# PathToolTip
source: Describes the flow of differences through a cipher
de: Beschreibt den Fluss der Differenzen durch eine Chiffre
zh_cn: 描述通过密码的差异流

# PerformanceSettingsGroup
source: Speed options
de: Geschwindigkeitsoptionen
zh_cn: 速度选项

# PluginCaption
source: DCA PathFinder
de: DKA-PfadFinder
zh_cn: DCA路径查找器

# PluginTooltip
source: This component searches for differentials in a symmetric block cipher depending on parameters specified by the user.
de: Diese Komponente sucht in Abhängigkeit von durch den User spezifizierten Parametern nach Differenzialen in einer symmetrischen Blockchiffre.
zh_cn: 该组件根据用户指定的参数搜索对称块密码中的差分。

# PresentationMode
source: Tutorial mode
de: Tutorialmodus
zh_cn: 教程模式

# PresentationModeToolTip
source: If tutorial mode is activated, a presentation with information on differential cryptanalysis is displayed for each tutorial.
de: Bei aktiviertem Tutorialmodus erfolgt je Tutorial eine Präsentation mit Informationen zur differenziellen Kryptoanalyse
zh_cn: 如果激活了教程模式，则会为每个教程显示一个包含差分密码分析信息的演示文稿。

# ProbabilityHeader
source: Probability
de: Wahrscheinlichkeit
zh_cn: 可能性

# R1
source: Round 1
de: Runde 1
zh_cn: 第1轮

# R2
source: Round 2
de: Runde 2
zh_cn: 第二回合

# R3
source: Round 3
de: Runde 3
zh_cn: 第三回合

# R4
source: Round 4
de: Runde 4
zh_cn: 第四回合

# R5
source: Round 5
de: Runde 5
zh_cn: 第五回合

# ReadyInput
source: Trigger
de: Bereit
zh_cn: 触发

# ReadyInputToolTip
source: The trigger input signals to the DCA PathFinder component that the DCA KeyRecovery component has completed its calculation.
de: Der Bereit-Eingang signalisiert der DKA-PfadFinder-Komponente, dass die Schlüsselwiederherstellungs-Komponente ihre Berechnung abgeschlossen hat
zh_cn: 触发输入信号向DCA PathFinder组件发出DCA KeyRecovery组件已完成其计算的信号。

# Round
source: Attacked encryption round:
de: Angegriffene Verschlüsselungsrunde:
zh_cn: 被攻击的加密回合：

# SBoxes
source: Attacked S-boxes:
de: Angegriffene S-Boxen:
zh_cn: 被攻击的S盒：

# SBoxWarning
source: At least one S-box must be marked to continue the attack.
de: Es muss mindestens eine S-Box makiert werden, um mit dem Angriff fortzufahren.
zh_cn: 必须标记至少一个S-box才能继续进行攻击。

# SearchConfiguration
source: Configuration
de: Konfiguration
zh_cn: 组态

source: Search policy:
de: Suchstrategie:
zh_cn: 搜索政策：

# SearchPolicy1
source: Best characteristic (heuristic), then differential search
de: Beste Charakteristik (Heuristik), dann Differenzialsuche
zh_cn: 最佳特征（启发式），然后进行差异搜索

# SearchPolicy2
source: Best characteristic (depth search), then differential search
de: Beste Charakteristik (Tiefensuche), dann Differenzialsuche
zh_cn: 最佳特征（深度搜索），然后进行差异搜索

# SearchPolicy3
source: All characteristics by depth search
de: Alle Charakteristiken mittels Tiefensuche
zh_cn: 所有特征按深度搜索

# SearchResults
source: Result
de: Ergebnisse
zh_cn: 结果

# StartMaskContent1
source: The tutorial beginns when you start the workspace.
de: Durch Starten des Workspaces beginnt das Tutorial.
zh_cn: 当您启动工作区时，教程开始。

# StartMaskContent2Run1
source: In this template, the
de: In dieser Vorlage ist das
zh_cn: 在此模板中，

# StartMaskContent2Run2
source: Tutorial {0}
zh_cn: 教程{0}

# StartMaskContent2Run3
source: is selected.
de: voreingestellt.
zh_cn: 被选中。

# StartMaskHeader
source: Ready for execution
de: Bereit zur Ausführung
zh_cn: 准备执行

# StartTime
source: Start:
zh_cn: 开始：

# ThreadCount
source: Threads to be used
de: Nutzbare Threads
zh_cn: 要使用的线程

# ThreadCountToolTip
source: Specifies the number of threads to use for the calculation.
de: Spezifiziert die Anzahl an Threads, die zur Berechnung verwendet werden.
zh_cn: 指定用于计算的线程数。

# ThreadSettingError
source: The maximum number of threads for your system is {0} threads. This number is limited by your processor.
de: Die maximale Anzahl an Threads für Ihr System beträgt {0} Threads. Diese Anzahl ist durch Ihren Prozessor limitiert.
zh_cn: 您系统的最大线程数为{0}个线程。此数字受您的处理器的限制。

# Tutorial1DifferentialCryptanalysisHeader
source: 2. Differential cryptanalysis of cipher 1
de: 2. Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 2.密码1的差分密码分析

# Tutorial1DifferentialCryptanalysisSlide10Content1
source: The value of
de: Der Wert von
zh_cn: 的价值

# Tutorial1DifferentialCryptanalysisSlide10Content2Run1
source: is already known. As indicated on the previous page, the values of k
de: ist bereits bekannt. Wie auf der Seite vorher angedeutet, werden die Werte von k
zh_cn: 是已知的。如前一页所示，k的值

# Tutorial1DifferentialCryptanalysisSlide10Content2Run3
source: guessed. Here is explained how to limit the set of possible correct values: The cryptanalyst tries all values t of k
de: geraten. Hier wird nun erklärt, wie man die Menge möglicher richtiger Werte einschränkt: Der Kryptoanalytiker probiert alle Werte t von k
zh_cn: 猜到了。这里说明了如何限制可能的正确值的集合：密码分析器尝试k的所有值t

# Tutorial1DifferentialCryptanalysisSlide10Content2Run5
source: through and if
de: durch und jedes Mal, wenn
zh_cn: 通过和如果

# Tutorial1DifferentialCryptanalysisSlide10Content3Run1
source: holds true, t is considered a candidate for k
de: gilt, wird t als Kandidat für k
zh_cn: 成立，t被认为是k的候选者

# Tutorial1DifferentialCryptanalysisSlide10Content3Run3
source: . If more than one candidate remains at the end, the attack is repeated with new pairs of plaintext and ciphertext.
de: notiert. Falls mehr als ein Kandidat am Ende übrig bleibt, wird der Angriff wiederholt mit neuen Paaren von Klartext und Geheimtext.
zh_cn: 。如果最后还有一个以上的候选者，则使用新的明文和密文对重新进行攻击。

# Tutorial1DifferentialCryptanalysisSlide10Content4
source: By clicking the "Next" button again, differential cryptanalysis can be performed on cipher 1 in the "DCA KeyRecovery" component.
de: Durch ein weiteres Klicken auf den "Weiter"-Button (Rechtspfeil unten) kann die differenzielle Kryptoanalyse an Chiffre 1 in der Komponente "Schlüssel-Wiederherstellung" ausgeführt werden.
zh_cn: 通过再次单击“下一步”按钮，可以在“ DCA密钥恢复”组件中的密码1上执行差分密码分析。

# Tutorial1DifferentialCryptanalysisSlide10Content4Run1
source: After successful recovery of k
de: Nach erfolgreicher Wiederherstellung von k
zh_cn: 成功恢复k后

# Tutorial1DifferentialCryptanalysisSlide10Content4Run3
source: can k
de: kann k
zh_cn: 可以

# Tutorial1DifferentialCryptanalysisSlide10Content4Run5
source: be calculated immediately. This can be done by calculating the equation
de: sofort berechnet werden. Dieser kann durch Berechnung der Gleichung
zh_cn: 立即计算。这可以通过计算方程来完成

# Tutorial1DifferentialCryptanalysisSlide10Content5Run1
source: be determined.
de: bestimmt werden.
zh_cn: 被确定。

# Tutorial1DifferentialCryptanalysisSlide10Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 密码1的差分密码分析

# Tutorial1DifferentialCryptanalysisSlide1Content1
source: Here we apply the idea of the DCA to Chiffre 1. The structure of a cipher is usually public, so that all components and their functionality are known. The security of a cipher should never be based on the secrecy of the construction, but on the secrecy of the key. This requirement is also called Kerckhoff's principle.
de: Hier wenden wir die Idee der DKA auf Chiffre 1 an. Der Aufbau einer Chiffre ist in aller Regel öffentlich, sodass alle Bestandteile und deren Funktionsweise bekannt sind. Die Sicherheit einer Chiffre sollte niemals auf Geheimhaltung der Konstruktion basieren, sondern auf der Geheimhaltung des Schlüssels. Diese Forderung wird auch Kerckhoffs’ Prinzip genannt.
zh_cn: 在这里，我们将DCA的概念应用于Chiffre1。密码的结构通常是公共的，因此所有组件及其功能都是已知的。密码的安全性永远不应基于构造的保密性，而应取决于密钥的保密性。此要求也称为Kerckhoff原理。

# Tutorial1DifferentialCryptanalysisSlide1Content2Run1
source: Cipher 1
de: Chiffre 1
zh_cn: 密码1

# Tutorial1DifferentialCryptanalysisSlide1Content2Run2
source: consists of key addition and substitution. The structure can be viewed in the DCA ToyCipher component. We now try to find the two unknown round keys k
de: besteht aus Schlüsseladdition und Substitution. Der Aufbau kann in der DKA-ToyCipher-Komponente betrachtet werden. Wir versuchen nun, die zwei unbekannten Rundenschlüssel k
zh_cn: 由密钥添加和替换组成。可以在DCA ToyCipher组件中查看该结构。现在，我们尝试找到两个未知的圆形密钥k

# Tutorial1DifferentialCryptanalysisSlide1Content2Run4
source: and k
de: und k
zh_cn: 和k

# Tutorial1DifferentialCryptanalysisSlide1Content2Run6
source: to recover. To do this, we look at the individual steps of encryption. First the key k
de: wiederherzustellen. Dazu betrachten wir die einzelnen Schritte der Verschlüsselung. Zunächst wird der Schlüssel k
zh_cn: 恢复。为此，我们查看加密的各个步骤。首先钥匙k

# Tutorial1DifferentialCryptanalysisSlide1Content2Run8
source: is added to the input block m:
de: zum Eingabeblock m addiert:
zh_cn: 被添加到输入块m：

# Tutorial1DifferentialCryptanalysisSlide1Content3
source: The intermediate result u is then substituted by the S-boxes:
de: Anschließend erfolgt eine Substitution des Zwischenergebnisses u durch die S-Boxen:
zh_cn: 然后，将中间结果u替换为S框：

# Tutorial1DifferentialCryptanalysisSlide1Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 密码1的差分密码分析

# Tutorial1DifferentialCryptanalysisSlide2Content1Run1
source: Finally, a key addition takes place again (intermediate result v is indicated with k
de: Als Letztes erfolgt wieder eine Schlüsseladdition (Zwischenergebnis v wird mit k
zh_cn: 最后，再次进行密钥加法（中间结果v用k表示

# Tutorial1DifferentialCryptanalysisSlide2Content1Run3
source: added):
de: addiert):
zh_cn: 添加）：

# Tutorial1DifferentialCryptanalysisSlide2Content2Run1
source: The internal variables u and v of the cipher are of great importance in the following, because we use these intermediate results to recover the unknown keys k
de: Den internen Variablen u und v der Chiffre kommt im Folgenden eine hohe Bedeutung zu, denn diese Zwischenergebnisse nutzen wir zur Wiederherstellung der unbekannten Schlüssel k
zh_cn: 密码的内部变量u和v在下面非常重要，因为我们使用这些中间结果来恢复未知密钥k

# Tutorial1DifferentialCryptanalysisSlide2Content2Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial1DifferentialCryptanalysisSlide2Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 密码1的差分密码分析

# Tutorial1DifferentialCryptanalysisSlide3Content1
source: The following figure summarizes the encryption process outlined above on slides 11 to 16.
de: Die folgende Abbildung fasst auf den Slides 11 bis 16 den zuvor skizzierten Verschlüsselungsprozess zusammen.
zh_cn: 下图总结了幻灯片11至16上概述的加密过程。

# Tutorial1DifferentialCryptanalysisSlide3Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 密码1的差分密码分析

# Tutorial1DifferentialCryptanalysisSlide4Content1
source: The following figure summarizes the encryption process outlined above on slides 11 to 16.
de: Die folgende Abbildung fasst auf den Slides 11 bis 16 den zuvor skizzierten Verschlüsselungsprozess zusammen.
zh_cn: 下图总结了幻灯片11至16上概述的加密过程。

# Tutorial1DifferentialCryptanalysisSlide4Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 密码1的差分密码分析

# Tutorial1DifferentialCryptanalysisSlide9bContent6Run1
source: However, these values cannot be directly compared with the internal values u
de: Allerdings können diese Werte nicht direkt mit den internen Werten u
zh_cn: 但是，这些值不能直接与内部值u进行比较。

# Tutorial1DifferentialCryptanalysisSlide9bContent6Run3
source: and u
de: und u
zh_cn: 和你

# Tutorial1DifferentialCryptanalysisSlide9bContent6Run5
source: as these are unknown.
de: verglichen werden, da diese unbekannt sind.
zh_cn: 因为这些是未知的。

# Tutorial1DifferentialCryptanalysisSlide9bContent7Run1
source: From equation (1) it follows that if the round key is correctly guessed k
de: Aus Gleichung (1) ergibt sich, dass bei korrekt geratenem Rundenschlüssel k
zh_cn: 从等式（1）可以得出，如果正确猜出了回合密钥，则k

# Tutorial1DifferentialCryptanalysisSlide9bContent7Run3
source: the following applies:
de: Folgendes gilt:
zh_cn: 以下内容适用：

# Tutorial1DifferentialCryptanalysisSlide9Content1Run1
source: The cryptanalyst knows the parameters m and c, but not the internal intermediate values u and v, since k
de: Der Kryptoanalytiker kennt die Parameter m und c, nicht jedoch die internen Zwischenwerte u und v unbekannt, da k
zh_cn: 密码分析者知道参数m和c，但不知道内部中间值u和v，因为k

# Tutorial1DifferentialCryptanalysisSlide9Content1Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial1DifferentialCryptanalysisSlide9Content1Run5
source: are unknown. However, the cryptanalyst can calculate the difference between the two internal u intermediate values from the difference between the two plaintexts. In the following we consider two messages m
de: unbekannt sind. Allerdings kann der Kryptoanalytiker die Differenz der beiden internen u-Zwischenwerte aus der Differenz der beiden Klartexte berechnen. Wir betrachten im Folgenden zwei Nachrichten m
zh_cn: 未知。但是，密码分析者可以根据两个纯文本之间的差异来计算两个内部u中间值之间的差异。下面我们考虑两个消息m

# Tutorial1DifferentialCryptanalysisSlide9Content1Run7
source: and m
de: und m
zh_cn: 和米

# Tutorial1DifferentialCryptanalysisSlide9Content1Run9
source: and build their difference:
de: und bilden deren Differenz:
zh_cn: 并建立他们的差异：

# Tutorial1DifferentialCryptanalysisSlide9Content2Run1
source: This knowledge can be used to calculate k
de: Dieses Wissen kann verwendet werden, um k
zh_cn: 该知识可用于计算k

# Tutorial1DifferentialCryptanalysisSlide9Content2Run11
source: ). According to equation (1), the difference of the u-values is equal to the difference of m
de: ). Laut obiger Gleichung (1) ist die Differenz der u-Werte gleich der Differenzenbildung von m
zh_cn: ）。根据等式（1），u值的差等于m的差

# Tutorial1DifferentialCryptanalysisSlide9Content2Run13
source: and m
de: und m
zh_cn: 和米

# Tutorial1DifferentialCryptanalysisSlide9Content2Run15
source: . Next, k
de: . Als Nächstes wird k
zh_cn: 。接下来，k

# Tutorial1DifferentialCryptanalysisSlide9Content2Run17
source: is "advised" so that from
de: "geraten", so dass man aus
zh_cn: 被“建议”，以便
