Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DCAPathFinder/Properties/Resources.*.resx
Languages: de, zh_cn

# Tutorial3AttackRound2HeaderRun1
source: Select S-boxes from round 2 to attack key bits from k
de: S-Boxen aus Runde 2 auswählen, um Schlüsselbits von k
zh_cn: 从第2轮中选择S盒以攻击k中的关键位

# Tutorial3AttackRound3HeaderRun1
source: Select S-boxes from round 3 to attack key bits from k
de: S-Boxen aus Runde 3 auswählen, um Schlüsselbits von k
zh_cn: 从第3轮中选择S盒以攻击k中的关键位

# Tutorial3AttackRound4HeaderRun1
source: Select S-boxes from round 4 to attack key bits from k
de: S-Boxen aus Runde 4 auswählen, um Schlüsselbits von k
zh_cn: 从第4轮中选择S盒以攻击k中的关键位

# Tutorial3AttackRound5HeaderRun1
source: Select S-boxes from round 5 to attack key bits from k
de: S-Boxen aus Runde 5 auswählen, um Schlüsselbits von k
zh_cn: 从第5轮中选择S盒以攻击k中的关键位

# Tutorial3FilterHeader
source: 2. Filtering
de: 2. Filterung
zh_cn: 2.筛选

# Tutorial3FilterSlide1Content1
source: During the execution of the DCA, many plaintext pairs are generated which have a certain difference. It may happen that the messages do not follow the path found in the differential through the cipher.
de: Bei der Durchführung der DKA werden viele Klartext-Paare generiert, die eine bestimmte Differenz aufweisen. Es kann vorkommen, dass die Nachrichten dem im Differenzial gefundenen Weg durch die Chiffre nicht folgen.
zh_cn: 在执行DCA期间，会生成许多具有一定差异的明文对。可能会发生消息没有通过密码在差分中找到的路径的情况。

# Tutorial3FilterSlide1Content2
source: If a pair meets the input difference, it does not yet mean that it also meets the last difference.
de: Erfüllt ein Paar die Eingabedifferenz, bedeutet es noch nicht, dass es auch die letzte Differenz erfüllt.
zh_cn: 如果一对满足输入差异，则并不意味着它也满足最后一个差异。

# Tutorial3FilterSlide1Content3
source: When a pair follows the flow of the differential, one speaks of a right pair. On the other hand, a pair that does not follow the differential is called a wrong pair.
de: Wenn ein Paar den Fluss des Differenzials folgt, wird von einem richten Paar gesprochen. Dahingegen wird ein Paar, das nicht dem Differenzial folgt, als falsches Paar bezeichnet.
zh_cn: 当一对跟随差分流时，就说对了。另一方面，不遵循差分的对称为错误对。

# Tutorial3FilterSlide1Header
source: Filtering
de: Filterung
zh_cn: 筛选

# Tutorial3FilterSlide2Content1
source: Wrong pairs can cause problems when restoring the round key you are looking for. These make it difficult to identify the correct round key by hitting incorrect round keys during recovery.
de: Falsche Paare können bei der Wiederherstellung des gesuchten Rundenschlüssels Probleme darstellen. Diese erschweren die Identifizierung des korrekten Rundenschlüssels durch Treffer von falschen Rundenschlüsseln bei der Wiederherstellung.
zh_cn: 错误的配对可能会在恢复所需的回合密钥时引起问题。这些使得通过在恢复过程中敲击不正确的回合键来识别正确的回合键非常困难。

# Tutorial3FilterSlide2Content2
source: It is therefore useful to identify the wrong pairs before restoring the round key and not to consider them further.
de: Es ist daher sinnvoll, falsche Paare vor der Wiederherstellung des Rundenschlüssels zu identifizieren und nicht weiter zu betrachten.
zh_cn: 因此，在恢复回合密钥之前识别错误的对是有用的，而不是进一步考虑它们。

# Tutorial3FilterSlide2Header
source: Filtering
de: Filterung
zh_cn: 筛选

# Tutorial3IntroductionHeader
source: 1. Introduction
de: 1. Einführung
zh_cn: 1.简介

# Tutorial3IntroductionSlide1Content1
source: In Tutorial 1 the idea of differential cryptanalysis was introduced and demonstrated with a cipher consisting of one encryption round with two round keys. In Tutorial 2 the idea was deepened and shown on a cipher with three encryption rounds.
de: In Tutorial 1 wurde die Idee der differenziellen Kryptoanalyse vorgestellt und an einer Chiffre bestehend aus einer Verschlüsselungsrunde mit zwei Rundenschlüsseln demonstriert. In Turorial 2 wurde die Idee vertieft und an einer Chiffre mit drei Verschlüsselungsrudnen gezeigt.
zh_cn: 在教程1中，介绍了差分密码分析的思想，并用一种密码进行了演示，该密码由一轮加密和两轮密钥组成。在教程2中，这个想法得到了深化，并通过三轮加密在密码中显示出来。

# Tutorial3IntroductionSlide1Content2
source: For this purpose, structures such as characteristics and differentials were introduced.
de: Dazu wurden Strukturen wie Charakteristiken und Differenziale eingeführt.
zh_cn: 为此，引入了诸如特性和差分之类的结构。

# Tutorial3IntroductionSlide1Content3
source: In this tutorial further techniques are shown, which are used with the DCA.
de: In diesem Tutorial werden weitere Techniken gezeigt, die bei der DKA verwendet werden.
zh_cn: 在本教程中，将显示与DCA一起使用的其他技术。

# Tutorial3IntroductionSlide1Content4
source: Cipher 3 consists of five encryption rounds and six round keys. The already demonstrated code will be deepened with this cipher.
de: Chiffre 3 besteht aus fünf Verschlüsselungsrunden und sechs Rundenschlüsseln. Das bereits demonstrierte soll an dieser Chiffre darüber hinaus nochmal vertieft werden.
zh_cn: 密码3由五个加密回合和六个回合密钥组成。使用此密码将深化已演示的代码。

# Tutorial3IntroductionSlide1Header
source: Introduction
de: Einführung
zh_cn: 介绍

# Tutorial3IntroductionSlide3Content1
source: Two techniques for filtering are presented below.
de: Zur Filterung werden im Folgenden zwei Techniken vorgestellt.
zh_cn: 下面介绍了两种过滤技术。

# Tutorial3IntroductionSlide3Content2
source: The first technique considered is the difference between the ciphertexts of a pair. When attacking with DCA not all S-boxes of an encryption round are attacked at the same time, but often only a subset.
de: Als erste Technik wird die Differenz der Geheimtexte eines Paares betrachtet. Beim Angriff mittels DKA werden oft aus Gründen des Aufwands nicht alle S-Boxen eiener Verschlüsselungsrunde gleichzeitig angegriffen, sondern oft nur eine Teilmenge.
zh_cn: 首先要考虑的技术是一对密文之间的差异。当使用DCA进行攻击时，并非加密回合中的所有S-box都同时受到攻击，而通常只是其中一部分。

# Tutorial3IntroductionSlide3Content3
source: The S-boxes where the difference 0 goes in, also the difference 0 comes out. Consequently, by considering the ciphertext difference some pairs are already excluded if the difference at the corresponding places is different from 0.
de: Die S-Boxen, an denen die Differenz 0 hineingeht, kommt auch die Differenz 0 heraus. Folglich durch Betrachtung der Geheimtext-Differenz einige Paare schon ausgeschlossen werden, wenn die Differenz an den entsprechenden Stellen von 0 verschieden ist.
zh_cn: 差异为0的S盒，也出现差异0。因此，如果对应位置的差异不同于0，则通过考虑密文差异，已经排除了一些对。

# Tutorial3IntroductionSlide3Header
source: Filtering
de: Filterung
zh_cn: 筛选

# Tutorial3IntroductionSlide4Content1
source: Secondly, the last (expected) difference of the differential can be considered.
de: Als zweites kann die letzte (erwartete) Differenz des Differenzials betrachtet werden.
zh_cn: 其次，可以考虑差分的最后（预期）差异。

# Tutorial3IntroductionSlide4Content2
source: This value is known and the output value of the S-box can be determined by looking at the difference distribution table of the S-box. In general, several different values are possible here. These values can also be used when considering the difference of the ciphertext.
de: Dieser Wert ist bekannt und durch Betrachtung der Differenzenverteilungstabelle der S-Box kann auch der Ausgabewert der S-Box ermittelt werden. Im allgemeinen sind hier mehrere verschiedene Werte möglich. Diese Werte können ebenfalls bei der Betrachtung der Differenz der Geheimtexte verwendet werden.
zh_cn: 该值是已知的，并且可以通过查看S-box的差异分布表来确定S-box的输出值。通常，这里可能有几个不同的值。当考虑密文的差异时，也可以使用这些值。

# Tutorial3IntroductionSlide4Content3
source: If the ciphertext difference at the position of the S-box does not correspond to one of the different output values of the S-box, this pair can also be identified as the wrong pair.
de: Entspricht die Geheimtext-Differenz an der Stelle der S-Box nicht einem der verschiedenen Ausgangswerte der S-Box, kann dieses Paar ebenfalls als falsches Paar indentifiziert werden.
zh_cn: 如果S-box位置处的密文差异不对应于S-box的不同输出值之一，则也可以将此对识别为错误的对。

# Tutorial3IntroductionSlide4Header
source: Filtering
de: Filterung
zh_cn: 筛选

# Tutorial3NeededPairsHeader
source: 3. Number of necessary pairs
de: 3. Anzahl der notwendigen Paare
zh_cn: 3.必要的对数

# Tutorial3NeededPairsSlide1Content1
source: The necessary number of pairs depends essentially on certain factors. These are the probability of the differential found, the number of key bits attacked by the differential, and the filtering technique.
de: Die notwendige Anzahl an Paaren ist im wesentlichen von bestimmten Faktoren abhängig. Diese sind die Wahrscheinlichkeit des gefundenen Differenzials, die Anzahl der angegriffenen Schlüsselbits durch das Differenzial und die Filterungstechnik.
zh_cn: 对的必要数量基本上取决于某些因素。这些是找到差异的概率，差异所攻击的密钥位数以及过滤技术。

# Tutorial3NeededPairsSlide1Content2
source: It describes the ratio of the number of pairs following the differential to the average frequency of the wrong subkeys.
de: Es beschreibt das Verhältnis der Anzahl von Paaren, die dem Differenzial folgen zu der durchschnittlichen Häufigkeit der falschen Teilschlüssel.
zh_cn: 它描述了跟随差分的对数与错误子键的平均频率的比率。

# Tutorial3NeededPairsSlide1Content2Run1
source: A common formula for determining the necessary pairs N
de: Eine gängige Formel zur bestimmung der notwendigen Paare N
zh_cn: 确定必要对的通用公式N

# Tutorial3NeededPairsSlide1Content2Run3
source: is
de: ist
zh_cn: 是

# Tutorial3NeededPairsSlide1Content3
source: where c is a small constant and DP is the probability of the difference.
de: wobei c eine kleine Konstante und DP die Wahrscheinlichkeit des Differenzials ist.
zh_cn: 其中c是一个小常数，DP是相差的概率。

# Tutorial3NeededPairsSlide1Content4
source: An example value for c is 10.
de: Ein beispielhafter Wert für c ist beispielsweise 10.
zh_cn: c的示例值为10。

# Tutorial3NeededPairsSlide1Header
source: Number of necessary pairs
de: Anzahl der notwendigen Paare
zh_cn: 必要对数

# Tutorial3SignalToNoiseHeader
source: 4. Signal-to-noise ratio
de: 4. Rauschverhältnis
zh_cn: 4.信噪比

# Tutorial3SignalToNoiseSlide1Content1
source: A tool for assessing the chances of success is the so-called signal-to-noise ratio.
de: Ein Werkzeug zur Beurteilung der Erfolgsaussichten, ist das so genannte Rauschverhältnis.
zh_cn: 评估成功机会的工具是所谓的信噪比。

# Tutorial3SignalToNoiseSlide1Content3
source: To determine the signal-to-noise ratio, average values to be determined experimentally are sometimes necessary, such as the percentage of pairs that are removed by the filterng or the average number of subkey candidates that a pair proposes.
de: Zur Bestimmung des Rauschverhältnis sind zum Teil experimentell zu bestimmtende Durchschnittswerte notwendig, wie beispielsweise der Anteil der Paare, die durch die Filterng entfernt werden oder die Durchschnittliche Anzahl der Teilschlüsselkandidaten, die ein Paar vorschlägt.
zh_cn: 为了确定信噪比，有时需要通过实验确定平均值，例如被过滤去除的对的百分比或对建议的子关键字候选的平均数量。

# Tutorial3SignalToNoiseSlide1Content4
source: The online help of the DCA PathFinder component contains further literature information on the DCA procedure.
de: In der Online-Hilfe der DKA-PfadFinder-Komponente sind weitere Literatur-Angaben zu dem DKA-Verfahren hinterlegt.
zh_cn: DCA PathFinder组件的联机帮助包含有关DCA过程的更多文献信息。

# Tutorial3SignalToNoiseSlide1Header
source: Signal-to-noise ratio
de: Rauschverhältnis
zh_cn: 信噪比

# Tutorial3TitleHeaderRun1
source: Tutorial
zh_cn: 讲解

# Tutorial3TitleHeaderRun2
source: Differential cryptanalysis of symmetric block ciphers
de: Differenzielle Kryptoanalyse symmetrischer Blockchiffren
zh_cn: 对称分组密码的差分密码分析

# Tutorial3WaitingSlideContent1
source: You can now use the attack configuration generated in the DCA PathFinder component in the DCA KeyRecovery component to restore key bits. To do this, click the "Start" button.
de: Sie können nun in der DKA-KeyRecovery-Komponente die in der DKA-PfadFinder-Komponente generierte Angriffskonfiguration verwenden, um Schlüsselbits wiederherzustellen. Dazu müssen Sie auf den Button "Start" klicken.
zh_cn: 现在，您可以使用DCA KeyRecovery组件中DCA PathFinder组件中生成的攻击配置来还原密钥位。为此，请单击“开始”按钮。

# Tutorial3WaitingSlideContent2
source: Optionally, you can display the determined differential and its characteristics in the DCA PathVisualizer component.
de: Optional können Sie sich in der DKA-PfadVisualiserer-Komponente das ermittelte Differenzial und die darin enthaltenen Charakteristiken anzeigen lassen.
zh_cn: （可选）您可以在DCA PathVisualizer组件中显示确定的微分及其特性。

# Tutorial3WaitingSlideContent3Run1
source: Summary of the analysis results:
de: Zusammenfassung der Analyse-Ergebnisse:
zh_cn: 分析结果摘要：

# Tutorial3WaitingSlideContent3Run2
source: Input difference:
de: Eingabedifferenz:
zh_cn: 输入差异：

# Tutorial3WaitingSlideContent3Run3
source: Expected difference:
de: Erwartete Differenz:
zh_cn: 预期差异：

# Tutorial3WaitingSlideContent3Run4
source: Probability:
de: Wahrscheinlichkeit:
zh_cn: 可能性：

# Tutorial3WaitingSlideHeader
source: Differential cryptanalysis is continued in the following components
de: Differenzielle Kryptoanalyse wird in den nachfolgenden Komponenten weitergeführt
zh_cn: 以下部分继续进行差分密码分析

# UseOfflinePaths
source: Precalculated data
de: Vorberechnete Daten
zh_cn: 预先计算的数据

# UseOfflinePathsToolTip
source: If this setting is selected, no search for characteristics, but are used for the respective box number uses precalculated data that is stored in the component. are. This allows long calculation times to be minimized.
de: Ist diese Einstellung angewählt, wird keine Suche nach Charakteristiken durchgeführt, sondern es werden für die jeweilige Chiffre vorberechnete Daten verwendet, die in der Komponente hinterlegt sind. Dadurch können lange Berechnungszeiten minimiert werden.
zh_cn: 如果选择此设置，则不搜索特征，而是将其用于相应的包装箱编号，这些零件使用存储在组件中的预先计算的数据。是。这样可以使较长的计算时间最小化。
