Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DCAPathFinder/Properties/Resources.*.resx
Languages: de, zh_cn

# Tutorial2AttackKeyRound3Content1Run5
source: The more key bits that are selected, the more complicated the search for a differential. However, it can make sense to attack several S-boxes at the same time. Depending on the nature of the cipher, better or worse differentials can be found.
de: Je mehr Schlüsselbits ausgewählt werden, desto komplizierter ist die Suche nach einem Differenzial. Allerdings kann durchaus sinnvoll sein, mehrere S-Boxen gleichzeitig anzugreifen. Je nach Beschaffenheit der Chiffre finden sich so bessere oder schlechtere Differenziale.
zh_cn: 选择的关键位越多，寻找差值的难度就越大。但是，同时攻击多个S-box可能很有意义。根据密码的性质，可以发现更好或更差的差异。

# Tutorial2AttackRound2HeaderRun1
source: Select S-boxes from round 2 to get key bits from k
de: S-Boxen aus Runde 2 auswählen, um Schlüsselbits von k
zh_cn: 从第2轮中选择S盒，从k中获取关键位

# Tutorial2AttackRound3HeaderRun1
source: Select S-boxes from round 3 to get key bits from k
de: S-Boxen aus Runde 3 auswählen, um Schlüsselbits von k
zh_cn: 从第3轮中选择S盒，从k中获取关键位

# Tutorial2CharacteristicHeader
source: 4. Characteristics
de: 4. Charakteristiken
zh_cn: 4.特征

# Tutorial2CharacteristicSlide1Content1Run1
source: Two entries that differ by a difference
de: Zwei Eingaben, die sich durch eine Differenz
zh_cn: 两个条目存在差异

# Tutorial2CharacteristicSlide1Content1Run2
source: are substituted using the S-box by a pair of outputs differing by a difference
de: unterscheiden, werden unter Verwendung der S-Box durch ein Paar von Ausgaben substitutiert, welche sich durch eine Differenz
zh_cn: 使用S-box替换为一对差异有所不同的输出

# Tutorial2CharacteristicSlide1Content1Run3
source: . This is noted by
de: unterscheiden. Notiert wird dies durch
zh_cn: 。这是由

# Tutorial2CharacteristicSlide1Content2
source: Characteristics can be combined with each other and thus connected over several rounds. The prerequisite for this is that the output difference of the preceding characteristic has the same value as the input difference of the following characteristic. Assuming that characteristics are independent of each other, the probabilities can be multiplied. In this way, a path of differences through the cipher can be searched.
de: Charakteristiken können miteinander kombiniert und so über mehrere Runden verbunden werden. Vorraussetzung dafür ist, dass die Ausgangsdifferenz der vorgänger Charakteristik denselben Wert wie die Eingangsdifferenz der nachfolgenden Charakteristik aufweist. Unter der Annahme, dass Charakteristiken unabhängig voneinander sind, können die Wahrscheinlichkeiten multipliziert werden. Auf diese Weise kann ein Weg von Differenzen durch die Chiffre gesucht werden.
zh_cn: 特性可以相互组合，因此可以进行多轮连接。前提条件是，前一个特性的输出差具有与后一个特性的输入差相同的值。假设特征彼此独立，则概率可以相乘。这样，可以搜索通过密码的差异路径。

# Tutorial2CharacteristicSlide1Content2Run1
source: We call such a pair
de: Wir bezeichnen ein solches Paar
zh_cn: 我们称这样的一对

# Tutorial2CharacteristicSlide1Content2Run2
source: a differential characteristic under the operation of the S-box. As seen before, a differential characteristic has a fixed probability.
de: als differenzielle charakteristik unter der Operation der S-Box. Wie zuvor gesehen, hat eine differenzielle Charakteristik eine feste Wahrscheinlichkeit.
zh_cn: 在S-box操作下的微分特性。如前所述，微分特性具有固定的概率。

# Tutorial2CharacteristicSlide1Content3
source: The goal of the search is to find a path that has the highest possible probability. These paths can be displayed graphically in the DCA PathVisualizer component.
de: Ziel bei der Suche ist es einen Weg zu finden, der eine möglichst hohe Wahrscheinlichkeit aufweist. Diese Wege können in der DKA-PfadVisualisierer-Komponente graphisch dargestellt werden.
zh_cn: 搜索的目的是找到一种可能性最高的方法。这些路径可以在DKA路径可视化器组件中以图形方式显示。

# Tutorial2CharacteristicSlide1Header
source: Characteristics
de: Charakteristiken
zh_cn: 特点

# Tutorial2CharacteristicSlide2Content1
source: An encryption round for cipher 2 consists of key addition, substitution and permutation. The cipher works on 16 bit blocks. The previous notation is extended as follows to denote a differential characteristic of an S-box for 16 bit blocks
de: Eine Verschlüsselungsrunde besteht bei Chiffre 2 aus Schlüsseladdition, Substitution und Permutation. Die Chiffre arbeitet auf 16 bit Blöcken. Die vorige Notation wird wie folgt erweitert, um eine differenzielle Charakteristik einer S-Box für 16 bit Blöcke zu bezeichnen
zh_cn: 密码2的加密回合包括密钥添加，替换和置换。密码适用于16位块。前面的符号扩展如下，以表示16位块的S盒的差分特性

# Tutorial2CharacteristicSlide2Content2
source: After substitution, the bits in cipher 2 are permuted. The permutation of the cipher is known and therefore the differential characteristic of the permutation can be described as follows
de: Nach der Substitution werden die Bits in Chiffre 2 permutiert. Die Permutation der Chiffre ist bekannt und daher kann die differenzielle Charakteristik der Permutation wie folgt bezeichnet werden
zh_cn: 替换后，对密码2中的位进行置换。密码的排列是已知的，因此排列的微分特性可以描述如下

# Tutorial2CharacteristicSlide2Content3
source: In summary, a differential characteristic of an encryption round as a combination of substitution and permutation is noted as follows
de: Zusammenfassend wird eine differenzielle Charakteristik einer Verschlüsselungsrunde als Komination von Substitution und Permutation wie folgt notiert
zh_cn: 总而言之，加密轮回的替代特征和置换特征的区别特征如下所示

# Tutorial2CharacteristicSlide2Header
source: Characteristics
de: Charakteristiken
zh_cn: 特点

# Tutorial2CharacteristicSlide3Content1
source: The differential characteristics of individual rounds are now to be combined into a path of differences through the entire cipher. The search for paths with high probability is a complex and time-consuming problem for ciphers with many encryption rounds and big blocks.
de: Die differenziellen Charakteristiken einzelner Runde sollen jetzt zu einem Weg von Differenzen durch die gesamte Chiffre kombiniert werden. Die Suche nach Pfaden mit hoher Wahrscheinlichkeit ist ein aufwändiges und zeitaufwändiges Problem bei Chiffren mit vielen Verschlüsselungsrunden und langen Blöcken.
zh_cn: 现在，将各个回合的差异特征组合成贯穿整个密码的差异路径。对于具有许多加密回合和大块密码的密码，高概率搜索路径是一个复杂且耗时的问题。

# Tutorial2CharacteristicSlide3Content2
source: The DCA PathFinder component has various search options for determining such paths.
de: Die DKA-PfadFinder-Komponente verfügt über verschiedene Suchoptionen zur Bestimmung von solchen Pfaden.
zh_cn: DCA PathFinder组件具有用于确定此类路径的各种搜索选项。

# Tutorial2CharacteristicSlide3Content3
source: The previously introduced notation is used to denote differential characteristics of a round to differential characteristics for n-encryption rounds (here: 3):
de: Die zuvor eingeführte Notation wird verwendet, um differenzielle Charakteristiken einer Runde zu differenziellen Charakteristiken für n-Verschlüsselungsrunden (hier: 3) zu bezeichnen:
zh_cn: 前面介绍的符号用于表示n次加密回合（此处为3）的回合的差分特征：

# Tutorial2CharacteristicSlide3Content4
source: In the first 4-tuple the input differences of the S-boxes of the first 4 S-boxes are given in the first encryption round. In the second 4-tuple, both the output difference of the first and the input difference of the second encryption round are noted. In the 3rd 4-tuple, the output difference of the second and the input difference of the last encryption round are noted.
de: Im ersten 4-Tupel sind die Eingangsdifferenzen der SBoxen der ersten 4 S-Boxen in der ersten Verschlüsselungsrunde angegeben. Im 2. 4-Tupel ist sowohl die Ausgangsdifferenz der ersten als auch die Eingangsdifferenz der zweiten Verschlüsselungsrunde notiert. Im 3. 4-Tupel ist die Ausgangsdifferenz der zweiten und die Eingangsdifferenz der letzten Verschlüsselungsrunde notiert.
zh_cn: 在第一个4元组中，在第一个加密回合中给出前4个S-box的S-box的输入差异。在第二个四元组中，第一个加密回合的输出差和第二个加密回合的输入差均被记录。在第三个四元组中，记下第二个加密输出的输出差和最后一个加密回合的输入差。

# Tutorial2CharacteristicSlide3Content5
source: The aim of the search is to find a way with the highest possible probability.
de: Ziel bei der Suche ist es, einen Weg zu finden, der eine möglichst hohe Wahrscheinlichkeit aufweist.
zh_cn: 搜索的目的是找到一种可能性最高的方法。

# Tutorial2CharacteristicSlide3Header
source: Characteristics
de: Charakteristiken
zh_cn: 特点

# Tutorial2DifferentialHeader
source: 5. Differentials
de: 5. Differenziale
zh_cn: 5.差异

# Tutorial2DifferentialSlide1Content1
source: When searching for characteristics over n rounds, it can happen that different characteristics are found that have the same input difference of the first and output difference of the last encryption round. The characteristics therefore have the form
de: Bei der Suche nach Charakteristiken über n Runden kann es vorkommen, dass dass verschiedene Charakteristiken gefunden werden, die die selbe Eingangsdifferenz der ersten und Ausgangsdifferenz der letzten Verschlüsselungsrunde haben. Die Charakteristiken haben also die Form
zh_cn: 在n个回合中搜索特征时，可能会出现不同特征，这些特征具有第一个加密回合的第一个输入差异和最后一个加密回合的输出差异相同。因此，特征具有形式

# Tutorial2DifferentialSlide1Content2
source: The input and output values of the difference are decisive for the use of characteristics for differential cryptanalysis. If several characteristics with the same input and output values are found, the probabilities can be added together. A structure consisting of several characteristics is called a differential.
de: Entscheidend bei der Verwendung von Charakteristiken für die differenzielle Kryptoanalyse sind Eingangs- und Ausgangswert der Differenz. Findet man mehrere Charakteristiken mit selben Eingangs- und Ausgangswert, können die Wahrscheinlichkeiten addiert werden. Eine Struktur, die aus mehreren Charakteristiken besteht, wird Differenzial genannt.
zh_cn: 差异的输入和输出值对于使用特征进行差分密码分析至关重要。如果找到具有相同输入和输出值的多个特征，则可以将这些概率相加。由几个特性组成的结构称为微分。

# Tutorial2DifferentialSlide1Content3
source: The goal in the analysis of a cipher is therefore to find the differential with the highest probability.
de: Ziel bei der Analyse einer Chiffre ist es also, das Differenzial mit der höchsten Wahrscheinlichkeit zu finden.
zh_cn: 因此，密码分析的目的是找到概率最高的微分。

# Tutorial2DifferentialSlide1Header
source: Differentials
de: Differenziale
zh_cn: 微分

# Tutorial2IntroductionHeader
source: 1. Introduction
de: 1. Einführung
zh_cn: 1.简介

# Tutorial2IntroductionSlide1Content1
source: In Tutorial 1 the idea of differential cryptanalysis was introduced and demonstrated with a cipher consisting of one encryption round with two round keys.
de: In Tutorial 1 wurde die Idee der differenziellen Kryptoanalyse vorgestellt und an einer Chiffre bestehend aus einer Verschlüsselungsrunde mit zwei Rundenschlüsseln demonstriert.
zh_cn: 在教程1中，介绍了差分密码分析的思想，并用一种密码进行了演示，该密码由一轮加密和两轮密钥组成。

# Tutorial2IntroductionSlide1Content2
source: In this tutorial the idea is deepened and shown at a cipher with three encryption rounds with four round keys.
de: In diesem Tutorial wird die Idee vertieft und an einer Chiffre mit drei Verschlüsselungsrunden mit vier Rundenschlüsseln gezeigt.
zh_cn: 在本教程中，将通过三个带有四轮密钥的加密轮来加深和展示该思想。

# Tutorial2IntroductionSlide1Content3
source: To attack a cipher with multiple encryption rounds and round keys by differential cryptanalysis, it must be examined more closely. Of interest are the individual components of the encryption rounds and how they behave.
de: Um eine Chiffre mit mehreren Verschlüsselgsrunden und Rundenschlüsseln mittels differenzieller Kryptoanalyse anzugreifen, muss diese genauer untersucht werden. Von Interesse sind die einzelnen Bestandteile der Verschlüsselungsrunden und wie diese sich verhalten.
zh_cn: 要通过差分密码分析对具有多个加密回合和回合密钥的密码进行攻击，必须对其进行更仔细的检查。有趣的是加密回合的各个组成部分以及它们的行为方式。

# Tutorial2IntroductionSlide1Content4
source: Due to the multiple encryption rounds, this cipher cannot be attacked like cipher 1. For cipher 2, an approach is needed that predicts the changes of differences over several encryption rounds with a certain probability.
de: Aufgrund der mehrfachen Verschlüsselungsrunden kann diese Chiffre nicht wie Chiffre 1 angegriffen werden. Für Chiffre 2 wird ein Ansatz benötigt, der die Änderungen von Differenzen über mehrere Verschlüsselungsrunden mit einer gewissen Wahrscheinlichkeit vorraussagt.
zh_cn: 由于进行了多次加密，因此无法像密码1一样攻击该密码。对于密码2，需要一种以一定概率预测多个加密回合中差异变化的方法。

# Tutorial2IntroductionSlide1Header
source: Introduction
de: Einführung
zh_cn: 介绍

# Tutorial2RecoverKeyInformationHeader
source: 6. Recover key information
de: 6. Schlüsselinformationen wiederherstellen
zh_cn: 6.恢复关键信息

# Tutorial2RecoverKeyInformationSlide1Content1
source: Once a differential has been found with a high probability, key bits can be recovered. For this purpose, the S-boxes are considered where the expected difference is different from 0.
de: Sobald ein Differenzial mit hoher Wahrscheinlichkeit gefunden wurde, kann damit begonnen werden, Schlüsselbits wiederherzustellen. Dazu werden die S-Boxen betrachtet, an denen die erwartete Differenz von 0 verschieden ist.
zh_cn: 一旦发现差异的可能性很高，就可以恢复密钥位。为此，在期望差异不同于0的情况下考虑S盒。

# Tutorial2RecoverKeyInformationSlide1Content2
source: A counter is generated for each possible key candidate. The cryptoanalyst generates a number of messages that fulfill the input difference. These are encrypted and partially decrypted with the key candidate. If the difference between the partially decrypted messages meets the expected difference, the counter is increased by 1. This process is repeated with all generated message pairs.
de: Für jeden möglichen Schlüsselkandidat wird ein Zähler erzeugt. Der Kryptoanalyst generiert eine Anzahl von Nachrichten, die die Eingabedifferenz erfüllen. Diese werden verschlüsselt und mit dem Schlüsselkandidat partiell entschlüsselt. Erfüllt die Differenz der partiell entschlüsselten Nachrichten die erwartete Differenz, wird der Zähler um 1 erhöht. Diesen Prozess wiederholt man mit allen generierten Nachrichten-Paaren.
zh_cn: 为每个可能的关键候选者生成一个计数器。密码分析器生成许多满足输入差异的消息。使用候选密钥对它们进行加密和部分解密。如果部分解密的消息之间的差异满足预期的差异，则计数器将增加1。此过程将对所有生成的消息对重复进行。

# Tutorial2RecoverKeyInformationSlide1Content3
source: The key candidate with the most hits should have the highest counter. This should be very close to the expected value of the differential.
de: Der Schlüsselkandidat mit den meisten Treffern, sollte den höchsten Zähler haben. Dieser sollte sehr nah am Erwartungswert des Differenzial liegen.
zh_cn: 命中率最高的关键候选人应具有最高的计数器。这应该非常接近差分的期望值。

# Tutorial2RecoverKeyInformationSlide1Header
source: Recover key information
de: Schlüsselinformationen wiederherstellen
zh_cn: 恢复关键信息

# Tutorial2TitleHeaderRun1
source: Tutorial
zh_cn: 讲解

# Tutorial2TitleHeaderRun2
source: Differential cryptanalysis of symmetric block ciphers
de: Differenzielle Kryptoanalyse symmetrischer Blockchiffren
zh_cn: 对称分组密码的差分密码分析

# Tutorial2WaitingSlideContent1
source: You can now use the attack configuration generated in the DCA PathFinder component in the DCA KeyRecovery component to restore key bits. To do this, you must click the button "Start".
de: Sie können nun in der DKA-KeyRecovery-Komponente die in der DKA-PfadFinder-Komponente generierte Angriffskonfiguration verwenden, um Schlüsselbits wiederherzustellen. Dazu müssen Sie auf den Button "Start" klicken.
zh_cn: 现在，您可以使用DCA KeyRecovery组件中DCA PathFinder组件中生成的攻击配置来还原密钥位。为此，必须单击“开始”按钮。

# Tutorial2WaitingSlideContent2
source: Optionally, you can display the determined differential and its characteristics in the DCA PathVisualizer component.
de: Optional können Sie sich in der DKA-PfadVisualiserer-Komponente das ermittelte Differenzial und die darin enthaltenen Charakteristiken anzeigen lassen.
zh_cn: （可选）您可以在DCA PathVisualizer组件中显示确定的微分及其特性。

# Tutorial2WaitingSlideContent3Run1
source: Summary of the analysis results:
de: Zusammenfassung der Analyse-Ergebnisse:
zh_cn: 分析结果摘要：

# Tutorial2WaitingSlideContent3Run2
source: Input difference:
de: Eingabedifferenz:
zh_cn: 输入差异：

# Tutorial2WaitingSlideContent3Run3
source: Expected difference:
de: Erwartete Differenz:
zh_cn: 预期差异：

# Tutorial2WaitingSlideContent3Run4
source: Probability:
de: Wahrscheinlichkeit:
zh_cn: 可能性：

# Tutorial2WaitingSlideHeader
source: Differential cryptanalysis is continued in the following components
de: Differenzielle Kryptoanalyse wird in den nachfolgenden Komponenten weitergeführt
zh_cn: 以下部分继续进行差分密码分析

# Tutorial3AttackFinishedContent1
source: Tutorial 3 on differential cryptanalysis in the DCA PathFinder component is finished.
de: Tutorial 3 zur differenziellen Kryptoanalyse in der DKA-PfadFinder-Komponente ist beendet.
zh_cn: DCA PathFinder组件中有关差分密码分析的教程3已完成。

# Tutorial3AttackFinishedContent2Run1
source: A last click on "Start" in the DCA KeyRecovery component will attempt to recover the last two round keys k
de: Durch ein letztes Klicken auf "Start" in der DKA-KeyRecovery-Komponente werden die letzten zwei Rundenschlüssel k
zh_cn: 最后单击DKA KeyRecovery组件中的“开始”将尝试恢复最后两个回合密钥k

# Tutorial3AttackFinishedContent2Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial3AttackFinishedHeader
source: Tutorial 3 finished
de: Tutorial 3 beendet
zh_cn: 教程3完成

# Tutorial3AttackFirstRoundContent1Run1
source: In the last step, the last two round keys k
de: Im letzten Schritt werden die letzten beiden Rundenschlüssel k
zh_cn: 在最后一步中，最后两个回合键k

# Tutorial3AttackFirstRoundContent1Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial3AttackFirstRoundContent1Run5
source: are attacked. This attack is similar to the procedure described in Tutorial 1.
de: angegriffen. Dieser Angriff läuft analog zu dem Verfahren ab, wie es in Tutorial 1 durchgeführt wurde.
zh_cn: 被攻击。这种攻击类似于教程1中描述的过程。

# Tutorial3AttackFirstRoundContent2Run1
source: By clicking on "Continue" (right arrow below), the first two round keys k
de: Durch einen Klick auf "Weiter" (Rechtspfeil unten) werden die ersten beiden Rundenschlüssel k
zh_cn: 通过点击“继续”（下面的右箭头），前两个圆形键k

# Tutorial3AttackFirstRoundContent2Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial3AttackFirstRoundContent2Run5
source: are attacked.
de: angegriffen.
zh_cn: 被攻击。

# Tutorial3AttackFirstRoundHeaderRun1
source: Calculation of round keys k
de: Berechnung der Rundenschlüssel k
zh_cn: 圆形键k的计算

# Tutorial3AttackFirstRoundHeaderRun3
source: and k
de: und k
zh_cn: 和k

# Tutorial3AttackHeader
source: 5. Differential cryptanalysis of cipher 3
de: 5. Differenzielle Kryptoanalyse von Chiffre 3
zh_cn: 5.密码3的差分密码分析

# Tutorial3AttackKeyRound2Content1Run1
source: At this point, the second round key k
de: An dieser Stelle soll der Rundenschlüssel k
zh_cn: 此时，第二轮密钥k

# Tutorial3AttackKeyRound2Content1Run3
source: is to be attacked. S-boxes can be selected for this in the second encryption round. By selecting an S-box, the respective 4 bits of the round key are attacked and an attempt is made to restore them.
de: angegriffen werden. Dazu können in der zweiten Verschlüsselungsrunde S-Boxen ausgewählt werden. Durch die Auswahl einer S-Box werden die jeweiligen 4 Bits des Rundenschlüssels angegriffen und versucht wiederherzustellen.
zh_cn: 被攻击。可以在第二轮加密中为此选择S盒。通过选择一个S盒，将攻击回合密钥的各个4位，并尝试恢复它们。

# Tutorial3AttackKeyRound2Content1Run4
source: The attack is almost analogous to the attack on the round key k
de: Der Angriff läuft nahezu analog zu dem auf den Rundenschlüssel k
zh_cn: 攻击几乎类似于对回合密钥k的攻击

# Tutorial3AttackKeyRound2Content1Run6
source: . However, when searching for differentials, the cipher no longer has to be searched so deeply, since an encryption round has already been completely attacked.
de: ab. Allerdings muss bei der Suche nach Differenzialen die Chiffre nicht mehr so tief durchsucht werden, da bereits eine Verschlüsselungsrunde vollständig angegriffen wurde.
zh_cn: 。但是，在搜索差异时，不必再对密码进行如此深入的搜索，因为已经完全攻击了加密回合。

# Tutorial3AttackKeyRound3Content1Run1
source: At this point, the third round key k
de: An dieser Stelle soll der Rundenschlüssel k
zh_cn: 此时，第三轮密钥k

# Tutorial3AttackKeyRound3Content1Run3
source: is to be attacked. S-boxes can be selected for this in the third encryption round. By selecting an S-box, the respective 4 bits of the round key are attacked and an attempt is made to restore them.
de: angegriffen werden. Dazu können in der dritten Verschlüsselungsrunde S-Boxen ausgewählt werden. Durch die Auswahl einer S-Box werden die jeweiligen 4 Bits des Rundenschlüssels angegriffen und versucht wiederherzustellen.
zh_cn: 被攻击。可以在第三轮加密中为此选择S盒。通过选择一个S盒，将攻击回合密钥的各个4位，并尝试恢复它们。

# Tutorial3AttackKeyRound3Content1Run4
source: The attack is almost analogous to the attack on the round key k
de: Der Angriff läuft nahezu analog zu dem auf den Rundenschlüssel k
zh_cn: 攻击几乎类似于对回合密钥k的攻击

# Tutorial3AttackKeyRound3Content1Run6
source: . However, when searching for differentials, the cipher no longer has to be searched so deeply, since an encryption round has already been completely attacked.
de: ab. Allerdings muss bei der Suche nach Differenzialen die Chiffre nicht mehr so tief durchsucht werden, da bereits eine Verschlüsselungsrunde vollständig angegriffen wurde.
zh_cn: 。但是，在搜索差异时，不必再对密码进行如此深入的搜索，因为已经完全攻击了加密回合。

# Tutorial3AttackKeyRound4Content1Run1
source: At this point, the fourth round key k
de: An dieser Stelle soll der Rundenschlüssel k
zh_cn: 此时，第四轮密钥k

# Tutorial3AttackKeyRound4Content1Run3
source: is to be attacked. S-boxes can be selected for this in the fourth encryption round. By selecting an S-box, the respective 4 bits of the round key are attacked and an attempt is made to restore them.
de: angegriffen werden. Dazu können in der vierten Verschlüsselungsrunde S-Boxen ausgewählt werden. Durch die Auswahl einer S-Box werden die jeweiligen 4 Bits des Rundenschlüssels angegriffen und versucht wiederherzustellen.
zh_cn: 被攻击。可以在第四轮加密中为此选择S盒。通过选择一个S盒，将攻击回合密钥的各个4位，并尝试恢复它们。

# Tutorial3AttackKeyRound4Content1Run4
source: The attack is almost analogous to the attack on the round key k
de: Der Angriff läuft nahezu analog zu dem auf den Rundenschlüssel k
zh_cn: 攻击几乎类似于对回合密钥k的攻击

# Tutorial3AttackKeyRound4Content1Run6
source: . However, when searching for differentials, the cipher no longer has to be searched so deeply, since an encryption round has already been completely attacked.
de: ab. Allerdings muss bei der Suche nach Differenzialen die Chiffre nicht mehr so tief durchsucht werden, da bereits eine Verschlüsselungsrunde vollständig angegriffen wurde.
zh_cn: 。但是，在搜索差异时，不必再对密码进行如此深入的搜索，因为已经完全攻击了加密回合。

# Tutorial3AttackKeyRound5Content1Run1
source: At this point, the fifth round key k
de: An dieser Stelle soll der Rundenschlüssel k
zh_cn: 此时，第五轮密钥k

# Tutorial3AttackKeyRound5Content1Run3
source: is to be attacked. S-boxes can be selected for this in the fifth encryption round. By selecting an S-box, the respective 4 bits of the round key are attacked and an attempt is made to restore them.
de: der Chiffre angegriffen werden. Dazu können in der fünften Verschlüsselungsrunde S-Boxen ausgewählt werden. Durch die Auswahl einer S-Box werden die jeweiligen 4 Bits des Rundenschlüssels angegriffen und versucht wiederherzustellen.
zh_cn: 被攻击。可以在第五轮加密中为此选择S盒。通过选择一个S盒，将攻击回合密钥的各个4位，并尝试恢复它们。

# Tutorial3AttackKeyRound5Content1Run4
source: In differential cryptanalysis, the change of differences at the S-boxes is considered. S-boxes should therefore be selected at this point.
de: Bei der differenziellen Kryptoanalyse wird die Veränderung von Differenzen an den S-Boxen betrachtet. Daher sind an dieser Stelle S-Boxen auszuwählen.
zh_cn: 在差分密码分析中，考虑了S盒处的差异变化。因此，此时应选择S盒。

# Tutorial3AttackKeyRound5Content1Run5
source: The more key bits that are selected, the more complicated the search for a differential. However, it can make sense to attack several S-boxes at the same time. Depending on the nature of the cipher, better or worse differentials can be found.
de: Je mehr Schlüsselbits ausgewählt werden, desto komplizierter ist die Suche nach einem Differenzial. Allerdings kann durchaus sinnvoll sein, mehrere S-Boxen gleichzeitig anzugreifen. Je nach Beschaffenheit der Chiffre finden sich so bessere oder schlechtere Differenziale.
zh_cn: 选择的关键位越多，寻找差值的难度就越大。但是，同时攻击多个S-box可能很有意义。根据密码的性质，可以发现更好或更差的差异。
