Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DCAPathFinder/Properties/Resources.*.resx
Languages: de, zh_cn

# Tutorial1DifferentialCryptanalysisSlide9Content2Run3
source: . For this we will consider two pairs of plaintext and ciphertext (m
de: zu erhalten. Dazu betrachten wir zwei Klar- und Geheimtext-Paare (m
zh_cn: 。为此，我们将考虑两对明文和密文（m

# Tutorial1DifferentialCryptanalysisSlide9Content2Run7
source: ) and (m
de: ) und (m
zh_cn: ）和（m

# Tutorial1DifferentialCryptanalysisSlide9Content3Run1
source: the values of v
de: die Werte von v
zh_cn: v的值

# Tutorial1DifferentialCryptanalysisSlide9Content3Run3
source: and v
de: und v
zh_cn: 和v

# Tutorial1DifferentialCryptanalysisSlide9Content3Run5
source: can be calculated.
de: berechnen kann.
zh_cn: 可以计算。

# Tutorial1DifferentialCryptanalysisSlide9Content4Run1
source: Because the functionality of the S-Box is public and therefore also invertible, the cryptoanalyst can calculate with
de: Weil die Funktionsweise der S-Box öffentlich und damit auch invertierbar ist, kann der Kryptoanalyst aus
zh_cn: 由于S-Box的功能是公共的，因此也是可逆的，因此密码分析器可以使用

# Tutorial1DifferentialCryptanalysisSlide9Content5Run1
source: the values of
de: die Werte von
zh_cn: 的价值

# Tutorial1DifferentialCryptanalysisSlide9Header
source: Differential cryptanalysis of cipher 1
de: Differenzielle Kryptoanalyse von Chiffre 1
zh_cn: 密码1的差分密码分析

# Tutorial1IntroductionHeader
source: 1. Introduction
de: 1. Einführung
zh_cn: 1.简介

# Tutorial1IntroductionSlide1Content1Run1
source: In this section we consider the basic idea of differential cryptanalysis.
de: In diesem Abschnitt betrachten wir die Grundidee der differenziellen Kryptoanalyse.
zh_cn: 在本节中，我们考虑差分密码分析的基本思想。

# Tutorial1IntroductionSlide1Content1Run2
source: Most modern round-based block ciphers consist of three basic operations: key addition, substitution, and permutation. Cipher 1 consists of key addition and substitution. Ciphers 2 and 3 also contain a permutation.
de: Die meisten modernen rundenbasierten Blockchiffren bestehen aus drei grundlegenden Operationen: Schlüsseladdition, Substitution und Permutation. Chiffre 1 besteht Schlüsseladdition und Substitution. Chiffre 2 und 3 enthalten zusätzlich noch eine Permutation.
zh_cn: 大多数现代的基于回合的分组密码包括三个基本操作：密钥加法，替换和置换。密码1由密钥添加和替换组成。密码2和3也包含一个排列。

# Tutorial1IntroductionSlide1Content2
source: The XOR operation (exclusive OR) is usually used for key addition. The XOR operation is a two-digit operator that can be described by the following value table:
de: Zur Schlüsseladdition wird meist die XOR-Operation (Exklusiv-Oder) verwendet. Die XOR-Operation ist ein zweistelliger-Operator, der durch folgende Wertetabelle beschrieben werden kann:
zh_cn: XOR操作（异或）通常用于密钥添加。 XOR操作是一个两位数运算符，可以通过以下值表来描述：

# Tutorial1IntroductionSlide1DataColHeader1
source: Input bit A
de: Eingabebit A
zh_cn: 输入位A

# Tutorial1IntroductionSlide1DataColHeader2
source: Input bit B
de: Eingabebit B
zh_cn: 输入位B

# Tutorial1IntroductionSlide1DataColHeader3
source: result bit
de: Ergebnisbit
zh_cn: 结果位

# Tutorial1IntroductionSlide1Header
source: Introduction
de: Einführung
zh_cn: 介绍

# Tutorial1IntroductionSlide2Content1
source: If the XOR operation is used to encrypt a message m with key k, the ciphertext c is obtained as follows:
de: Wird die XOR-Operation zur Verschlüsselung einer Nachricht m mit Schlüssel k verwendet, erhält man den Geheimtext c wie folgt:
zh_cn: 如果使用XOR操作对密钥为k的消息m进行加密，则密文c的获取如下：

# Tutorial1IntroductionSlide2Content2
source: The basic idea of differential cryptanalysis is to use the effect of a property of the XOR operation by using the key k twice. If the key addition is performed twice, the following applies:
de: Die Grundidee der differenziellen Kryptoanalyse ist die Nutzung der Auswirkung einer Eigenschaft der XOR-Operation durch zweimalige Verwendung des Schlüssels k. Wird die Schlüsseladdition zwei mal durchgeführt, gilt:
zh_cn: 差分密码分析的基本思想是通过两次使用密钥k来使用XOR操作的属性效果。如果执行两次密钥添加，则适用以下条件：

# Tutorial1IntroductionSlide2Content3Run1
source: We get back the original message m.
de: Wir erhalten wieder die ursprüngliche Nachricht m.
zh_cn: 我们得到原始消息m。

# Tutorial1IntroductionSlide2Content3Run2
source: The XOR operator is often referred to as the difference operator. This name is also used in this tutorial.
de: Der XOR-Operator wird häufig auch als Differenz-Operator bezeichnet. Diese Benennung nutzen wir in diesem Tutorial auch.
zh_cn: XOR运算符通常称为差异运算符。本教程中也使用该名称。

# Tutorial1IntroductionSlide2Content4
source: Differential cryptanalysis is a so-called "chosen plaintext attack", which means that the cryptanalyst can select plaintext messages and encrypt them to have matching plaintext/ciphertext pairs.
de: Die differenzielle Kryptoanalyse ist ein so genannter "Chosen Plaintext-Angriff", das bedeutet der Kryptoanalyst kann Klartext-Nachrichten auswählen und diese verschlüsseln lassen, so dass er passende Klartext-/Geheimtext-Paare hat.
zh_cn: 差分密码分析是所谓的“选择的明文攻击”，这意味着密码分析者可以选择明文消息并将其加密以具有匹配的明文/密文对。

# Tutorial1IntroductionSlide2Header
source: Introduction
de: Einführung
zh_cn: 介绍

# Tutorial1IntroductionSlide3Content1Run1
source: We take advantage of the idea of using the key twice by using pairs of messages m
de: Die Idee des zweimaligen Anwendens des Schlüssels nutzen wir, indem wir Paare von Nachrichten m
zh_cn: 我们利用消息对m来利用两次使用密钥的想法

# Tutorial1IntroductionSlide3Content1Run3
source: and m
de: und m
zh_cn: 和米

# Tutorial1IntroductionSlide3Content1Run5
source: . If the difference between the ciphertexts is now formed, the following holds true:
de: betrachen. Wird nun die Differenz der Geheimtexte gebildet, gilt:
zh_cn: 。如果现在形成了密文之间的差异，则以下内容成立：

# Tutorial1IntroductionSlide3Content2
source: It follows:
de: Daraus folgt:
zh_cn: 它遵循：

# Tutorial1IntroductionSlide3Content3
source: We obtain the difference of the plaintexts by calculating the difference of the ciphertexts. This can be used to obtain information about the round keys at DCA.
de: Wir erhalten die Differenz der Klartexte durch Berechnung der Differenz der Geheimtexte. Das kann ausgenutzt werden, um Informationen über die Rundenschlüssel bei DKA zu erhalten.
zh_cn: 我们通过计算密文的差异来获得明文的差异。这可用于获取有关DCA上的回合密钥的信息。

# Tutorial1IntroductionSlide3Header
source: Introduction
de: Einführung
zh_cn: 介绍

# Tutorial1LastSlideContent1
source: The DCA is now continued in the DCA KeyRecovery component.
de: Die DKA wird nun in der DKA-KeyRecovery-Komponente weitergeführt.
zh_cn: 现在，DCA在DCA KeyRecovery组件中继续。

# Tutorial1LastSlideContent2Run1
source: In the DCA KeyRecovery component, you can now recover the round keys k
de: Sie können nun in der DKA-KeyRecovery-Komponente die Rundenschlüssel k
zh_cn: 在DCA KeyRecovery组件中，您现在可以恢复回合密钥k

# Tutorial1LastSlideContent2Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial1LastSlideContent3Run1
source: To do this, you must click on the
de: Dazu müssen Sie auf den
zh_cn: 为此，您必须点击

# Tutorial1LastSlideContent3Run2
source: Start-Button
zh_cn: 开始按钮

# Tutorial1LastSlideContent3Run3
source: in the DCA KeyRecovery component.
de: in der DKA-KeyRecovery-Komponente klicken.
zh_cn: 在DCA KeyRecovery组件中。

# Tutorial1LastSlideHeader
source: Tutorial 1 finished
de: Tutorial 1 beendet
zh_cn: 教程1完成

# Tutorial1PracticalDifferentialCryptanalysisHeader
source: 3. Performing differential cryptanalysis
de: 3. Durchführung differenziellen Kryptoanalyse
zh_cn: 3.执行差分密码分析

# Tutorial1PracticalDifferentialCryptanalysisSlide1Content1Run1
source: In the DCA against cipher 1, the round keys k
de: Bei der DKA gegen Chiffre 1 werden die letzten beiden (vom Ende her betrachtet) Rundenschlüssel k
zh_cn: 在针对密码1的DCA中，圆形密钥k

# Tutorial1PracticalDifferentialCryptanalysisSlide1Content1Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial1PracticalDifferentialCryptanalysisSlide1Content1Run5
source: will be attacked. The attack proceeds as described in this tutorial.
de: angegriffen. Der Angriff verläuft wie in diesem Tutorial vorgestellt.
zh_cn: 将受到攻击。攻击按照本教程中的描述进行。

# Tutorial1PracticalDifferentialCryptanalysisSlide1Content2
source: Click on "Next" (right arrow below) to start the attack. The control is passed on to the DCA KeyRecovery component.
de: Durch einen Klick auf "Weiter" (Rechtspfeil unten) wird der Angriff gestartet. Dazu wird die Kontrolle an die DKA-KeyRecovery-Komponente weitergegeben.
zh_cn: 单击“下一步”（下面的右箭头）开始攻击。该控件将传递到DCA KeyRecovery组件。

# Tutorial1PracticalDifferentialCryptanalysisSlide1Header
source: Performing differential cryptanalysis
de: Durchführung differenziellen Kryptoanalyse
zh_cn: 执行差分密码分析

# Tutorial1TitleHeaderRun1
source: Tutorial
zh_cn: 讲解

# Tutorial1TitleHeaderRun2
source: Differential cryptanalysis of symmetric block ciphers
de: Differenzielle Kryptoanalyse symmetrischer Blockchiffren
zh_cn: 对称分组密码的差分密码分析

# Tutorial2AnalysisHeader
source: 2. Analysis of cipher 2
de: 2. Analyse von Chiffre 2
zh_cn: 2.密码分析2

# Tutorial2AnalysisOfSBoxHeader
source: 3. Analysis of the S-boxes
de: 3. Analyse der S-Boxen
zh_cn: 3. S盒分析

# Tutorial2AnalysisOfSBoxSlide1Content1
source: Due to the key addition, the S-box behaves non-linear. A guess attempt for k3 cannot be checked directly.
de: Aufgrund der Schlüsseladdition verhält sich die S-Box nicht-linear. Ein Rateversuch für K3 kann nicht direkt überprüft werden.
zh_cn: 由于增加了按键，因此S-box的行为是非线性的。无法直接检查k3的猜测尝试。

# Tutorial2AnalysisOfSBoxSlide1Content2
source: All S-boxes of cipher 2 behave identically. For this reason it is sufficient to analyze the functionality of a single S-box. Basically it is possible to consider 4 parallel S-boxes as one big S-box, but this would increase the analysis effort. The S-box receives 4 bits as input and also outputs 4 bits as output. The 4 input bits are replaced by 4 other output bits.
de: Alle S-Boxen von Chiffre 2 verhalten sind identisch. Aus diesem Grund ist es aussreichend, wenn die Funktionsweise einer einzelnen SBox analysiert wird. Grundsätzlich ist es möglich, 4 parallele SBoxen als eine große SBox zu betrachten, dies würde aber den Analyseaufwand erhöhen. Die SBox erhält als Eingabe 4 Bits und gibt auch 4 Bits als Ausgabe aus. Die 4 Eingabe-Bits werden durch 4 andere Ausgabe-Bits ersetzt.
zh_cn: 密码2的所有S盒的行为都相同。因此，分析单个S-box的功能就足够了。基本上可以将4个并行S盒视为一个大S盒，但这会增加分析工作量。 S-box接收4位作为输入，也输出4位作为输出。 4个输入位被其他4个输出位代替。

# Tutorial2AnalysisOfSBoxSlide1Content3
source: Remember: Differential cryptanalysis works with differences of messages. In order to examine the S-box, all combinations of input plaintext are considered and their differences are formed. For each pair, the plaintexts are entered individually into the S-box and then the difference of the substituted outputs is calculated. The transitions from input to output difference are noted.
de: Zur Erinnerung: Bei der differenziellen Kryptoanalyse wird mit Differenzen von Nachrichten gearbeitet. Um die S-Box zu untersuchen, werden alle Kombinationen von Eingabe-Klartexten betrachtet und deren Differenz gebildet. Je Paar werden die Klartexte einzelnt in die S-Box gegeben und anschließend die Differenz der substituierte Ausgaben berechnet. Dabei werden die Übergänge von Eingabe- zu Ausgabe-Differenz notiert.
zh_cn: 切记：差分密码分析适用于不同的消息。为了检查S-box，考虑了输入明文的所有组合并形成了它们的差异。对于每对，将纯文本分别输入到S-box中，然后计算替代输出的差。记录了从输入到输出差异的过渡。

# Tutorial2AnalysisOfSBoxSlide1Content4
source: The table on the next page visualizes this procedure. There is one line for each possible input difference. There is one column for each possible output difference. The number of occurrences of a particular difference is described by the entries in the table.
de: Die Tabelle auf der nächsten Seite visualisiert dieses Vorgehen. Für jede mögliche Eingabe-Differenz existiert eine Zeile. Für jede mögliche Ausgabe-Differenz gibt es eine Spalte. Die Anzahl des Auftretens einer speziellen Differenz wird durch die Einträge der Tabelle beschrieben.
zh_cn: 下一页的表将可视化此过程。每个可能的输入差异只有一行。每个可能的输出差异都有一列。特定差异的出现次数由表格中的条目描述。

# Tutorial2AnalysisOfSBoxSlide1Content5
source: To calculate the probability of a difference occurring, the number must be divided by 16.
de: Um die Wahrscheinlichkeit des Auftretens einer Differenz zu Berechnen, muss die Anzahl durch 16 geteilt werden.
zh_cn: 要计算出现差异的可能性，必须将该数字除以16。

# Tutorial2AnalysisOfSBoxSlide1Header
source: Analysis of the S-boxes
de: Analyse der S-Boxen
zh_cn: S盒分析

# Tutorial2AnalysisOfSBoxSlide2Content1
source: The difference distribution table is shown below:
de: Im Folgenden ist die Differenz-Verteilungstabelle zu sehen:
zh_cn: 差异分布表如下所示：

# Tutorial2AnalysisOfSBoxSlide2Header
source: Analysis of the S-boxes
de: Analyse der S-Boxen
zh_cn: S盒分析

# Tutorial2AnalysisOfSBoxSlide2InputDifference
source: Input difference
de: Eingabe-Differenz
zh_cn: 输入差异

# Tutorial2AnalysisOfSBoxSlide2OutputDifference
source: Output difference
de: Ausgabe-Differenz
zh_cn: 输出差异

# Tutorial2AnalysisOfSBoxSlide3Content1
source: The input and output differences and the entries of the difference distribution table are displayed in hexadecimal format.
de: Die Ein- und Ausgabe-Differenzen sowie die Einträge der Differenzverteilungs-Tabelle sind hexadezimal.
zh_cn: 输入和输出差异以及差异分布表的条目以十六进制格式显示。

# Tutorial2AnalysisOfSBoxSlide3Content2
source: A 4 bit S-box has 16 different inputs and 16 different outputs. If 2 messages are combined to a message pair with disjoint differences, 256 different transitions of differences can be observed.
de: Bei einer 4 bit S-Box gibt es je 16 verschiedene Eingaben und Ausgaben. Kombiniert man 2 Nachrichten zu einem Nachrichten-Paar mit je disjunkten Differenzen, können 256 verschiedene Übergänge von Differenzen beobachtet werden.
zh_cn: 一个4位的S-box具有16个不同的输入和16个不同的输出。如果将2条消息组合为具有不相交差异的消息对，则可以观察到256个不同的差异过渡。

# Tutorial2AnalysisOfSBoxSlide3Content3
source: An important observation is that there are differences that occur more frequently than others. There are also differences that do not occur at all. For example, the input difference 8 is mapped to the output difference D 8 times.
de: Eine wichtige Beobachtung ist, dass es Differenzen gibt, die häufiger vorkommen als andere. Es gibt auch Differenzen, die gar nicht auftreten. Zum Beispiel wird die Eingabe-Differenz 8 insgesamt 8 mal auf die Ausgabe-Differenz D abgebildet.
zh_cn: 一个重要的发现是，差异比其他差异更频繁地发生。也有根本没有发生的差异。例如，将输入差8映射到输出差D 8倍。

# Tutorial2AnalysisOfSBoxSlide3Content4
source: The distribution of differences is obviously not equally distributed. In practice, S-boxes are not perfect. The cryptanalyst makes use of this fact. Particularly high probabilities help with differential cryptanalysis.
de: Die Verteilung der Differenzen ist offensichtlich nicht gleichverteilt. In der Praxis sind S-Boxen nicht perfekt. Diesen Fakt macht sich der Kryptoanalyst zu nutze. Besonders hohe Wahrscheinlichkeiten helfen bei der differenziellen Kryptoanalyse.
zh_cn: 差异的分布显然不是均匀分布的。实际上，S盒不是完美的。密码分析者利用了这一事实。特别高的概率有助于差分密码分析。

# Tutorial2AnalysisOfSBoxSlide3Header
source: Analysis of the S-boxes
de: Analyse der S-Boxen
zh_cn: S盒分析

# Tutorial2AnalysisSlide1Content1
source: Cipher 2 consists of three encryption rounds with four round keys. Each round consists of key addition, substitution and permutation. In the last round an additional key addition is performed.
de: Chiffre 2 besteht aus drei Verschlüsselungsrunden mit vier Rundenschlüsseln. Jede Runde besteht aus Schlüsseladdition, Substitution und einer Permutation. In der letzten Runde wird zusätzlich noch eine weitere Schlüsseladdition durchgeführt.
zh_cn: 密码2由三个加密回合和四个回合密钥组成。每个回合都包括键的添加，替换和排列。在最后一轮中，执行了附加的密钥添加。

# Tutorial2AnalysisSlide1Content2
source: In the following, the encryption of a plain text block is shown schematically. As in Tutorial 1, the internal states during the encryption process are described with variables u and v. The following table shows the encryption of a plaintext block.
de: Im Folgenden wird die Verschlüsselung eines Klartextblocks schematisch dargestellt. Analog zu Tutorial 1 werden die internen Zustände während des Verschlüsselungsprozesses mit Variablen u und v bezeichnet.
zh_cn: 在下文中，示意性地示出了纯文本块的加密。与教程1相同，使用变量u和v描述加密过程中的内部状态。下表显示了纯文本块的加密。

# Tutorial2AnalysisSlide1Content3
source: In addition, a permutation P() is used in this cipher. This permutation exchanges the bit positions of a block. In addition to the internal states u and v, w is introduced. This state w represents the value after a permutation.
de: In dieser Chiffre wird zusätzlich eine Permutation P() verwendet. Diese vertauscht die Bitpositionen eines Blocks. Zusätzlich zu den internen Zuständen u und v wird w eingeführt. Dieser Zustand w repräsentiert den Wert nach einer Permutation.
zh_cn: 另外，在该密码中使用了置换P（）。该置换交换块的位位置。除了内部状态u和v，还引入了w。该状态w表示置换后的值。

# Tutorial2AnalysisSlide1Header
source: Analysis of cipher 2
de: Analyse von Chiffre 2
zh_cn: 密码分析2

# Tutorial2AnalysisSlide2Header
source: Analysis of cipher 2
de: Analyse von Chiffre 2
zh_cn: 密码分析2

# Tutorial2AnalysisSlide3Content1Run1
source: You could now try to get the key k
de: Man könnte nun versuchen, den Schlüssel k
zh_cn: 您现在可以尝试获取密钥k

# Tutorial2AnalysisSlide3Content1Run11
source: . With the plaintexts you are still able to calculate the difference of the u
de: berechnen. Mit den Klartexten ist man noch in der Lage, die Differenz der u
zh_cn: 。使用明文，您仍然能够计算出u的差

# Tutorial2AnalysisSlide3Content1Run3
source: in a similar way to cipher 1. To do so, you would use a pair of plaintext and their corresponding ciphertexts. Then you would guess a possible round key t to calculate the internal variables v
de: in ähnlicher Art und Weise wie bei Chiffre 1 anzugreifen. Dazu hätte man ein Paar von Klartexten und ihre entsprechenden Geheimtexte vorliegen. Dann würde man einen möglichen Rundenschlüssel t raten und die jeweiligen internen Variablen v
zh_cn: 以与密码1类似的方式。为此，您将使用一对明文及其对应的密文。然后，您可能会猜测一个可能的回合密钥t来计算内部变量v

# Tutorial2AnalysisSlide3Content1Run5
source: . This would allow u
de: berechnen. Dadurch könnte man u
zh_cn: 。这会让你

# Tutorial2AnalysisSlide3Content1Run7
source: to be calculated. Since the round key k
de: berechnen. Da der Rundenschlüssel k
zh_cn: 待计算。自圆键k

# Tutorial2AnalysisSlide3Content1Run9
source: is also unknown, you could now calculate the difference of u
de: ebenfalls unbekannt ist, könnte man nun die Differenz der u
zh_cn: 也未知，您现在可以计算出u的差

# Tutorial2AnalysisSlide3Content2Run1
source: Due to the Exclusive-Or, the S-box behaves non-linear, so that the difference of the v
de: Aufgrund des Exclusive-Oder verhält sich die S-Box nicht-linear, sodass man die Differenz der v
zh_cn: 由于“异或”，S盒的行为是非线性的，因此v的差

# Tutorial2AnalysisSlide3Content2Run3
source: cannot be determined. Therefore, it is not possible to check a guess attempt of k
de: nicht bestimmen kann. Daher ist es nicht möglich einen Rateversuch von k
zh_cn: 无法确定。因此，不可能检查k的猜测尝试。

# Tutorial2AnalysisSlide3Content2Run5
source: by using differences.
de: durch Nutzung von Differenzen zu prüfen.
zh_cn: 通过使用差异。

# Tutorial2AnalysisSlide3Content3
source: To solve this problem, lets take a closer look at how the S-boxes work.
de: Um dieses Problem zu lösen, betrachten wir die Funktionsweise der S-Boxen genauer.
zh_cn: 为了解决这个问题，让我们仔细研究一下S盒的工作方式。

# Tutorial2AnalysisSlide3Header
source: Analysis of cipher 2
de: Analyse von Chiffre 2
zh_cn: 密码分析2

# Tutorial2AttackFinishedContent1
source: Tutorial 2 on differential cryptanalysis in the DCA PathFinder component is finished.
de: Tutorial 2 zur differenziellen Kryptoanalyse in der DKA-PfadFinder-Komponente ist beendet.
zh_cn: DCA PathFinder组件中有关差分密码分析的教程2已完成。

# Tutorial2AttackFinishedContent2Run1
source: A last click on "Start" in the DCA KeyRecovery component attempts to recover the last two round keys k
de: Durch ein letztes Klicken auf "Start" in der DKA-KeyRecovery-Komponente werden die letzten zwei Rundenschlüssel k
zh_cn: 最后单击DCA KeyRecovery组件中的“开始”，尝试恢复最后两个回合密钥k

# Tutorial2AttackFinishedContent2Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial2AttackFinishedHeader
source: Tutorial 2 finished
de: Tutorial 2 beendet
zh_cn: 教程2完成

# Tutorial2AttackFirstRoundContent1Run1
source: In the last step, the last two round keys k
de: Im letzten Schritt werden die letzten beiden Rundenschlüssel k
zh_cn: 在最后一步中，最后两个回合键k

# Tutorial2AttackFirstRoundContent1Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial2AttackFirstRoundContent1Run5
source: are attacked. This attack is similar to the procedure described in Tutorial 1
de: angegriffen. Dieser Angriff läuft analog zu dem Verfahren ab, wie es in Tutorial 1 durchgeführt wurde.
zh_cn: 被攻击。这种攻击类似于教程1中描述的过程。

# Tutorial2AttackFirstRoundContent2Run1
source: By clicking on "Continue" (right arrow below), the first two round keys k
de: Durch einen Klick auf "Weiter" (Rechtspfeil unten) werden die ersten beiden Rundenschlüssel k
zh_cn: 通过点击“继续”（下面的右箭头），前两个圆形键k

# Tutorial2AttackFirstRoundContent2Run3
source: and k
de: und k
zh_cn: 和k

# Tutorial2AttackFirstRoundContent2Run5
source: are attacked.
de: angegriffen.
zh_cn: 被攻击。

# Tutorial2AttackFirstRoundHeaderRun1
source: Calculation of round keys k
de: Berechnung der Rundenschlüssel k
zh_cn: 圆形键k的计算

# Tutorial2AttackFirstRoundHeaderRun3
source: and k
de: und k
zh_cn: 和k

# Tutorial2AttackHeader
source: 7. Differential cryptanalysis of cipher 2
de: 7. Differenzielle Kryptoanalyse von Chiffre 2
zh_cn: 7.密码2的差分密码分析

# Tutorial2AttackKeyRound2Content1Run1
source: At this point, the second round key k
de: An dieser Stelle soll der Rundenschlüssel k
zh_cn: 此时，第二轮密钥k

# Tutorial2AttackKeyRound2Content1Run3
source: is to be attacked. S-boxes can be selected for this in the second encryption round. By selecting an S-box, the respective 4 bits of the round key are attacked and an attempt is made to restore them.
de: angegriffen werden. Dazu können in der zweiten Verschlüsselungsrunde S-Boxen ausgewählt werden. Durch die Auswahl einer S-Box werden die jeweiligen 4 Bits des Rundenschlüssels angegriffen und versucht wiederherzustellen.
zh_cn: 被攻击。可以在第二轮加密中为此选择S盒。通过选择一个S盒，将攻击回合密钥的各个4位，并尝试恢复它们。

# Tutorial2AttackKeyRound2Content1Run4
source: The attack is almost analogous to the attack on the round key k
de: Der Angriff läuft nahezu analog zu dem auf den Rundenschlüssel k
zh_cn: 攻击几乎类似于对回合密钥k的攻击

# Tutorial2AttackKeyRound2Content1Run6
source: . However, when searching for differentials, the cipher does not have to be searched so deeply any more, since an encryption round has already been completely attacked.
de: ab. Allerdings muss bei der Suche nach Differenzialen die Chiffre nicht mehr so tief durchsucht werden, da bereits eine Verschlüsselungsrunde vollständig angegriffen wurde.
zh_cn: 。但是，在搜索差异时，不必再对密码进行如此深入的搜索，因为已经完全攻击了加密回合。

# Tutorial2AttackKeyRound3Content1Run1
source: At this point, the first round key k
de: An dieser Stelle soll der Rundenschlüssel k
zh_cn: 此时，第一个回合密钥k

# Tutorial2AttackKeyRound3Content1Run3
source: of the cipher will be attacked. S-boxes can be selected for this in the third encryption round. By selecting an S-box the respective 4 bits of the round key are attacked and an attempt is made to restore them.
de: der Chiffre angegriffen werden. Dazu können in der dritten Verschlüsselungsrunde S-Boxen ausgewählt werden. Durch die Auswahl einer S-Box werden die jeweiligen 4 Bits des Rundenschlüssels angegriffen und versucht wiederherzustellen.
zh_cn: 的密码将被攻击。可以在第三轮加密中为此选择S盒。通过选择一个S盒，将攻击回合密钥的各个4位，并尝试恢复它们。

# Tutorial2AttackKeyRound3Content1Run4
source: In differential cryptanalysis, the change of differences at the S-boxes is considered. S-boxes should therefore be selected at this point.
de: Bei der differenziellen Kryptoanalyse wird die Veränderung von Differenzen an den S-Boxen betrachtet. Daher sind an dieser Stelle S-Boxen auszuwählen.
zh_cn: 在差分密码分析中，考虑了S盒处的差异变化。因此，此时应选择S盒。
