Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/VisualEncoder/Properties/Resources.*.resx
Languages: de

# AppendICVCaption
source: Append Checksum
de: Prüfsumme anhängen

# AppendICVTooltip
source: The Component will automatically append a checksum.
de: Die Komponente berechnet automatisch eine Prüfsumme und hängt sie an.

# BarcodeSection
source: properties of barcode
de: Eigenschaften des Barcodes

# C128_ICV_DISC
source: The ICV is calculated from a weighted sum (modulo 103) of all the characters.
de: Die Prüfziffer berechnet sich aus einer gewichteten Summe (Modulo 103) aller Buchstaben.

# C128_ICV_LABLE
source: Integrity Check Value
de: Integritäts-Prüfziffer

# C128_STARTEND_DISC
source: There are three distinct start patterns that determine in which way the code was encoded. However, the end pattern is always the same.
de: Es gibt drei unterschiedliche Codierungsarten. Das Startmuster gib an welche benutzt wurde. Das Endmuster ist immer gleich.

# C128_STARTEND_LABLE
source: Start and End Pattern
de: Start- und Endemuster

# C38_ICV_DISC
source: The ICV is calculated from a weighted sum (modulo 43) of all the characters.
de: Die Prüfziffer berechnet sich aus einer gewichteten Summe (Modulo 43) aller Buchstaben.

# C38_ICV_LABLE
source: Integrity Check Value
de: Integritäts-Prüfziffer

# C38_STARTEND_DISC
source: The Start and End Symbol is a '*'. With the aid of the symbol, the code can be read reliably, even if it is read backwards.
de: Das Start- und Endesymbol ist ein '*'. Mit Hilfe dieses Symboles, kann der Code auch zuverlässig gelesen werden, wenn er falsch herum liegt.

# C38_STARTEND_LABLE
source: Start and End Symbol
de: Start- und Endesymbol

# PluginCaption
source: Visual Encoder
de: Visueller Codierer

# PluginTooltip
source: Encodes various types of one and two dimensional codes
de: Erzeugt verschiedene ein- und zweidimensionale visuelle Codes

# DimCodeLabel
source: Visual code
de: Visueller Code

# DM_ALIG_DISC
source: The alignment pattern is static. It enables to read the code at every alignment.
de: Mit Hilfe dieses Musters kann der Code – unabhängig von seiner Ausrichtung – zuverlässig auslesen werden.

# DM_ALIG_LABLE
source: Alignment Detection
de: Ausrichtungs-Erkennung

# DM_COLUMNID_DISC
source: This pattern helps the reader to easily find the different data column in the code.
de: Dieses Muster hilft dem Reader die verschiedenen Datenspalten zu finden.

# DM_COLUMNID_LABLE
source: Column Identificator
de: Spalten-Identifizierer

# EAN13_FIXED_DISC
source: The fixed Bars are mainly orientations points for the reader. They are necessary, because the encoding changes at these points.
de: Die Balken sind Orientierungs-Punkte für den Reader. Der Reader muss sehen, wenn er in der Mitte des Codes angelangt ist, da sich die Codierung ab dieser Stelle ändert.

# EAN13_FIXED_LABLE
source: Fixed Reference Point
de: Feste Bezugspunkte

# EAN13_ICV_DISC
source: The checksum is calculated taking a varying weight value times the value of each number in the barcode to make a sum (modulo 10).
de: Die Prüfsumme wird mittels einer unterschiedlich gewichteten Summe der Ziffern im Code (Modulo 10) berechnet.

# EAN13_ICV_LABLE
source: Integrity Check Value
de: Integritäts-Prüfziffer

# EAN8_FIXED_DISC
source: The fixed Bars are mainly orientations points for the reader. They are necessary, because the encoding changes at these points.
de: Die Balken sind Orientierungs-Punkte für den Reader. Der Reader muss sehen, wenn er in der Mitte des Codes angelangt ist, da sich die Codierung ab dieser Stelle ändert.

# EAN8_FIXED_LABLE
source: Fixed Reference Point
de: Feste Bezugspunkte

# EAN8_ICV_DISC
source: The checksum is calculated taking a varying weight value times the value of each number in the barcode to make a sum (modulo 10).
de: Die Prüfsumme wird mittels einer unterschiedlich gewichteten Summe der Ziffern im Code (Modulo 10) berechnet.

# EAN8_ICV_LABLE
source: Integrity Check Value
de: Integritäts-Prüfziffer

# EncodingTypeCaption
source: Type of Barcode
de: Art des visuellen Codes

# EncodingTypeTooltip
source: Choose a Barcodetype
de: Wählen Sie einen Barcode

# ExplainLabel
source: Explanation
de: Erklärung

# InputStreamCaption
source: Input Data
de: Eingabe-Daten

# InputStreamTooltip
source: The data you want to encode as a barcode.
de: Daten, die als Barcode codierte werden sollen.

# PictureBytesCaption
source: Picture output
de: Bild-Ausgabe

# PictureBytesTooltip
source: Your Barcode as a picture.
de: Barcode als Bild

# QR_ALIG_DISC
source: The alignment pattern is static. It enables to read the code at every alignment.
de: Mit Hilfe dieses Musters kann der Code -- unabhängig von seiner Ausrichtung -- zuverlässig auslesen werden.

# QR_ALIG_LABLE
source: Alignment Detection
de: Ausrichtungs-Erkennung

# CODE39_INVALIDE_INPUT
source: Invalide Input
de: Ungültige Eingabe

# PDF417_ROWID_DISC
source: This pattern helps the reader to easily find the different data rows in the code.
de: Dieses Muster hilft dem Reader die verschiedenen Datenzeilen zu finden.

# PDF417_ROWID_LABLE
source: Row Identificator
de: Zeilen Identifizierer

# PDF417_SEPAT_DISC
source: With the aid of the pattern, the code can be read reliably, even if it is read upside down or backwards.
de: Mit Hilfe dieses Musters kann der Code -- unabhängig von seiner Ausrichtung -- zuverlässig auslesen werden.

# PDF417_SEPAT_LABLE
source: Start and End Pattern
de: Start- und Endemuster

# QR_FORMAT_DISC
source: Here among others, the Error Correction Level is determined. This indicates what percentage of the code (7% - 30%) can be recovered in case of damage.
de: Hier wird unter anderem festgelegt, welches Error Correction Level benutzt wird. Dieses gibt an, wie viel Prozent des Codes (7% - 30%) beschädigt oder verdeckt sein dürfen, um den Inhalt noch eindeutig lesen zu können.

# QR_FORMAT_LABLE
source: Format Informations
de: Format-Informationen

# QR_VERSION_DISC
source: The version specifies one of 40 pre- defined sizes for the QR code.
de: Die Version gibt eine von 40 vor- definierten Größen für den QR-Code an.

# QR_VERSION_LABLE
source: Version Informations
de: Versions-Informationen

# QR_NORMAL_DISC
source: In this area, the data is shown redundant, so that it can be read reliably even if pieces of code are covered or damaged.
de: In diesem Bereich werden die Daten redundant dargestellt, so dass auch zuverlässig ausgelesen werden kann, wenn Teile des Codes verdeckt sind.

# QR_NORMAL_LABLE
source: Data
de: Daten

# EAN_INVALIDE_INPUT
source: The input contains invalid characters. Only Digits are allowed.
de: Die Eingabe enthält ungültige Zeichen. Nur Ziffern sind zulässig.
