Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/AnalysisMonoalphabeticSubstitution/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AdvancedSettingsGroup
source: Advanced settings
de: Erweiterte Einstellungen
ru: Расширенные настройки
zh_cn: 高级设置

# AlphabetCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# AlphabetGroup
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# AlphabetTooltip
source: Complete used alphabet
de: Auswahl der zu benutzenden Sprache
ru: Полный использованный алфавит
zh_cn: 完整使用的字母

# CaseSensitiveCaption
source: Case sensitive
de: Beachtung von Groß-/Kleinschreibung
ru: Деликатный случай
zh_cn: 区分大小写

# CaseSensitiveTooltip
source: Distinguish between small and capital letters.
de: Groß- und Kleinschreibung wird unterschieden.
ru: Различают маленькие и заглавные буквы.
zh_cn: 区分大小写字母。

# ChooseAlphabetCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# ChooseAlphabetTooltip
source: Choose language
de: Auswahl der Sprache
ru: Выберите язык
zh_cn: 选择语言

# CTAlphabetCaption
source: Ciphertext language
de: Geheimtextsprache
ru: Язык зашифрованного текста
zh_cn: 密文语言

# CTAlphabetGroup
source: Ciphertext language
de: Geheimtextsprache
ru: Язык зашифрованного текста
zh_cn: 密文语言

# CTAlphabetTooltip
source: Complete used ciphertext language
de: Auswahl der Sprache des Geheimtextes.
ru: Полный использованный язык зашифрованного текста
zh_cn: 完整使用的密文语言

# CTChooseAlphabetCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# CTChooseAlphabetTooltip
source: Choose ciphertext language
de: Auswahl der Geheimtextsprache
ru: Выберите язык зашифрованного текста
zh_cn: 选择密文语言

# PluginCaption
source: Monoalphabetic Substitution Analyzer
de: Monoalphabetische Substitutionsanalyse
ru: Моноалфавитный анализатор замещения
zh_cn: 单字母替代分析仪

# PluginTooltip
source: Cryptanalyzes monoalphabetic substitution ciphers
de: Kryptoanalyse der monoalphabetischen Substitution
ru: Криптоанализ моноалфавитных замещающих шифров
zh_cn: 密码分析单字母替换密码

# PTAlphabetCaption
source: Plaintext language
de: Klartext-Sprache
ru: Язык простого текста
zh_cn: 明文语言

# PTAlphabetGroup
source: Plaintext language
de: Klartext-Sprache
ru: Язык простого текста
zh_cn: 明文语言

# PTAlphabetTooltip
source: Complete used plaintext language
de: Vollständig genutzt Klartext-Sprache
ru: Полный используемый язык открытого текста
zh_cn: 完整使用的纯文本语言

# PTChooseAlphabetCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# PTChooseAlphabetTooltip
source: Choose plaintext language
de: Wähle Klartext-Sprache
ru: Выберите язык открытого текста
zh_cn: 选择纯文本语言

# SeparateAlphabetsCaption
source: Separate plaintext/ciphertext language
de: Separiere Klartext/Geheimtextsprache
ru: Отдельный язык открытого текста / зашифрованного текста
zh_cn: 单独的纯文本/密文语言

# SeparateAlphabetsTooltip
source: Use distinct languages for plaintext and ciphertext
ru: Использовать разные языки для открытого текста и зашифрованного текста
zh_cn: 对明文和密文使用不同的语言

# CTCaseSensitiveCaption
source: Case sensitive
de: Groß-/Kleinschreibung
ru: Деликатный случай
zh_cn: 区分大小写

# CTCaseSensitiveTooltip
source: Distinguish between small and capital letters.
de: Beachte Groß-/Kleinschreibung
ru: Различают маленькие и заглавные буквы.
zh_cn: 区分大小写字母。

# PTCaseSensitiveCaption
source: Case sensitive
ru: Деликатный случай
zh_cn: 区分大小写

# PTCaseSensitiveTooltip
source: Distinguish between small and capital letters.
de: Unterscheide zwischen Klein- und Großbuchstaben
ru: Различают маленькие и заглавные буквы.
zh_cn: 区分大小写字母。

# CiphertextAlphabetCaption
source: Ciphertext alphabet
de: Geheimtext-Alphabet
ru: Зашифрованный алфавит
zh_cn: 密文字母

# CiphertextAlphabetTooltip
source: Alphabet of the ciphertext
de: Das Alphabet des Geheimtextes
ru: Алфавит зашифрованного текста
zh_cn: 密文字母

# CiphertextCaption
source: Ciphertext
de: Geheimtext
ru: зашифрованный
zh_cn: 密文

# CiphertextTooltip
source: Encrypted text
de: Verschlüsselter Text
ru: Зашифрованный текст
zh_cn: 加密文字

# LanguagedictionaryCaption
source: Dictionary
de: Wörterbuch
ru: Словарь
zh_cn: 字典

# LanguagedictionaryTooltip
source: Dictionary of assumed plaintext language
de: Wörterbuch der angenommenen Klartext-Sprache
ru: Словарь предполагаемого открытого текста
zh_cn: 假定的明文语言字典

# PlaintextAlphabetCaption
source: Plaintext alphabet
de: Klartext-Alphabet
ru: Обычный алфавит
zh_cn: 明文字母

# PlaintextAlphabetOutputCaption
source: Plaintext alphabet
de: Klartext-Alphabet
ru: Обычный алфавит
zh_cn: 明文字母

# PlaintextAlphabetOutputTooltip
source: Plaintext alphabet with letters in the order to decrypt the ciphertext
de: Klartext-Alphabet des entschlüsselten Geheimtextes.
ru: Обычный алфавит с буквами для расшифровки зашифрованного текста
zh_cn: 带有字母的明文字母以解密密文

# PlaintextAlphabetTooltip
source: Assumed alphabet of the plaintext
de: Angenommene Sprache des Klartextes
ru: Предполагаемый алфавит открытого текста
zh_cn: 假定为明文字母

# PlaintextCaption
source: Plaintext
de: Klartext
ru: Простой текст
zh_cn: 纯文本

# PlaintextTooltip
source: Decrypted text
de: Entschlüsselter Geheimtext
ru: Расшифрованный текст
zh_cn: 解密文字

# ReferencetextCaption
source: Reference text
de: Referenztext
ru: Справочный текст
zh_cn: 参考文字

# ReferencetextTooltip
source: Sample text to extract letter frequencies of the assumed plaintext language
de: Beispieltext zur Extraktion der Buchstabenhäufigkeiten
ru: Пример текста для извлечения частот букв предполагаемого языка открытого текста
zh_cn: 示例文本以提取假定的纯文本语言的字母频率

# TreatmentInvalidCharsCaption
source: Invalid Characters
de: Unbekannte Zeichen
ru: Недопустимые символы
zh_cn: 无效字符

# TreatmentInvalidCharsTooltip
source: Treatment of invalid characters.
de: Behandlung von Zeichen, die nicht im Alphabet vorkommen.
ru: Обработка недопустимых символов.
zh_cn: 处理无效字符。

# UseDefaultWordSeparatorCaption
source: Default word separator
ru: Разделитель слов по умолчанию
zh_cn: 默认单词分隔符

# UseDefaultWordSeparatorTooltip
source: Use default word separator (blank) for dictionary attack or set manually a separator
ru: Используйте разделитель слов по умолчанию (пустой) для атаки словаря или вручную установите разделитель
zh_cn: 使用默认的单词分隔符（空白）进行字典攻击或手动设置分隔符

# ChooseInvalidCharsList1
source: Ignore
de: Auslassen
ru: игнорировать
zh_cn: 忽视

# ChooseInvalidCharsList2
source: Delete
de: Löschen
ru: Удалить
zh_cn: 删除

# ChooseInvalidCharsList3
source: Replace with ?
de: Ersetzen durch ?
ru: Заменить ?
zh_cn: 用。。。来代替 ？

# ElapsedLabel
source: Elapsed:
de: Vergangen:
ru: Прошедшее:
zh_cn: 过去：

# EndLabel
source: End:
de: Ende:
ru: Конец:
zh_cn: 结束：

# KeyHeader
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# LocalLabel
source: Local
de: Lokal
ru: Местный
zh_cn: 本地

# StartLabel
source: Start:
ru: Начало:
zh_cn: 开始：

# TextHeader
source: Text
ru: Текст
zh_cn: 文本

# TopTenLabel
source: Top Ten
de: Top Zehn
ru: Топ десять
zh_cn: 前十

# ValueHeader
source: Value
de: Wert
ru: Стоимость
zh_cn: 值

# dic_attack_finished
source: Dictionary attack finished in {0:00} hours, {1:00} minutes, {2:00} seconds.
de: Der Wörterbuchangriff wurde beendet in {0:00} Stunden, {1:00} Minuten, {2:00} Sekunden.
ru: Атака словаря закончилась в {0:00} часов, {1:00} минут, {2:00} секунд.
zh_cn: 字典攻击在{0:00}小时{1:00}分钟{2:00}秒内完成。

# error_alphabet_length
source: The ciphertext alphabet contains more letters than the plaintext alphabet. ciphertext alphabet: "{0}" ({1} letters) plaintext alphabet: "{2}" ({3} letters) Using plaintext alphabet now also as ciphertext alphabet.
de: Das Geheimtext-Alphabet enthält mehr Buchstaben als das Klartext-Alphabet. Geheimtext-Alphabet: "{0}" ({1} Buchstaben) Klartext-Alphabet: "{2}" ({3} Buchstaben) Benutze Klartext-Alphabet nun auch als Geheimtext-Alphabet.
ru: Алфавит зашифрованного текста содержит больше букв, чем алфавит plaintext. Зашифрованный алфавит: «{0}» ({1} буквы) Псевдосимвольный алфавит: «{2}» ({3} буквы) Используйте открытый текст в качестве зашифрованного текста.
zh_cn: 密文字母比明文字母包含更多的字母。密文字母：“ {0}”（{1}个字母）明文字母：“ {2}”（{3}个字母）现在也使用明文字母作为密文字母。

# error_ciphertext
source: Error while obtaining ciphertext.
de: Es ist ein Fehler beim Abruf des Geheimtextes aufgetreten.
ru: Ошибка при получении зашифрованного текста.
zh_cn: 获取密文时出错。

# error_dictionary
source: Error while obtaining English language dictionary file
de: Es ist ein Fehler beim Aufruf des Wörterbuchs aufgetreten.
ru: Ошибка при получении файла словаря на английском языке
zh_cn: 获取英语词典文件时出错

# gen_attack_finished
source: Genetic attack finished in {0:00} hours, {1:00} minutes, {2:00} seconds.
de: Der genetische Angriff wurde beendet in {0:00} Stunden, {1:00} Minuten, {2:00} Sekunden.
ru: Генетическая атака закончилась в {0:00} часов, {1:00} минут, {2:00} секунд.
zh_cn: 基因攻击在{0:00}小时{1:00}分钟{2:00}秒内完成。

# gen_attack_testedkeys
source: Number of tested keys with genetic attack: {0}
de: Anzahl der getesteten Schlüssel durch den genetischen Angriff: {0}
ru: Количество проверенных ключей с генетической атакой: {0}
zh_cn: 经过遗传攻击的已测试密钥数：{0}

# no_ciphertext
source: No ciphertext is set.
de: Es ist kein Geheimtext vorhanden.
ru: Нет зашифрованного текста.
zh_cn: 没有设置密文。

# no_ciphertext_alphabet
source: No ciphertext alphabet is set.
de: Es ist kein Geheimtext-Alphabet verfügbar.
ru: Нет кодировки с зашифрованным текстом.
zh_cn: 没有设置密文字母。

# no_dictionary
source: No language dictionary is set.
de: Es ist kein Wörterbuch verfügbar.
ru: Языковой словарь не установлен.
zh_cn: 未设置语言词典。

# no_lang_freq
source: No language frequencies are available.
de: Es sind keine Buchstabenhäufigkeiten verfügbar.
ru: Нет языковых частот.
zh_cn: 没有可用的语言频率。

# no_ngram_file
source: No ngram file is available.
de: Es sind keine Buchstabenhäufigkeiten verfügbar.
ru: Нет файла ngram.
zh_cn: 没有可用的ngram文件。

# no_plaintext_alphabet
source: No plaintext alphabet is set.
de: Es ist kein Klartext-Alphabet verfügbar.
ru: Не установлен обычный текстовый алфавит.
zh_cn: 没有设置明文字母。

# no_reference_text
source: No reference text is available.
de: Es ist kein Referenztext verfügbar.
ru: Нет ссылочного текста.
zh_cn: 没有参考文字。

# AttackHeader
source: Attack
de: Angriff
ru: Атака
zh_cn: 攻击

# GenAttackDisplay
source: G
ru: г

# Copy_all
source: Copy all lines
de: Kopiere alle Zeilen
ru: Скопировать все строки
zh_cn: 复制所有行

source: Copy key
de: Kopiere Schlüssel
ru: Копировать ключ
zh_cn: 复制键

# Copy_line
source: Copy selected line
de: Kopiere ganze Zeile
ru: Копировать выбранную строку
zh_cn: 复制所选行

source: Copy text
de: Kopiere Text
ru: Копировать текст
zh_cn: 复制文字

source: Copy value
de: Kopiere Wert
ru: Копировать значение
zh_cn: 复制值

# HillAttackDisplay
source: H
ru: ЧАС

# hill_attack_finished
source: Hill climbing attack finished in {0:00} hours, {1:00} minutes, {2:00} seconds.
de: Der Hill climbing-Angriff wurde beendet in {0:00} Stunden, {1:00} Minuten, {2:00} Sekunden.
ru: Атака на кульминацию завершена в {0:00} часов, {1:00} минут, {2:00} секунд.
zh_cn: 爬山攻击在{0:00}小时{1:00}分钟{2:00}秒内完成。

# hill_attack_testedkeys
source: Number of tested keys with hill climbing attack: {0}
de: Anzahl der getesteten Schlüssel durch den Hill climbing-Angriff: {0}
ru: Количество проверенных ключей с атакой на холм: {0}
zh_cn: 经过爬山攻击的测试密钥数：{0}

# hill_attack_keyspersecond
source: Tested keys with hill climbing per second: {0}
de: Durch Hill climbing getestete Schlüssel pro Sekunde: {0}
ru: Протестированные ключи с холмированием в секунду: {0}
zh_cn: 经过测试的密钥（每秒爬坡）：{0}

# ChooseAlgorithmCaption
source: Algorithm
de: Algorithmen
ru: Алгоритм
zh_cn: 算法

# ChooseAlgorithmList2
source: Dictionary & Genetic
de: Wörterbuch & Genetisch
ru: Словарь и генетика
zh_cn: 字典与遗传

# ChooseAlgorithmTooltip
source: Choose the algorithm which should be used.
de: Algorithmus, mit dem die Entschlüsselung durchgeführt werden soll.
ru: Выберите алгоритм, который следует использовать.
zh_cn: 选择应使用的算法。

# RestartsCaption
source: Restarts
de: Wiederholungen
ru: Перезапуск
zh_cn: 重新启动

# RestartsTooltip
source: Choose how often the hill climbing algorithm should start over.
de: Wie oft soll der Hill climbing-Algorithmus wiederholt werden?
ru: Выбирайте, как часто должен начинаться алгоритм горизонтального скручивания.
zh_cn: 选择爬山算法重新开始的频率。

# SelectAlgorithmGroup
source: Attack type
de: Art des Angriffs
ru: Тип атаки
zh_cn: 攻击类型

# no_cuda
source: No CUDA-enabled device or CUDA driver found.
de: Keine CUDA-fähige Grafikkarte oder fehlender Treiber.
ru: Не найдено ни одного устройства с поддержкой CUDA или драйверов CUDA.
zh_cn: 找不到启用CUDA的设备或CUDA驱动程序。

# KeysPerSecLabel
source: Keys / sec:
de: Schlüssel / sec:
ru: Ключи / сек:
zh_cn: 键/秒：

# TotalKeysLabel
source: Tested keys:
de: Getestete Schlüssel:
ru: Протестированные ключи:
zh_cn: 经过测试的按键：

# UseSpacesCaption
source: Use spaces
de: Verwende Leerzeichen
ru: Использовать пробелы
zh_cn: 使用空间

# UseSpacesTooltip
source: Use language statistics that include the space character
de: Verwende Sprachstatistik, die Leerzeichen berücksichtigt
ru: Использовать статистику языка, которая включает символ пробела
zh_cn: 使用包含空格字符的语言统计信息

# KeyOutputCaption
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# KeyOutputTooltip
source: Output of the recovered key
de: Ausgabe des ermittelten Schlüssels
ru: Выход восстановленного ключа
zh_cn: 已恢复密钥的输出

source: Bigrams
de: Bigramme
ru: Биграммы
zh_cn: 比格勒姆斯

# GramsTypeCaption
source: Type of n-grams
de: Art der n-Gramme
ru: Тип грамма
zh_cn: 克类型

# GramsTypeTooltip
source: Defines the n-gram size, which should be used in the cost function during the cryptanalysis.
de: Definiert die n-Gramm-Größe, die während der Kryptoanalyse in der Kostenfunktion verwendet werden soll.
ru: Определяет размер n-граммов, который будет использоваться в функции стоимости во время криптоанализа.
zh_cn: 定义在密码分析过程中要在成本函数中使用的n-gram大小。

source: Pentagrams
de: Pentagramme
ru: Пентаграммы
zh_cn: 五角星

source: Tetragrams
de: Tetragramme
ru: Тетраграммы
zh_cn: 四卦

source: Trigrams
de: Trigramme
ru: Триграммы
zh_cn: 卦

source: Unigrams
de: Unigramme
ru: Униграммы
zh_cn: 字母组合

# ChooseAlgorithmList1
source: Hill climbing
zh_cn: 爬山

# DicAttackDisplay
source: D
de: W
