Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/CostFunction/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# InputTextCaption
source: Text Input
de: Eingabetext
ru: Ввод текста
zh_cn: 文字输入

# InputTextTooltip
source: Enter your text here.
de: Eingabetext
ru: Введите текст здесь.
zh_cn: 在此处输入您的文字。

# OutputTextCaption
source: Text Output
de: Ausgabetext
ru: Текстовый вывод
zh_cn: 文字输出

# OutputTextTooltip
source: Your text will be sent here.
de: Ausgabetext
ru: Ваш текст будет отправлен здесь.
zh_cn: 您的文字将发送到这里。

# ValueCaption
source: Value
de: Funktionswert
ru: Стоимость
zh_cn: 值

# ValueTooltip
source: The value of the function will be sent here
de: Ausgabe des Wertes der Kostenfunktion
ru: Значение функции будет отправлено здесь
zh_cn: 该函数的值将在此处发送

# ControlSlaveCaption
source: SDES Slave
de: SDES-Sklave
zh_cn: SDES从站

# ControlSlaveTooltip
source: Direct access to SDES.
de: Direkter Zugriff auf das SDES-Plugin
ru: Прямой доступ к SDES.
zh_cn: 直接访问SDES。

# BytesToUseCaption
source: Bytes to use
de: verwendete Bytes
ru: Байты для использования
zh_cn: 要使用的字节

# BytesToUseTooltip
source: Which amount of bytes should be used for calculating?
de: Wie viele Bytes sollen für die Berechnung verwendet werden?
ru: Какое количество байтов должно использоваться для расчета?
zh_cn: 应该使用哪个字节数量进行计算？

# CaseInsensitivCaption
source: Case insensitive
de: Groß-/Kleinschreibung
ru: Без учета регистра
zh_cn: 不区分大小写

# CaseInsensitivTooltip
source: If checked, the regular expression will be used in a case-insensitive manner.
de: Wenn dieses Kontrollkästchen gesetzt ist, ignorieren die regulären Ausdrücke die Groß-/Kleinschreibung.
ru: Если флажок установлен, регулярное выражение будет использоваться без учета регистра.
zh_cn: 如果选中，则将以不区分大小写的方式使用正则表达式。

# FunctionTypeCaption
source: Function type
de: Funktionstyp
ru: Тип функции
zh_cn: 功能类型

# FunctionTypeTooltip
source: Select the type of function
de: Wählen Sie den Funktionstyp.
ru: Выберите тип функции
zh_cn: 选择功能类型

# RegExCaption
source: Regular Expression
de: Regulärer Ausdruck
ru: Регулярное выражение
zh_cn: 正则表达式

# RegExTooltip
source: Regular Expression match as text string
de: Treffer der regulären Ausdrücke als Zeichenfolge
ru: Регулярное выражение соответствует текстовой строке
zh_cn: 正则表达式匹配为文本字符串

# RegExHexCaption
source: Regular Expression (Hex)
de: Regulärer Ausdruck (Hexadezimal)
ru: Регулярное выражение (Hex)
zh_cn: 正则表达式（十六进制）

# RegExHexTooltip
source: Regular Expression match encoded in hex
de: Treffer der regulären Ausdrücke in hexadezimaler Form
ru: Соответствие регулярного выражения, закодированное в шестнадцатеричном формате
zh_cn: 正则表达式匹配以十六进制编码

# StatisticsCorpusCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# StatisticsCorpusTooltip
source: Select one of the predefined languages, or choose a custom text file that contains a typical text in a language of your choice.
de: Wählen Sie eine der vorgegebenen Sprachen, oder geben Sie eine Textdatei an, die einen typischen Text in einer Sprache Ihrer Wahl enthält.
ru: Выберите один из предопределенных языков или выберите пользовательский текстовый файл, который содержит типичный текст на выбранном вами языке.
zh_cn: 选择一种预定义的语言，或选择一个包含您选择的语言的典型文本的自定义文本文件。

# entropyCaption
source: Select an entropy function
de: Entropie-Funktion
ru: Выберите функцию энтропии
zh_cn: 选择一个熵函数

# entropyTooltip
source: Select an entropy function
de: Wählen Sie eine Entropie-Funktion
ru: Выберите функцию энтропии
zh_cn: 选择一个熵函数

# weighttableCaption
source: Fitness Weight Table to use
de: Gewichtungstabelle
ru: Таблица веса пригодности для использования
zh_cn: 健身体重表使用

# weighttableTooltip
source: Select a fitness weight table
de: Wählen Sie die zu verwendende Gewichtungstabelle.
ru: Выберите таблицу весов для фитнеса
zh_cn: 选择健身体重表

# PluginCaption
source: Cost Function
de: Kostenfunktion
ru: Функция стоимости
zh_cn: 成本函数

# PluginTooltip
source: Cost Function
de: Kostenfunktion
ru: Функция стоимости
zh_cn: 成本函数

# BytesOffsetCaption
source: Bytes offset
de: ignorierte Bytes
ru: Смещение байтов
zh_cn: 字节偏移

# BytesOffsetTooltip
source: Which amount of bytes should be skipped before applying regex?
de: Wie viele Bytes sollen vor Anwendung der regulären Ausdrücke übersprungen werden?
ru: Какое количество байтов должно быть пропущено перед применением регулярного выражения?
zh_cn: 应用正则表达式之前应跳过哪个字节数量？

# StatisticsCorpusList1
source: German
de: deutsch
ru: Немецкий
zh_cn: 德语

# StatisticsCorpusList2
source: English
de: englisch
ru: английский
zh_cn: 英语

# StatisticsCorpusList3
source: custom (...)
de: benutzerdefiniert (...)
ru: обычай (...)
zh_cn: 自定义（...）

# entropyList1
source: External (NativeCryptography, default)
de: Extern (NativeCryptography, default)
ru: Внешний (NativeCryptography, default)
zh_cn: 外部（本机加密，默认）

# entropyList2
source: Internal
de: Intern
ru: внутренний
zh_cn: 内部

# weighttableList1
source: Matthews
zh_cn: 马修斯

# weighttableList3
source: Custom Weight table (*.csv)
de: benutzerdefinierte Gewichtung (*.csv)
ru: Таблица пользовательских весов (* .csv)
zh_cn: 自定义权重表（* .csv）

# BlocksizeCaption
source: Blocksize
de: Blockgröße
ru: Размер блока
zh_cn: 块大小

# BlocksizeTooltip
source: How many characters should be combined to one block?
de: Wie viele Buchstaben sollen zu einem Block zusammengefasst werden?
ru: Сколько символов должно быть объединено с одним блоком?
zh_cn: 一个块应组合多少个字符？

# NGramSizeCaption
source: N-Gram size
de: N-Gramm-Größe
ru: Размер N-грамм
zh_cn: N克大小

# NGramSizeTooltip
source: Size of the n-grams to use
de: Größe der zu verwendenden N-Gramme
ru: Размер n-граммов для использования
zh_cn: 要使用的n克大小

source: Entropy
de: Entropie
ru: энтропия
zh_cn: 熵

# IOC
source: Index of Coincedence
de: Koinzidenzindex
ru: Индекс совпадения
zh_cn: 符合指数

source: N-Grams Log2
de: N-Gramme Log2
ru: N-граммы Log2
zh_cn: N克Log2

# RegEx
source: Regular Expression
de: Regulärer Ausdruck
ru: Регулярное выражение
zh_cn: 正则表达式

# UseSpacesCaption
source: Use spaces
de: Benutze Leerzeichen
ru: Используйте пробелы
zh_cn: 使用空间

# UseSpacesTooltip
source: If selected, text frequency statistics containing spaces are used
de: Wenn selektiert werden Textstatistiken genutzt, die Leerzeichen enthalten
ru: Если этот параметр выбран, используется текстовая статистика, содержащая пробелы.
zh_cn: 如果选中，则使用包含空格的文本统计信息

# LanguageCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# LanguageTooltip
source: Use n-grams of this language for the costfunction.
de: Nutze N-Gramme dieser Sprache für die Kostenfunktion.
ru: Используйте n-граммы этого языка для функции стоимости.
zh_cn: 使用n-gram这种语言的成本函数。

# weighttableList2
source: Toemeh-Arumugam
ru: Toemeh-Арумуги
