Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/NetworkReceiver/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AmountLabel
source: Received Packages:
de: Empfangene Pakete:
ru: Полученные пакеты:
zh_cn: 收到的包裹：

# IPFromHeader
source: Source IP Address
de: Absender-IP-Adresse
ru: Исходный IP-адрес
zh_cn: 源IP地址

# MetaLabel
source: Info
ru: Информация
zh_cn: 信息

# PackageLimitCaption
source: Package limit
de: Paketlimit
ru: Предел пакета
zh_cn: 包装限制

# PackageLimitTooltip
source: Indicates the amount of packages after which the component will stop. 0 means "don't stop".
de: Anzahl der Pakete, nach denen die Komponente anhalten soll. 0 bedeutet "halte nicht".
ru: Указывает количество пакетов, после которых компонент остановится. 0 означает «не останавливаться».
zh_cn: 指示将停止组件的软件包数量。 0表示“不停止”。

# PaylodHeader
source: Received Data
de: Empfangene Daten
ru: Полученные данные
zh_cn: 收到资料

# PluginCaption
source: Network Receiver
de: Netzwerk-Empfänger
ru: Сетевой приемник
zh_cn: 网络接收器

# PluginTooltip
source: Receives packets sent over a network
de: Empfängt über ein Netzwerk gesendete Pakete
ru: Получает пакеты, отправленные по сети
zh_cn: 接收通过网络发送的数据包

# PortCaption
source: Port
ru: порт
zh_cn: 港口

# PortTooltip
source: Port on which the component will listen
de: Port, auf welchem die Komponente horchen soll
ru: Порт, на котором компонент будет прослушивать
zh_cn: 组件将侦听的端口

# ReceivedPackagesLabel
source: Received Packages
de: Empfangene Pakete
ru: Полученные пакеты
zh_cn: 收到包裹

# SingleOutputCaption
source: Single Packet
de: Einzelnes Paket
ru: Одиночный пакет
zh_cn: 单包

# SingleOutputTooltip
source: Data of a single packet
de: Daten eines einzenen Paketes
ru: Данные одного пакета
zh_cn: 单个数据包的数据

# StartLabel
source: Start Time:
de: Gestartet um:
ru: Время начала:
zh_cn: 开始时间：

source: Stop Conditions
de: Haltebedingungen
ru: Условия остановки
zh_cn: 停止条件

# StreamOutputCaption
source: Latest Packet
de: Letztes Paket
ru: Последний пакет
zh_cn: 最新包

# StreamOutputTooltip
source: Forwards the last received packet.
de: Leitet das zuletzt empfangene Paket weiter
ru: Пересылает последний полученный пакет.
zh_cn: 转发最后收到的数据包。

# TimeLimitCaption
source: Time Limit
de: Zeitlimit
ru: Лимит времени
zh_cn: 时限

# TimeLimitTooltip
source: Indicates the number of seconds after which the component will stop. 0 means "don't stop".
de: Zeitspanne in Sekunden, nach der die Komponente anhalten soll. 0 bedeutet "halte nicht".
ru: Указывает количество секунд, после которых компонент остановится. 0 означает «не останавливаться».
zh_cn: 指示组件将停止的秒数。 0表示“不停止”。

# TORHeader
source: Received at
de: Empfangen um
ru: Получено в
zh_cn: 在收到

# UniqueIPLabel
source: Sources:
de: Absender:
ru: Источники:
zh_cn: 资料来源：

# DeviceIpCaption
source: Network device IP Address
de: IP-Adresse:
ru: IP-адрес сетевого устройства
zh_cn: 网络设备IP地址

# DeviceIpTooltip
source: Enter the IP address of your network device to only receive from this device.
de: Geben Sie die IP-Adresse Ihrer Netzwerkkarte an, um nur von dieser IP-Adresse zu empfangen.
ru: Введите IP-адрес вашего сетевого устройства только для приема с этого устройства.
zh_cn: 输入网络设备的IP地址，使其仅从该设备接收。

# LisPort
source: Port:
ru: Порт:
zh_cn: 港口：

# NetworkConditionsGroup
source: Network Settings
de: Netzwerk-Einstellungen
ru: Настройки сети
zh_cn: 网络设置

# NetworkDeviceCaption
source: Use all network interfaces
de: Alle Netzwerkgeräte benutzen
ru: Использовать все сетевые интерфейсы
zh_cn: 使用所有网络接口

# NetworkDeviceTooltip
source: Enter the IP address of your network interface to only receive from this device.
de: Geben Sie die IP-Adresse ihrer Netzwerkkarte an, um nur von dieser zu empfangen.
ru: Введите IP-адрес сетевого интерфейса только для приема с этого устройства.
zh_cn: 输入您的网络接口的IP地址，使其仅从该设备接收。

# ByteAsciiSwitchCaption
source: show bytes as ASCII
de: Bytes als ASCII anzeigen
ru: показывать байты как ASCII
zh_cn: 将字节显示为ASCII

# ByteAsciiSwitchTooltip
source: show bytes as ASCII
de: Bytes als ASCII anzeigen
ru: показывать байты как ASCII
zh_cn: 将字节显示为ASCII

# PresentationSettingsGroup
source: Presentation
de: Präsentation
ru: презентация
zh_cn: 介绍

source: Size
de: Größe
ru: Размер
zh_cn: 尺寸

# ProtocolCaption
source: Protocol
de: Protokoll
ru: протокол
zh_cn: 协议

# ProtocolTooltip
source: Changes the protocol type
de: Ändert den Protokoll-Typ
ru: Изменяет тип протокола
zh_cn: 更改协议类型

# SpeedrateLabel
source: Receiving Rate:
de: Empfangsrate:
ru: Частота приема:
zh_cn: 接收率：

# updateSpeedrateLable
source: update receiving rate intervall:
de: Empfangsrate-Aktualisierungsintervall:
ru: обновление промежуточной частоты приема:
zh_cn: 更新接收速率间隔：

# updateSpeedrateTooltip
source: Sets the time in seconds in which the receiving rate will be updated.
de: Bestimmt die Zeitspanne in Sekunden, in der die Empfangsrate neu berechnet wird
ru: Устанавливает время в секундах, в течение которого скорость приема будет обновляться.
zh_cn: 设置更新接收速率的时间（以秒为单位）。

# NumberOfClientsCaption
source: Client limit
ru: Предел клиента
zh_cn: 客户限额

# NumberOfClientsTooltip
source: Sets the maximum number of client connections. 0 means "no limit".
de: Setzt die maximale Anzahl von Client-Verbindungen. 0 bedeutet "kein Limit".
ru: Устанавливает максимальное количество клиентских подключений. 0 означает «без ограничений».
zh_cn: 设置最大客户端连接数。 0表示“无限制”。

# TCPServerConditionsGroup
source: TCP Conditions
de: TCP-Eigenschaften
ru: Условия TCP
zh_cn: TCP条件

# ConnectionIDInputCaption
source: Connection Input
de: Verbindungseingang
ru: Вход для подключения
zh_cn: 连接输入

# ConnectionIDInputTooltip
source: Specifies on which connection the Receiver should listen
de: Gibt an, welche Verbindung der Empfänger überwachen soll
ru: Определяет, на каком подключении приемник должен прослушивать
zh_cn: 指定接收方应在哪个连接上侦听

# ConnectionIDOutputCaption
source: Connection Output
de: Verbindungsausgang
ru: Выход подключения
zh_cn: 连接输出

# ConnectionIDOutputTooltip
source: Shows the ID of the current connection
de: Gibt die ID der aktuellen Verbindung an
ru: Показывает идентификатор текущего соединения
zh_cn: 显示当前连接的ID

# ConnectionCaption
source: Only use Connection Input
de: Nur Verbindungseingang benutzen
ru: Используйте только вход для подключения
zh_cn: 仅使用连接输入

# ConnectionTooltip
source: The component will not create a new connection. It will only use the connection specified on the connection input.
de: Die Komponente erstellt keine eigenen Verbindungen. Sie wird nur die übergebene Verbindung verwenden.
ru: Компонент не создаст новое соединение. Он будет использовать только соединение, указанное на входе соединения.
zh_cn: 该组件将不会创建新的连接。它将仅使用在连接输入上指定的连接。
