Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/ADFGVXAnalyzer/Properties/Resources.*.resx
Languages: de

# ADFGVXAnalyzerCaption
source: ADFGVX Analyzer
de: ADFGVX-Analyse-Komponente

# AlphabetCaption
source: Plaintext alphabet
de: Klartext-Alphabet

# AlphabetGroup
source: Language
de: Sprache

# AlphabetTooltip
source: Characters contained in plaintext
de: Zeichen die der Klartext enthält

# ChooseAlphabetCaption
source: Language
de: Sprache

# ChooseAlphabetList1
source: German
de: Deutsch

# ChooseAlphabetList3
source: France
de: Französisch

# ChooseAlphabetList4
source: Italia
de: Italienisch

# ChooseAlphabetList5
source: Spain
de: Spanisch

# ChooseAlphabetTooltip
source: Language of messages
de: Natürliche Sprache der verschlüsselten Nachrichten

# ChooseSeparatorCaption
source: Separator
de: Trennzeichen

# ChooseSeparatorList1
source: Newline
de: Zeilenumbruch

# ChooseSeparatorList2
source: Comma
de: Komma

# ChooseSeparatorList3
source: Semicolon
de: Semikolon

# ChooseSeparatorList4
source: Blank
de: Leerzeichen

# ChooseSeparatorTooltip
source: Character to separate the messages.
de: Mit welchem Zeichen werden die Nachrichten voneinander getrennt

# CiphertextCaption
source: Ciphertext
de: Geheimtext

# CiphertextTooltip
source: The ciphertext that should be analyzed.
de: Der Geheimtext, der analysiert werden soll.

# Copy_all
source: Copy all lines
de: Kopiere alle Zeilen.

# Copy_ic1
source: Copy IoC1
de: Kopiere IoC1

# Copy_ic2
source: Copy IoC2
de: Kopiere IoC2

# Copy_line
source: Copy selected line
de: Kopiere selektierte Zeile

# Copy_plaintext
source: Copy transposition result
de: Kopiere Transpositions Ergebnis

source: Copy Score
de: Kopiere Wertung

# Copy_transkey
source: Copy transpositionkey
de: Kopiere Schlüssel

# ElapsedLabel
source: Elapsed Time:
de: Vergangene Zeit:

# EncryptAlphabetCaption
source: Ciphertext alphabet
de: Chiffrealphabet

# EncryptAlphabetTooltip
source: Characters contained in cipher text
de: Zeichen aus denen der verschlüsselte Text besteht

# EndLabel
source: End Time:
de: Endzeit:

source: Keylength
de: Schlüssellänge

# KeyLengthLabel
source: Analyzed keylength:
de: Analysierte Schlüssellänge:

# KeyLengthToolTip
source: Keylength of the transpositionkey
de: Die Schlüssellänge desTranspositionsschlüssels der ADFGVX

# KeysLabel
source: keys / sec:
de: Schlüssel / sek:

# LocalLabel
source: Analysis
de: Analyse

# LogTextToolTip
source: Complete log of the analysis component
de: Vollständiger Log der Analyse Komponente

# MessageGroup
source: Messages
de: Nachrichten

# MessagesCaption
source: Messages
de: Nachrichten

# MessagesLabel
source: Number of messages:
de: Anzahl Nachrichten:

# MessagesToolTip
source: Encrypted messages, multiple messages separated by a delimiter
de: Verschlüsselte Nachrichten, mehrere Nachrichten getrennt durch ein Trennzeichen

# ParametersGroup
source: Additional Options
de: Zusätzliche Optionen

# PlaintextHeader
source: Transposition result
de: Transpositions Ergebins

source: Restarts
de: Neustarts

# RestartsToolTip
source: How often should the algorithm restart
de: Wie oft der Algorithmus neustarten soll

# ScoreHeader
source: Score
de: Wertung

# StartLabel
source: Start Time:
de: Startzeit:

# ThreadsToolTip
source: How many threads should be started in parallel
de: Wie viele Threads sollen parallel gestartet werden

# TopTenLabel
source: Bestlist
de: Bestenliste

# TranskeyHeader
source: Transposition key
de: Transpositionsschlüssel

# TranspositionkeyCaption
source: Transposition key
de: Transpositionsschlüssel

# TranspositionkeyToolTip
source: A permutation of the transposition key expressed in letters
de: Eine Permutation des Transpositionsschlüssels ausgedrückt in Buchstaben

# TranspositionResultCaption
source: Transposition result
de: Transpositions Ergebnis

# TranspositionResultToolTip
source: Interim result of ADFGVX, result requires a monoalphabetic substitution
de: Zwischenergebnis der ADFGVX, Ergebnis benötigt eine monoalphabetische Substitution

# ADFGVXAnalyzerToolTip
source: This component analyzes the transposition key of the ADFGVX cipher
de: Diese Komponente analysiert den Transpositionsschlüssel der ADFGVX-Chiffre

source: Deviation
de: Abweichung

# DeviationToolTip
source: Deviation in percent of the ideal cost value, from when the substitution analysis is to be carried out.
de: Abweichung in Prozent zum idealen Kostenwert, ab wann die Substitutionsanalyse durchgeführt werden soll.

# ExceptionDuringCheckOfMessages
source: Exception occured during check of messages: {0}
de: Es trat eine Ausnahme während des Checks der Nachrichten auf: {0}

# ExceptionDuringThread
source: Exception occured during execution of ADFGVX Analyzer thread: {0}
de: Es trat eine Ausnahme während der Ausführung eines ADFGVX-Analyse-Threads auf: {0}

# InvalidCharacters
source: One of the messages contains invalid characters: {0}
de: Eine der Nachrichten enthält ungültige Zeichen: {0}

# NotEvenLength
source: One of the messages is not of even length: {0}
de: Eine der Nachrichten hat keine gerade Länge: {0}
