Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Playfair/Properties/Resources.*.resx
Languages: de, zh_cn

# PluginCaption
source: Playfair
zh_cn: 平等游戏

# PluginTooltip
source: Classic digraphic substitution cipher
de: Klassische bigraphische Substitutions-Chiffre
zh_cn: 经典二字替换密码

# InputStringCaption
source: Text input
de: Texteingabe
zh_cn: 文字输入

# InputStringTooltip
source: Input a string to be processed by the Playfair cipher
de: Geben Sie den Text ein, der mit dem Playfair-Verfahren ver-/entschlüsselt werden soll.
zh_cn: 输入要由Playfair密码处理的字符串

# PreFormatedInputStringCaption
source: Pre-formated input string
de: Vorformatierter Eingabetext
zh_cn: 预格式化的输入字符串

# PreFormatedInputStringTooltip
source: If the pre-format text option is enabled, the input string is limited to the characters contained in the used key.
de: Wenn die Vorformatierung des Eingabetextes aktiviert ist, dann wird der Eingabetext auf die Zeichen, die im benutzten Schlüssel enthalten sind, begrenzt.
zh_cn: 如果启用了预格式化文本选项，则输入字符串仅限于所用键中包含的字符。

# OutputStringCaption
source: Text output
de: Ausgabetext
zh_cn: 文字输出

# OutputStringTooltip
source: The string after processing with the Playfair cipher
de: Der mit dem Playfair-Verfahren ver-/entschlüsselte Text.
zh_cn: 使用Playfair密码处理后的字符串

# ActionCaption
source: Action
de: Aktion
zh_cn: 行动

# ActionTooltip
source: Select the Algorithm action
de: Wählen Sie die Betriebsart des Plugins.
zh_cn: 选择算法动作

# AlphabetMatrixCaption
source: Key
de: Schlüssel
zh_cn: 键

# AlphabetMatrixTooltip
source: This is the key to be used to encrypt/decrypt.
de: Der für die Ver-/Entschlüsselung verwendete Schlüssel
zh_cn: 这是用于加密/解密的密钥。

# IgnoreDuplicatesCaption
source: Ignore duplicates
de: Duplikate ignorieren
zh_cn: 忽略重复

# IgnoreDuplicatesTooltip
source: Ignore duplicates within the key phrase
de: Ignoriere Duplikate im Schlüsselwort
zh_cn: 忽略关键字中的重复项

# KeyCaption
source: Key phrase
de: Schlüsselwort
zh_cn: 关键短语

# KeyTooltip
source: This is the key phrase from which the key is derived.
de: Das Schlüsselwort, aus dem der Schlüssel abgeleitet wird
zh_cn: 这是从中派生密钥的关键词。

# MatrixSizeCaption
source: Matrix size
de: Matrixgröße
zh_cn: 矩阵大小

# MatrixSizeTooltip
source: Select whether the Playfair should be run with a 5x5 or 6x6 matrix
de: Soll das Playfair-Verfahren mit einer 5x5- oder einer 6x6-Matrix durchgeführt werden?
zh_cn: 选择Playfair应使用5x5还是6x6矩阵运行

# PreFormatTextCaption
source: Pre-format text
de: Eingabetext vorformatieren
zh_cn: 预格式化文本

# PreFormatTextTooltip
source: This option is used to determine whether the text should be limited to the characters contained in the used key.
de: Soll der Eingabetext auf die Zeichen des benutzten Schlüssels beschränkt werden?
zh_cn: 此选项用于确定是否将文本限制为已使用键中包含的字符。

# SeparatorCaption
source: Separator
de: Trennzeichen
zh_cn: 分隔器

# SeparatorTooltip
source: Enter the character to separate pairs of identical letters
de: Geben Sie das Zeichen ein, mit dem Doppelbuchstaben getrennt werden sollen.
zh_cn: 输入字符以分隔成对的相同字母

# SeparatorReplacementCaption
source: Separator replacement
de: Trennzeichen-Trenner
zh_cn: 分离器更换

# SeparatorReplacementTooltip
source: Enter the character to separate double separators. E.g. a double XX will be separate by insertion of Y
de: Geben Sie das Zeichen an, das doppelte Trennzeichen trennen soll. Z.B. das doppelte Trennzeichen XX durch Einfügen von Y trennen.
zh_cn: 输入字符以分隔双倍分隔符。例如，双XX将通过插入Y分开

# SeparatePairsCaption
source: Separate pairs
de: Doppelbuchstaben trennen
zh_cn: 分开的对

# SeparatePairsTooltip
source: Separate pairs of identical letters
de: Trenne Doppelbuchstaben durch das Trennzeichen
zh_cn: 成对的相同字母

# SeparatePairsTPCaption
source: Separate pairs
de: Doppelbuchstaben trennen
zh_cn: 分开的对

# SeparatePairsTPTooltip
source: Separate pairs of identical letters
de: Trenne Doppelbuchstaben durch das Trennzeichen
zh_cn: 成对的相同字母

# ActionList1
source: Encrypt
de: Verschlüsselung
zh_cn: 加密

# ActionList2
source: Decrypt
de: Entschlüsselung
zh_cn: 解密

# IgnoreDuplicatesList1
source: Ignore duplicates within the key phrase
de: Duplikate im Schlüsselwort ignorieren
zh_cn: 忽略关键字中的重复项

# PreFormatTextList1
source: Pre-format text
de: Text vorformatieren
zh_cn: 预格式化文本

# SeparatePairsList1
source: Separate pairs of identical letters
de: Trenne Doppelbuchstaben durch das Trennzeichen
zh_cn: 成对的相同字母
