Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/HomophonicSubstitutionAnalyzer/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AlgorithmSettingsGroup
source: Cryptanalysis algorithm settings
de: Einstellungen des Kryptoanalyse-Algorithmus
ru: Настройки алгоритма криптоанализа
zh_cn: 密码分析算法设置

# AnalaysisModeTooltip
source: Automatic or semi-automatic mode
de: Automatischer oder halbautomatischer Modus
ru: Автоматический или полуавтоматический режим
zh_cn: 自动或半自动模式

# AnalysisModeCaption
source: Analysis mode
de: Analysemodus
ru: Режим анализа
zh_cn: 分析模式

source: Bestlist
de: Bestenliste
zh_cn: 最佳名单

source: Ciphertext:
de: Geheimtext:
ru: зашифрованный:
zh_cn: 密文：

source: Ciphertext alphabet:
de: Geheimtext-Alphabet:
ru: Зашифрованный алфавит:
zh_cn: 密文字母：

# CiphertextCaption
source: Ciphertext
de: Geheimtext
ru: зашифрованный
zh_cn: 密文

# CiphertextFormatCaption
source: Ciphertext format
de: Geheimtext-Format
ru: Формат зашифрованного текста
zh_cn: 密文格式

# CiphertextFormatTooltip
source: This defines the format of the ciphertext (single letters, number groups, or comma-separated)
de: Dies definiert das Format des Geheimtextes (einzelne Buchstaben, Zahlengruppen oder durch Kommas getrennt).
ru: Это определяет формат зашифрованного текста (отдельные буквы, группы чисел или через запятую)
zh_cn: 这定义了密文的格式（单个字母，数字组或逗号分隔）

# CiphertextTooltip
source: Ciphertext to analyze
de: Zu analysierender Geheimtext
ru: Зашифрованный текст для анализа
zh_cn: 要分析的密文

source: Symbol-separated
de: Zeichen-getrennt
ru: Разграниченный
zh_cn: 符号分隔

# Copy_all
source: Copy all lines
de: Kopieren Sie alle Zeilen
ru: Скопируйте все строки
zh_cn: 复制所有行

source: Copy key
de: Schlüssel kopieren
ru: Копировать ключ
zh_cn: 复制键

# Copy_line
source: Copy selected line
de: Kopiere ausgewählte Zeile
ru: Скопировать выбранную строку
zh_cn: 复制所选行

source: Copy text
de: Text kopieren
ru: Скопировать текст
zh_cn: 复制文字

source: Copy value
de: Wert kopieren
ru: Копировать значение
zh_cn: 复制值

source: Cost value: {0}
de: Kostenwert: {0}
ru: Стоимость: {0}
zh_cn: 成本值：{0}

# StepsCaption
source: Steps
de: Schritte

# StepsTooltip
source: Number of steps performed by the hillclimber
de: Anzahl an Schritten, die der Hillclimber durchführt

# DictionaryCaption
source: Dictionary
de: Wörterbuch
ru: толковый словарь
zh_cn: 字典

# DictionaryTooltip
source: The attached dictionary is used during cryptanalysis to find and lock already revealed plaintext words.
de: Das angehängte Wörterbuch wird während der Kryptoanalyse verwendet, um bereits aufgedeckte Klartextwörter zu finden und zu fixieren.
ru: Прилагаемый словарь используется во время криптоанализа для поиска и блокировки уже открытых открытых текстовых слов.
zh_cn: 附带的字典在密码分析期间用于查找和锁定已显示的明文单词。

# DifferentHomophones
source: The ciphertext length is {0} and the ciphertext contains {1} different homophones.
de: Die Geheimtextlänge beträgt {0} und der Geheimtext enthält {1} verschiedene Homophone.
ru: Длина зашифрованного текста равна {0}, а зашифрованный текст содержит {1} различных гомофонов.
zh_cn: 密文长度为{0}，并且密文包含{1}个不同的同音词。

source: Find/Lock words
de: Wörter suchen/fixieren
ru: Найти / заблокировать слова
zh_cn: 查找/锁定单词

# StartTemperatureCaption
source: Start temperature
de: Starttemperatur

# FullAutomatic
source: Automatic
de: Automatisch
ru: автоматическая
zh_cn: 自动

# KeyHeader
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

source: Key letter distribution
de: Verteilung der Schlüsselbuchstaben
ru: Распределение ключей
zh_cn: 关键字母分布

# LanguageCaption
source: Language
de: Sprache
ru: язык
zh_cn: 语言

# LanguageSettingsGroup
source: Language settings
de: Spracheinstellungen
ru: Языковые настройки
zh_cn: 语言设定

# LanguageTooltip
source: This language will be used by the cost function
de: Diese Sprache wird von der Kostenfunktion verwendet
ru: Этот язык будет использоваться функцией стоимости
zh_cn: 此语言将由成本函数使用

# MaxWordLengthCaption
source: Maximum word length
de: Maximale Wortlänge
ru: Максимальная длина слова
zh_cn: 最大字长

# MaxWordLengthTooltip
source: The maximum length of each word to auto lock
de: Die maximale Länge jedes Wortes, das automatisch fixiert werden soll
ru: Максимальная длина каждого слова для автоматической блокировки
zh_cn: 自动锁定的每个单词的最大长度

# MinWordLengthCaption
source: Minimum word length
de: Minimale Wortlänge
ru: Минимальная длина слова
zh_cn: 最小字长

# MinWordLengthTooltip
source: The minimum length of each word to auto lock
de: Die minimale Länge jedes zu fixierenden Wortes
ru: Минимальная длина каждого слова для автоматической блокировки
zh_cn: 自动锁定的每个单词的最小长度

source: Number groups
de: Nummerngruppen
ru: Числовые группы
zh_cn: 数字组

# Plaintext
source: Revealed plaintext:
de: Aufgedeckter Klartext:
ru: Выявленный открытый текст:
zh_cn: 显示的纯文本：

source: Plaintext mapping:
de: Klartext-Mapping:
ru: Отображение открытого текста:
zh_cn: 纯文本映射：

# PlaintextCaption
source: Plaintext
de: Klartext
ru: Простой текст
zh_cn: 纯文本

# PlaintextTooltip
source: New plaintext candidates with higher scores are shown here
de: Hier werden neue Klartextkandidaten mit höheren Punktzahlen angezeigt
ru: Новые открытые кандидаты с более высокими баллами показаны здесь
zh_cn: 显示更高分数的新纯文本候选者

# PluginCaption
source: Homophonic Substitution Analyzer
de: Homophoner Substitutionsanalysator
ru: Анализатор гомофонического замещения
zh_cn: 谐音替代分析仪

# PluginTooltip
source: Analyzer to cryptanalyze homophonic substitution ciphers
de: Komponente zur Kryptoanalyse homophoner Substitutionschiffren
ru: Анализатор для криптоанализа шифров гомофонического замещения
zh_cn: 分析器对同声替换密码进行密码分析

source: Reset locked letters
de: Fixierte Buchstaben zurücksetzen
ru: Сброс заблокированных писем
zh_cn: 重置锁定字母

# RestartsCaption
source: Restarts
de: Neustart
ru: Перезапуск
zh_cn: 重新启动

# RestartsTooltip
source: How many times should the analysis algorithm be restarted?
de: Wie oft muss der Analysealgorithmus neu gestartet werden?
ru: Сколько раз должен быть перезапущен алгоритм анализа?
zh_cn: 分析算法应重新启动多少次？

source: Semi automatic
de: Halbautomatisch
ru: Полуавтомат
zh_cn: 半自动

source: Single letters
de: Einzelne Buchstaben
ru: Отдельные буквы
zh_cn: 单字母

# TextHeader
source: Revealed plaintext
de: Aufgedeckter Klartext
ru: Выявленный открытый текст
zh_cn: 显示明文

# TopTenLabel
source: Bestlist
de: Bestenliste
zh_cn: 最佳名单

# UseSpacesCaption
source: Use spaces
de: Verwende Leerzeichen
ru: Используйте пробелы
zh_cn: 使用空间

# UseSpacesTooltip
source: If activated, the analyzer assumes spaces in the plaintext
de: Wenn aktiviert, nimmt der Analysator Leerzeichen im Klartext an
ru: Если активирован, анализатор предполагает наличие пробелов в открытом тексте
zh_cn: 如果激活，则分析器将采用明文形式的空格

# ValueHeader
source: Costvalue
de: Kostenwert
zh_cn: 成本价值

# WordCountToFindCaption
source: Word count to find
de: Wortzahl zu finden
ru: Количество слов, чтобы найти
zh_cn: 字数查找

# WordCountToFindTooltip
source: Defines the minimum number of words to find in the revealed plaintext, that the auto locker locks the according symbols
de: Definiert die minimale Anzahl von Wörtern, die im angezeigten Klartext gefunden werden müssen, damit die automatische Fixierung die entsprechenden Symbole fixiert
ru: Определяет минимальное количество слов, которые нужно найти в открытом тексте, чтобы автоматическая блокировка блокировала соответствующие символы
zh_cn: 定义要在显示的纯文本中找到的最小单词数，自动储物柜将锁定相应的符号

# WordLockerGroup
source: Word locker
de: Wortfixierung
ru: Слово шкафчик
zh_cn: 储物柜

# LetterLabel
source: Letter
de: Buchstabe
ru: Письмо
zh_cn: 信件

# MaxLabel
source: Maximum number
de: Maximale Anzahl
ru: Максимальное количество
zh_cn: 最大人数

# MinLabel
source: Minimum number
de: Mindestanzahl
ru: Минимальное количество
zh_cn: 最小人数

# FoundWordsCaption
source: Found words
de: Gefundene Wörter
ru: Найденные слова
zh_cn: 找到的话

# FoundWordsTooltip
source: Found words based on the connected dictionary are shown here
de: Gefundene Wörter, die auf dem verbundenen Wörterbuch basieren, werden hier angezeigt
ru: Найденные слова на основе подключенного словаря показаны здесь
zh_cn: 在此显示根据连接的词典找到的单词

# KeyCaption
source: Revealed key
de: Aufgedeckter Schlüssel
ru: Выявленный ключ
zh_cn: 显露钥匙

# KeyTooltip
source: New key candidates with higher scores are shown here
de: Hier werden neue Schlüsselkandidaten mit höheren Punktzahlen angezeigt
ru: Новые ключевые кандидаты с более высокими баллами показаны здесь
zh_cn: 此处显示得分更高的新关键候选人

source: Comma
de: Komma
ru: запятая
zh_cn: 段

source: Full stop
de: Punkt
ru: точка
zh_cn: 句号

source: Semicolon
de: Semikolon
ru: точка с запятой
zh_cn: 分号

# SeparatorCaption
source: Separator
de: Trennzeichen
ru: сепаратор
zh_cn: 分隔器

# SeparatorTooltip
source: Separator used for separating the ciphertext into single letters or letter groups.
de: Das Trennzeichen, das genutzt wird, um den Geheimtext in einzelne Buchstaben oder Buchstabengruppen zu zerlegen.
ru: Разделитель, который используется для разбиения зашифрованного текста на отдельные буквы или группы букв.
zh_cn: 分隔符，用于将密文分为单个字母或字母组。

# Space
source: Space symbol
de: Leerzeichen
ru: пространства
zh_cn: 空格符号

source: Analyze
de: Analysieren
ru: Начать анализ
zh_cn: 分析

# UseNullsCaption
source: Use nulls
de: Verwende Nulls
ru: Используйте нули
zh_cn: 使用空值

# UseNullsTooltip
source: If activated, the analyzer assumes nulls in the ciphertext
de: Wenn aktiviert, nimmt der Analysator Nulls (Blender) im Geheimtext an
ru: Если активирован, анализатор принимает нулевые значения в зашифрованном тексте
zh_cn: 如果激活，分析器将假定密文为空

# KeepLinebreaksCaption
source: Keep linebreaks
de: Zeilenumbrüche erhalten
ru: Держите разрывы строк
zh_cn: 保持换行

# KeepLinebreaksTooltip
source: If activated, the analyzer keeps the original linebreaks of the given text
de: Wenn aktiviert, behält die Analyse die ursprünglichen Zeilenumbrüche des angegebenen Textes bei
ru: Если активирован, анализатор сохраняет исходные разрывы строк данного текста
zh_cn: 如果激活，分析器将保留给定文本的原始换行符

# HomophonicityCaption
source: Homophonicity
de: Homophonie

# HomophonicityTooltip
source: What homophonicity number should be used in the generated keys?
de: Welche Homophoniezahl sollte in den generierten Schlüsseln verwendet werden?

# KeyLetterDistributionGroup
source: Key letter distribution
de: Verteilung der Schlüsselbuchstaben

# KeyLetterDistributionTypeCaption
source: Type of key letter distribution
de: Art der Verteilung von Schlüsselbuchstaben

# KeyLetterDistributionTypeTooltip
source: How should letters in the key be distributed?
de: Wie sollen die Buchstaben des Schlüssels verteilt werden?

source: Language-based
de: Sprachbasiert

source: Uniform
de: Gleichverteilt

# StartTemperatureTooltip
source: Start temperature of the simulated annealing algorithm
de: Starttemperatur des Simulated Annealing-Algorithmus

source: Find/Lock nomenclature elements
de: Nomenklator-Elemente suchen/fixieren

# NomenclatureElementsThresholdCaption
source: Max threshold
de: Maximalwert-Schwelle

# NomenclatureElementsThresholdGroup
source: Nomenclature element locking
de: Nomenklatur-Elemente-Fixierung

# NomenclatureElementsThresholdTooltip
source: Maximum number of identical symbols occurring in the text to be marked as nomenclature elements
de: Maximale Anzahl der im Text vorkommenden gleichen Symbole, die als Nomenklaturelemente gekennzeichnet werden sollen

source: Analyzer
ru: анализатор
zh_cn: 分析仪

# TextFormatGroup
source: Text format
ru: Текстовый формат
zh_cn: 文字格式

source: Stop
ru: ватит анализировать
zh_cn: 停止
