Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/PlayfairAnalyzer/Properties/Resources.*.resx
Languages: de, ru

# AlreadyExecuted
source: The "Playfair Analyzer" already started with data given in this run of the workspace. In order to change input data and to restart the component "Playfair Analyzer", please stop and start the workspace.
de: Die Komponente "Playfair Analyse" wurde bereits einmal gestartet. Starten Sie die Komponente neu, indem Sie den Arbeitsbereich anhalten und neu starten.
ru: «Анализ Playfair» уже был запущен один раз. Перезапустите компонент Playfair Analyzse, приостановив и перезапустив рабочее пространство.

# CiphertextCaption
source: Ciphertext
de: Geheimtext
ru: шифротекста

# CiphertextTooltip
source: The ciphertext that should be analyzed
de: Der zu analysierende Geheimtext
ru: Зашифрованный текст для анализа.

# Copy_all
source: Copy all lines
de: Kopiere alle Einträge
ru: Скопируйте все записи

source: Copy key
de: Kopiere Schlüssel
ru: Копировать ключи

# Copy_line
source: Copy selected line
de: Kopiere markierten Eintrag
ru: Скопировать выбранную запись

source: Copy text
de: Kopiere Text
ru: Скопировать текст

source: Copy value
de: Kopiere Kostenwert
ru: Стоимость копирования

# CribTooltip
source: A crib that is used during the analysis
de: Ein Crib, der bei der Kryptoanalyse genutzt wird
ru: «Crib», которая используется в криптоанализе.

# CyclesCaption
source: Cycles
de: Zyklen
ru: циклы

# CyclesTooltip
source: How many cycles may the cryptanalysis perform?
de: Stellt die Anzahl ein, wie viele Zyklen während der Kryptoanalyse ausgeführt werden
ru: станавливает количество циклов криптоанализа, которые должны быть выполнены во время анализа.

# LanguageCaption
source: Language
de: Sprache

# LanguageTooltip
source: Language of the plaintext. This information is required for the statistical analysis.
de: Die Sprache des Klartextes. Diese Information wird für die statistische Analyse benötigt.

# DiscardSamePlaintextsCaption
source: Discard same plaintexts
de: Verwerfe gleiche Klartexte

# DiscardSamePlaintextsTooltip
source: Determines whether different keys with same plaintext should be included in best list
de: Bestimmt, ob unterschiedliche Schlüssel mit gleichem Klartext in der Bestenliste aufgeführt werden sollen

# AdvancedBestListViewCaption
source: Advanced best list view
de: Erweiterte Bestenlistenansicht

# AdvancedBestListViewTooltip
source: Makes additional columns in best list view visible
de: Macht zusätzliche Spalten in der Bestenlistenansicht sichtbar

# ElapsedLabel
source: Elapsed time:
de: Vergangene Zeit:
ru: Прошлое время:

# EndLabel
source: End time:
de: Endzeit:
ru: Время окончания:

# EvaluatedKeysLabel
source: # evaluated keys:
de: # ausgewertete Schlüssel:

# MaxKeysLabel
source: Max. # keys to evaluate:
de: Max. # auszuwertende Schlüssel:

# KeySpaceSizeLabel
source: Size of key space:
de: Größe des Schlüsselraums:

# ElapsedHeader
source: Elapsed
de: Vergangen

# EvaluationsHeader
source: Evaluations
de: Evaluierungen

# EvaluationsColumnFormat
source: {0:N0} K decryptions
de: {0:N0} K Entschlüsselungen

# PerformanceHeader
source: Performance
de: Performanz

# KeyCaption
source: Best key
de: Bester Schlüssel
ru: Лучший ключ

# KeyHeader
source: Key
de: Schlüssel
ru: ключ

# KeyTooltip
source: The best key which was found during the analysis
de: Der beste Schlüssel, der während der Analyse gefunden wurde
ru: Лучший ключ, найденный во время анализа.

# LocalLabel
source: Analysis
de: Analyse
ru: анализ

# PlaintextCaption
source: Best Plaintext
de: Bester Klartext
ru: Лучший текст

# PlaintextTooltip
source: The best plaintext which was found during the analysis
de: Der beste Klartext, der während der Analyse gefunden wurde
ru: Лучший открытый текст, найденный во время анализа.

# PluginCaption
source: Playfair Analyzer
de: Playfair-Analyse
ru: Playfair анализ

# PluginTooltip
source: Analysis tool to break short Playfair ciphers
de: Kryptoanalyse der Playfair-Chiffre
ru: Криптоанализ на основе Java шифра Playfair.

# SpeedLabel
source: Keys/second:
de: Schlüssel/Sekunde:
ru: Ключ / второй:

# StartLabel
source: Start time:
de: Startzeit:
ru: Время начала:

# ThreadsTooltip
source: How many threads may the analyzer start for performing cryptanalysis?
de: Wieviele Threads sollen für die Kryptoanalyse gestartet werden?
ru: Сколько потоков должно быть запущено для криптоанализа?

# TopTenLabel
source: Bestlist
de: Bestenliste

# ValueHeader
source: Value
de: Kostenwert
ru: себестоимость

# MaxCribOffsetCaption
source: Maximum crib offset
de: Maximaler Crib-Offset

# MaxCribOffsetTooltip
source: Crib tests end with this offset in the text
de: Crib-Tests enden mit diesem Offset im Text

# MinCribOffsetCaption
source: Minimum crib offset
de: Minimaler Crib-Offset

# MinCribOffsetTooltip
source: Crib tests start with this offset in the text
de: Crib-Tests beginnen mit diesem Offset im Text

# TextHeader
source: Text
ru: текст

# ThreadsCaption
source: Threads
ru: Потоки
