Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/LatticeCrypto/Properties/Languages.*.resx
Languages: de

# buttonCryptanalysis
source: Cryptanalysis
de: Kryptoanalyse

# buttonDecrypt
source: Decrypt
de: Entschlüsseln

# buttonEncrypt
source: Encrypt
de: Verschlüsseln

# buttonFindClosestVector
source: Find closest vector
de: Finde nächsten Vektor

# buttonGenerateNewCryptosystem
source: Generate new keys
de: Generiere neue Schlüssel

# buttonGenerateNewLattice
source: Generate new lattice
de: Generiere neues Gitter

# labelCiphertext
source: Ciphertext:
de: Geheimtext:

# labelKeyLength
source: Key length:
de: Schlüssellänge:

# labelLatticeBasis
source: Given lattice basis
de: Gegebene Gitterbasis

# labelMultiplier
source: Multiplier:
de: Multiplikator:

# labelMultiplierInverse
source: Multiplier inverse:
de: Multiplikator Inverses:

# labelPlainText
source: Plaintext:
de: Klartext:

# labelPrivateKey
source: Private key:
de: Privater Schlüssel:

# labelPublicKey
source: Public key:
de: Öffentlicher Schlüssel:

# labelReducedLatticeBasis
source: Reduced lattice basis
de: Reduzierte Gitterbasis

# labelTargetPoint
source: Target point
de: Zielpunkt

# menuLanguage
source: Language
de: Sprache

# tabAttackRSA
source: RSA (Coppersmith's Attack)
de: RSA (Angriff auf stereotype Nachrichten)

# tabCryptanalysis
source: Lattice attacks against...
de: Gitterbasierte Angriffe gegen...

# tabGaussAlgorithm
source: Gauss algorithm
de: Gauß-Algorithmus

# tabIntroduction
source: Introduction
de: Einführung

# tabLatticeBasics
source: Lattice basics
de: Gitter Grundlagen

# tabLLLAlgorithm
source: LLL algorithm
de: LLL-Algorithmus

# titleMainWindow
source: Learning program for lattice-based cryptography
de: Lernprogramm zur gitterbasierten Kryptografie

# errorNoLatticeEntered
source: Please enter a new lattice.
de: Bitte geben Sie ein neues Gitter ein.

# errorOnlyIntegersAllowed
source: Only integers are allowed!
de: Es sind nur ganze Zahlen erlaubt!

# errorVectorsDependent
source: The vectors must be linearly independent!
de: Die Vektoren müssen linear unabhängig sein!

# titleEnterLattice
source: New lattice
de: Neues Gitter

# buttonAbort
source: Abort
de: Abbrechen

# buttonEnterLatticeManually
source: Enter lattice manually
de: Manuelle Eingabe

# menuExit
source: Exit
de: Beenden

# menuFile
source: File
de: Datei

# labelLengthBasisVectors
source: Length of the basis vectors:
de: Länge der Basisvektoren:

# labelSuccessiveMinima
source: Successive minima:
de: Sukzessive Minima:

# buttonMarkAsUnknown
source: Mark as unknown ->
de: Als unbekannt markieren ->

# labelKnownPlainText
source: Known plaintext:
de: Bekannter Klartext:

# labelPrimeP
source: Prime p:
de: Primzahl p:

# labelPrimeQ
source: Prime q:
de: Primzahl q:

# labelPrivateExponentD
source: Private exponent d:
de: Privater Exponent d:

# labelPublicExponentE
source: Public exponent e:
de: Öffentlicher Exponent e:

# labelResultUnknownPlainText
source: Result / Unknown plaintext:
de: Ergebnis / Unbekannter Klartext:

# labelVisualizationForDim2
source: Visualization only for dimension 2
de: Visualisierung nur für Dimension 2

source: Error
de: Fehler

# errorGeneratingSuperincSequence
source: Failed to generate superincreasing sequence.
de: Es konnte keine stark steigende Sequenz generiert werden.

# errorNoSolutionFound
source: No solution was found.
de: Es wurde keine Lösung gefunden.

# infoMarkKnownPlaintext
source: Please mark the known part of the message in the field "plaintext".
de: Bitte markieren Sie im Feld „Klartext“ den bekannten Teil der Nachricht.

source: Information
de: Hinweis

# labelCurrentBlock
source: Current block:
de: Aktueller Block:

# labelFoundVector
source: Found vector:
de: Gefundener Vektor:

# labelPlainTextBinary
source: Plaintext (binary):
de: Klartext (binär):

# labelPlainTextUTF8
source: Plaintext (UTF8):
de: Klartext (UTF8):

# labelAbort
source: Abort
de: Abbruch:

# errorMessageTooLong
source: For this attack the length of the message must be less than N!
de: Für diesen Angriff muss die Länge der Nachricht kleiner als N sein!

# errorNoTargetPoint
source: Please enter a target point.
de: Bitte geben Sie einen Zielpunkt ein.

# labelAngleBasisVectors
source: Angle between the basis vectors:
de: Winkel zwischen den Basisvektoren:

# labelAngleReducedVectors
source: Angle between the reduced vectors:
de: Winkel zwischen den reduzierten Vektoren:

# labelCodomain
source: Codomain
de: Wertebereich

# labelFrom
source: From:
de: Von:

# labelTo
source: to:
de: bis:

# errorNoCodomain
source: Please enter a valid codomain.
de: Bitte geben Sie einen gültigen Wertebereich ein.

# errorFromBiggerThanTo
source: The value of "From" must be less than the value of "To".
de: Der Wert "Von" muss kleiner sein als der Wert "Bis".

# errorCodomainTooSmall
source: The codomain is too small.
de: Der Wertebereich ist zu klein.

# errorFailedToGenerateLattice
source: The program was unable to generate a lattice. Please enlarge the codomain​​.
de: Es konnte leider kein Gitter generiert werden. Bitte vergrößern Sie den Wertebereich.

# errorSameLattice
source: This is the same lattice.
de: Das Gitter wurde noch nicht verändert.

# tooltipAdjustLatticeVectors
source: Adjust lattice vectors
de: Gittervektoren anpassen

# tooltipCopyLatticeToClipboard
source: Copy lattice to clipboard
de: Gitter in Zwischenablage kopieren

# tooltipInsertLatticeFromClipboard
source: Insert lattice from clipboard
de: Gitter aus Zwischenablage einfügen

# tooltipLoadLatticeFromFile
source: Load lattice from file
de: Gitter aus Datei laden

# tooltipMoveLattice
source: Move lattice
de: Gitter verschieben

# tooltipSaveLatticeToFile
source: Save lattice to file
de: Gitter in Datei speichern

# tooltipToggleLog
source: Toggle log
de: Log ein-/ausblenden

# tooltipZoomInLattice
source: Zoom into lattice
de: In Gitter hineinzoomen

# tooltipZoomOutLattice
source: Zoom out of lattice
de: Aus Gitter herauszoomen

source: Error loading file!
de: Fehler beim Öffnen der Datei!

source: Error parsing lattice!
de: Fehler beim Einlesen des Gitters!

source: Error saving file!
de: Fehler beim Speichern der Datei!

# labelDeterminant
source: Determinant / Volume:
de: Determinante / Volumen:

# tabFindCVP
source: Find closest vector
de: Finde nächsten Vektor

# tooltipHermiteUpperBound
source: Upper bound for minimal vector (Hermite constant)
de: Obere Schranke für minimalen Vektor (Hermite-Konstante)

# LatticeSettings
source: Lattice-based cryptography
de: Gitterbasierte Kryptografie

# labelDensity
source: Density / Rel. to optimal density:
de: Gitterdichte / Rel. zur optimalen Dichte:

# tabStart
source: Start
de: Startseite

# labelUnimodularTransformationMatrix
source: Unimodular transformation matrix
de: Unimodulare Transformationsmatrix

# errorBadLattice
source: The lattice is very poorly representable, since the lengths of the vectors differ by more than a factor of 1000.
de: Das Gitter ist sehr schlecht darstellbar, da sich die Längen der Vektoren um mehr als den Faktor 1000 unterscheiden.

# tabCryptography
source: Lattice-based cryptography
de: Gitterbasierte Verschlüsselungssysteme

# tabGGH
source: GGH
de: Goldreich–Goldwasser–Halevi (GGH)

# labelPrivateKeyR
source: Private key R
de: Privater Schlüssel R

# labelPublicKeyB
source: Public key B
de: Öffentlicher Schlüssel B

# labelErrorVector
source: Error vector e:
de: Störvektor e:

# buttonGenerateNewErrorVector
source: Generate new error vector
de: Generiere neuen Störvektor

# errorDecryptionError
source: Decryption error ({0})
de: Dechiffrierfehler ({0})

# labelRowVectors
source: Use row vectors:
de: Verwende Zeilenvektoren:

# buttonTranspose
source: Transpose
de: Transponieren

# buttonDefineNewLattice
source: Define new lattice
de: Setze neues Gitter

# labelPrivateKeyS
source: Private key s
de: Privater Schlüssel s

# labelPublicKeyA
source: Public key A
de: Öffentlicher Schlüssel A

# labelPublicKeyB2
source: Public key b
de: Öffentlicher Schlüssel b

# buttonGenerateNewRandomVector
source: Generate new random vector
de: Generiere neuen Zufallsvektor

# labelRandomVectorR
source: Random vector r:
de: Zufallsvektor r:

# labelSubsetU
source: Subset u = r * A:
de: Teilmenge u = r * A:

# labelBitwiseEncryption
source: For simplicity the encryption is bitwise.
de: Der Einfachheit halber wird immer nur ein einzelnes Bit verschlüsselt.

# tabCVP
source: Closest Vector Problem (CVP)
de: Nächster Vektor Problem (CVP)

# tabSVP
source: Shortest Vector Problem (SVP)
de: Kürzester Vektor Problem (SVP)

# labelBlockSizeL
source: Block size l:
de: Blocklänge l:

# labelEnterNotSquareLattice
source: Input as m x n matrix
de: Eingabe als m x n Matrix

# labelReductionStep
source: Reduction step ({0}/{1}):
de: Reduktionsschritt ({0}/{1}):

# tooltipSetTargetPoint
source: Set target point
de: Zielpunkt setzen

# labelClosestVector
source: Closest vector:
de: Nächster Vektor:

# labelShortestDistance
source: Shortest distance:
de: Kürzeste Entfernung:

# labelAllInfosForCurrentLattice
source: All information about the current lattice
de: Alle Informationen zum aktuellen Gitter

# labelLatticeBasisOnly
source: Lattice basis only
de: Nur die Gitterbasis

# labelPleaseChoose
source: Please choose:
de: Bitte auswählen:

# labelReducedBasisOnly
source: Reduced lattice basis only
de: Nur die reduzierte Gitterbasis

# labelSaveCurrentLattice
source: Save current lattice
de: Speichern des aktuellen Gitters

# buttonSetErrorVector
source: Set error vector e
de: Setze Störvektor e

# buttonSetPrivateKeyR
source: Set private key R
de: Setze privaten Schlüssel R

# buttonSetPublicKeyB
source: Set public key B
de: Setze öffentlichen Schlüssel B

# errorPrivateAndPublicKeyDoNotFit
source: The private key and the public key do not fit.
de: Der private und der öffentliche Schlüssel passen nicht zusammen.

# errorWrongGGHCryptosystem
source: Please enter a correct GGH-cryptosystem for dimension {0} oder generate a new one.
de: Bitte geben Sie ein korrektes GGH-Kryptosystem mit Dimension {0} ein oder lassen Sie sich ein neues generieren.

# errorCipherWrongFormat
source: The cipher has an invalid format!
de: Der Geheimtext hat ein ungültiges Format!

# errorNoCipher
source: Please enter a cipher!
de: Bitte geben Sie einen Geheimtext ein!

# errorNoMessage
source: Please enter a message you want to encrypt!
de: Bitte geben Sie eine zu verschlüsselnde Nachricht ein!

# labelEstimationR
source: Estimation for the maximum value r of a vector b with minimum length:
de: Abschätzung für Maximalwert r eines Vektors b mit minimaler Länge:

# labelMinimalVector
source: Output of the minimum vector:
de: Ausgabe des minimalen Vektors:

# buttonDefineNewCryptosystem
source: Define new cryptosystem.
de: Setze neues Kryptosystem

# buttonEnterCryptosystemManually
source: Enter cryptosystem manually
de: Manuelle Eingabe

# errorEuclidModR
source: Modulus and multiplier must be relatively prime.
de: Modulus und Multiplikator müssen teilerfremd sein.

# errorModBiggerSum
source: The modulus must be greater than the sum of all elements of the private key.
de: Der Modulus muss größer als die Summe aller Elemente des privaten Schlüssels sein.

# errorNoCryotosystemEntered
source: Please enter a new cryptosystem.
de: Bitte geben Sie ein neues Kryptosystem ein.

# errorPrivateKeyNotSuperincreasing
source: The elements of the private key must be superincreasing. Each element must be greater than the sum of its predecessors.
de: Die Elemente des privaten Schlüssels müssen stark ansteigend sein. Jedes Element muss größer als die Summe seiner Vorgänger sein.

# errorSameCryptosystem
source: This is the same cryptosystem.
de: Das Kryptosystem wurde noch nicht verändert.

# errorWrongVectorFormat
source: The entered private key has an invalid format. Please enter a correct vector.
de: Der eingegebene private Schlüssel hat ein falsches Format. Bitte geben Sie einen korrekten Vektor ein.

# titleEnterMerkleHellman
source: New Merkle-Hellman-Cryptosystem
de: Neues Merkle-Hellman-Kryptosystem

# defaultMessageGGH
source: This text is secret
de: Dieser Text ist geheim

# defaultMessageRSA
source: The new password is: 1234
de: Das neue Passwort lautet: 1234

# labelPrivateKeyR1
source: Inverse R^(-1) of the private key R
de: Inverse R^(-1) des privaten Schlüssels R

# labelPublicKeyB1
source: Inverse B^(-1) of the public key B
de: Inverse B^(-1) des öffentlichen Schlüssels B

# buttonStart
source: Start
de: Starten

# labelMode
source: Mode:
de: Modus:

# PluginCaption
source: Lattice-based cryptography
de: Gitterbasierte Kryptografie

# PluginTooltip
source: Lattice-based cryptography
de: Gitterbasierte Kryptografie

source: Content
de: Inhalt
