Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/ChaCha/Properties/Resources.*.resx
Languages: de

# ButtonLabelEnd
source: End
de: Ende

# ChaChaHashAdditionStateLabel
source: State After All Rounds + Original State
de: Anfangszustand + Zustand nach allen Runden

# ChaChaHashNavigationAdditionReverseBytesLabel
source: Addition / Reverse Bytes
de: Addition / Bytes umdrehen

# ChaChaHashNavigationKeystreamBlockLabel
source: Keystream Block
de: Schlüsselstromblock

# ChaChaHashNavigationQrLabel
source: Quarterround
de: Viertelrunde

# ChaChaHashNavigationQrLabelColumn1
source: QR(0,4,8,12)
de: VR(0,4,8,12)

# ChaChaHashNavigationQrLabelColumn2
source: QR(1,5,9,13)
de: VR(1,5,9,13)

# ChaChaHashNavigationQrLabelColumn3
source: QR(2,6,10,14)
de: VR(2,6,10,14)

# ChaChaHashNavigationQrLabelColumn4
source: QR(3,7,11,15)
de: VR(3,7,11,15)

# ChaChaHashNavigationQrLabelDiagonal1
source: QR(0,5,10,15)
de: VR(0,5,10,15)

# ChaChaHashNavigationQrLabelDiagonal2
source: QR(1,6,11,12)
de: VR(1,6,11,12)

# ChaChaHashNavigationQrLabelDiagonal3
source: QR(2,7,8,13)
de: VR(2,7,8,13)

# ChaChaHashNavigationQrLabelDiagonal4
source: QR(3,4,9,14)
de: VR(3,4,9,14)

# ChaChaHashNavigationRoundLabel
source: Round
de: Runde

# ChaChaHashOriginalStateLabel
source: Original State
de: Anfangszustand

# ChaChaHashRoundsFinalStateLabel
source: State After All Rounds
de: Zustand nach allen Runden

# ChaChaHashStateLabel
source: State Matrix
de: Zustandsmatrix

# ChaChaHashTitle
source: ChaCha Hash Function
de: ChaCha-Hashfunktion

# ChaChaStartInstructions
source: To enter the visualization, the workspace needs to be started. Press "Play" above to do this. You can then navigate through the visualization with the buttons in the top-left corner.
de: Um zu beginnen, muss die Arbeitsfläche gestartet werden. Drücke "Start" in der Leiste oben, um dies zu tun. Dann kann durch die Visualisierung navigiert werden mit den Knöpfen oben links.

# ChaChaTooltip
source: A stream cipher based on Salsa20 and used in TLS. Developed by Daniel J. Bernstein.
de: Eine Stromchiffre, die in TLS eingesetzt wird und auf Salsa20 basiert. Entwickelt von Daniel J. Bernstein.

# CounterValidationErrorMessage
source: Counter must be 64-bit in DJB Version or 32-bit in IETF version
de: Zähler muss 64-bit in der DJB-Version oder 32-bit in der IETF-Version sein

# DiffusionCounterLabel1
source: Input initial counter (hex):
de: Eingabe initialer Zähler (hex):

# DiffusionCounterLabel2
source: Second initial counter (hex):
de: Zweiter initialer Zähler (hex):

# DiffusionCounterLabel3
source: XOR of both initial counters (hex):
de: XOR der beiden Zähler (hex):

# DiffusionDescription1
source: On this page, you can enter another value for the key, IV and initial counter.
de: Auf dieser Seite kann ein zweiter Wert für Schlüssel, IV und Blockzähler eingegeben werden.

# DiffusionDescription2
source: The ChaCha cipher will also be executed with these secondary values. This is done to visualize the diffusion property of the cipher. The values received from the diffusion execution will be shown below the values received from the primary execution. The hex value which is different will be shown in red. At the right side, there is an example how this will look like.
de: Die ChaCha-Chiffre wird dann auch mit diesen Werten ausgeführt, um die Diffusionscharakteristik der Chiffre zu visualisieren. Die Werte vom zweiten Chiffrendurchlauf (mit den zweiten Werten) werden unter den Werten des ersten Durchlaufs angezeigt. Unterschiedliche Hexwerte werden rot markiert. Auf der rechten Seite ist hierfür ein Beispiel zu sehen.

# DiffusionDescription3
source: Since diffusion is all about how the input difference spreads across the keystream, you can also explicitly enter the input difference (XOR) in the third row. Using the button in the top-right corner, you will also be able to toggle between showing the intermediate values and the XOR between them on the next pages. You can try this with the example. Press the button and you will see the XOR between the two example values.
de: Da für das Studium der Diffusions-Charakteristik die Unterschiede der Werte von zwei Durchläufen interessanter sind als die tatsächlichen Werte, ist es auch möglich, explizit die Differenz (XOR) einzugeben. Mit dem Knopf in der oberen rechten Ecke ist es möglich, zwischen der XOR-Anzeige und der Anzeige beider Werte umzuschalten. Das kann im Beispiel ausprobiert werden. Drücke den Knopf und die Anzeige im Beispiel schaltet sich um.

# DiffusionDescription4
source: Additionally, during the ChaCha hash function, statistics about how many bits are flipped will be shown. A well designed cipher should have 50% of all ciphertext bits flipped if any bit in the plaintext is flipped and vice versa.
de: In der Seite über die ChaCha-Hashfunktion wird auch die Anzahl der geflippten Bits angezeigt. Eine sichere Chiffre sollte im Durchschnitt rund 50 % aller Bits im Geheimtext flippen, wenn ein Bit im Klartext geflippt wurde und vice versa.

# DiffusionExampleCaption
source: Example how diffusion values are visualized. Use the button in the top-right corner to toggle between showing only the XOR or both values.
de: Beispiel wie die Diffusion visualisiert wird. Benutze den Knopf oben rechts um zwischen XOR-Anzeige und Anzeige beider Werte umzuschalten.

# DiffusionFlippedBits
source: Flipped bits:
de: Geflippte Bits:

# DiffusionIVLabel1
source: Input initialization vector (hex):
de: Eingabe Initialisierungsvektor (hex):

# DiffusionIVLabel2
source: Second initialization vector (hex):
de: Zweiter Initialisierungsvektor (hex):

# DiffusionIVLabel3
source: XOR of both initialization vectors (hex):
de: XOR der beiden Initialisierungsvektoren (hex):

# DiffusionKeyLabel1
source: Input key (hex):
de: Eingabe Schlüssel (hex):

# DiffusionKeyLabel2
source: Second key (hex):
de: Zweiter Schlüssel (hex):

# DiffusionKeyLabel3
source: XOR of both keys (hex):
de: XOR der beiden Schlüssel (hex):

source: Diffusion state:
de: Diffusionszustand:

# InputInitialCounterCaption
source: Initial counter
de: Initialer Zähler

# InputInitialCounterTooltip
source: Initial keystream block counter. Will be incremented for each keystream block. 64-bit for DJB version. 32-bit for IETF version.
de: Initialer Block Zähler. Wird bei jedem Schlüsselstromblock inkrementiert. 64-bit in der DJB version. 32-bit in der IETF version.

# InputIVCaption
source: Initialization vector
de: Initialisierungsvektor

# InputIVTooltip
source: Initialization vector. 64-bit for DJB version. 96-bit for IETF version.
de: Initialisierungsvektor. 64-bit in der DJB version. 96-bit in der IETF version.

# InputKeyCaption
source: Key
de: Schlüssel

# InputKeyTooltip
source: Key. Can be 128-bit or 256-bit. A 128-bit key will be expanded into a 256-bit key via concatenation with itself.
de: Schlüssel. 128-bit oder 256-bit möglich. Ein 128-bit Schlüssel wird in einen 256-bit Schlüssel erweitert durch Verkettung mit sich selbst.

# InputStreamCaption
source: Plain text
de: Klartext

# InputStreamTooltip
source: Input text which should be encrypted or decrypted with ChaCha.
de: Text der ver- bzw. entschlüsselt werden soll mit ChaCha.

# InputValidationErrorMessage
source: Input must not be empty.
de: Eingabetext darf nicht leer sein.

# IVValidationErrorMessage
source: IV must be 64-bit in DJB version or 96-bit in IETF version
de: IV muss 64-bit in der DJB-Version oder 96-bit in der IETF-Version sein

# KeystreamOutputStreamCaption
source: Keystream
de: Schlüsselstrom

# KeystreamOutputStreamTooltip
source: The internally generated keystream. The output is generated via input XOR keystream.
de: Der intern generierte Schlüsselstrom. Der Ausgabetext wird durch Eingabetext XOR Schlüsselstrom generiert.

# KeyValidationErrorMessage
source: Key must be 128-bit or 256-bit
de: Schlüssel muss 128-bit oder 256-bit sein

# LogExecutionStarted
source: Execution started.
de: Ausführung gestartet.

# LogInputInvalid
source: Input invalid: {0}
de: Eingabe ungültig: {0}

# LogInputValid
source: Input valid.
de: Eingabe gültig.

# LogSettings
source: Settings: {0}
de: Einstellungen: {0}

# OutputStreamCaption
source: Cipher text
de: Geheimtext

# OutputStreamTooltip
source: Output text encrypted or decrypted with ChaCha.
de: Von ChaCha ent- bzw. verschlüsselter Text.

# OverviewConstants
source: Constants (nothing-up-my-sleeves numbers) (128-bit)
de: Konstanten (128-bit)

# OverviewIntro1
source: ChaCha is a stream cipher. It generates a pseudorandom stream of bits (keystream) and then encrypts the input message by performing a bitwise XOR operation on it with this keystream.
de: ChaCha ist eine Stromchiffre. Sie generiert einen pseudozufälligen Strom an Bits (Schlüsselstrom) und verschlüsselt den Klartext mithilfe einer bitweisen XOR-Operation mit dem Schlüsselstrom.

# OverviewIntro2
source: The keystream is created by first generating keystream blocks of 512 bits and concatenating them until the keystream size is equal or larger than the input. To generate the keystream, ChaCha uses for each keystream block a 512 bit state which consists of following four values:
de: Der Schlüsselstrom wird in Blöcken generiert. Jeder Block ist 512-bit groß. Es werden solange Blöcke generiert, bis der Schlüsselstrom größer oder gleich der Länge des Klartextes ist. ChaCha benutzt eine Hashfunktion zusammen mit einem 512-bit Zustand, der aus folgenden vier Parametern besteht:

# OverviewKey
source: Key (128-bit or 256-bit. A 128-bit key will be expanded into a 256-bit key.)
de: Schlüssel (128-bit oder 256-bit. Ein 128-bit Schlüssel wird in einen 256-bit Schlüssel umgewandelt.)

# OverviewMatrixCaption
source: State as a 4x4 matrix where each cell is 4 bytes
de: Zustand als 4x4 Matrix. Jeder Eintrag besteht aus vier Bytes.

# OverviewMatrixConstants
source: CONSTANT
de: KONSTANTE

# OverviewMatrixCounter
source: COUNTER
de: ZÄHLER

# OverviewMatrixKey
source: KEY
de: SCHLÜSSEL

# OverviewName
source: Overview
de: Übersicht

# OverviewOutro1
source: Applying the ChaCha hash function to the 512 bit state would then return a keystream block.
de: Durch Anwendung der ChaCha-Hashfunktion entsteht aus einem 512-bit Zustand ein Schlüsselstromblock.

# OverviewOutro2
source: This leads us to following steps to encrypt a message M using the ChaCha cipher:
de: Das führt uns zu folgenden Schritten, um eine Nachricht mit ChaCha zu verschlüsseln:

# OverviewOutroStep1
source: Initialize state matrix
de: Zustandsmatrix initialisieren

# OverviewOutroStep2
source: Generate keystream
de: Schlüsselstrom generieren

# OverviewOutroStep3
source: M XOR Keystream
de: Nachricht XOR Schlüsselstrom

# OverviewRemark
source: Remark: Due to XOR being the inverse function to itself, decryption works exactly the same.
de: Bemerkung: Weil XOR die inverse Operation zu sich selbst ist, verläuft das Entschlüsseln von Nachrichten gleich ab.

# OverviewTitle
source: Overview
de: Übersicht

# RoundCaption
source: Rounds
de: Runden

# RoundTooltip
source: Select how many rounds you want to use.
de: Wähle aus wieviele Runden benutzt werden sollen.

# SettingsToString
source: Rounds: {0}, Version: {1}
de: Runden: {0}, Version: {1}

# StateMatrixButtonConstants
source: Constants
de: Konstanten

# StateMatrixButtonCounter
source: Counter
de: Zähler

# StateMatrixButtonIV
source: Initialization vector
de: Initialisierungsvektor

# StateMatrixButtonKey
source: Key
de: Schlüssel

# StateMatrixDescription1
source: The 512-bit (128-byte) ChaCha state can be interpreted as a 4x4 matrix, where each entry consists of 4 bytes. The state entries consist of the parameters you can see below. They are encoded before insertion into the state matrix.
de: Der 512-bit (64-byte) ChaCha-Zustand kann als 4x4 Matrix interpretiert werden, in der jeder Eintrag aus vier Bytes besteht. Die Einträge werden aus den Parametern, die unten zu sehen sind, aufgebaut. Diese Einträge werden kodiert, bevor sie in die Matrix eingefügt werden.

# StateMatrixDescription6
source: On the next page, this initialized state matrix is passed to the ChaCha hash function to generate the first block of the keystream.
de: Auf der nächsten Seite wird dieser initialisierte Zustand der ChaCha-Hashfunktion übergeben um den ersten Schlüsselstromblock zu generieren.

# StateMatrixEncodingConstants1
source: Original value (ASCII):
de: Originaler Wert (ASCII):

# StateMatrixEncodingConstants2
source: As bytes:
de: Als Bytes:

# StateMatrixEncodingConstants3
source: Split into 4 byte chunks:
de: In 4-Byte Stücke aufteilen:

# StateMatrixEncodingConstants4
source: Reverse byte order of each chunk:
de: Bytereihenfolge von jedem Stück umkehren:

# StateMatrixEncodingConstantsHeader
source: Constants encoding
de: Konstanten-Kodierung

# StateMatrixEncodingCounter1
source: Original value:
de: Originaler Wert:

# StateMatrixEncodingCounter2
source: Reverse all bytes:
de: Bytereihenfolge umkehren:

# StateMatrixEncodingCounter3
source: Split into 4 byte chunks:
de: In 4-Byte Stücke aufteilen:

# StateMatrixEncodingCounter4
source: Reverse byte order of each chunk:
de: Bytereihenfolge von jedem Stück umkehren:

# StateMatrixEncodingCounterHeader
source: Counter encoding
de: Zähler-Kodierung

# StateMatrixEncodingIV1
source: Original value:
de: Originaler Wert:

# StateMatrixEncodingIV2
source: Split into 4 byte chunks:
de: In 4-Byte Stücke aufteilen:

# StateMatrixEncodingIV3
source: Reverse byte order of each chunk:
de: Bytereihenfolge von jedem Stück umkehren:

# StateMatrixEncodingIVHeader
source: IV encoding
de: IV-Kodierung

# StateMatrixEncodingKey1
source: Original value:
de: Originaler Wert:

# StateMatrixEncodingKey2
source: Split into 4 byte chunks:
de: In 4-Byte Stücke aufteilen:

# StateMatrixEncodingKey3
source: Reverse byte order of each chunk:
de: Bytereihenfolge von jedem Stück umkehren:

# StateMatrixEncodingKeyHeader
source: Key encoding
de: Schlüssel-Kodierung

# StateMatrixName
source: State Matrix
de: Zustandsmatrix

# StateMatrixParameterConstants
source: Constants
de: Konstanten

# StateMatrixParameterCounter
source: Initial counter
de: Initialer Blockzähler

# StateMatrixParameterHeader
source: State parameters
de: Zustandsparameter

# StateMatrixParameterIV
source: Initialization vector
de: Initialisierungsvektor

# StateMatrixParameterKey
source: Key
de: Schlüssel

# StateMatrixTitle
source: State Matrix Initialization
de: Initialisierung Zustandsmatrix

# VersionTooltip
source: Select which version you want to use. They only differ in their counter and IV size. DJB version uses a 64-bit counter and a 64-bit IV. IETF version uses a 32-bit counter and a 96-bit IV.
de: Wähle die Version aus. Die Versionen unterscheiden sich lediglich in der Größe des Zählers und Initialisierungsvektors. Die DJB Version benutzt einen 64-bit Zähler und einen 64-bit IV. Die IETF Version benutzt einen 32-bit Zähler und einen 96-bit IV.

# XorInputLabel
source: Input message:
de: Eingabetext:

# XorKeystreamLabel
source: Keystream:
de: Schlüsselstrom:

# XorOutputLabel
source: Output:
de: Ausgabetext:

# XorToggle
source: Toggle XOR
de: XOR-Anzeige
