Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DCAToyCiphers/Properties/Resources.*.resx
Languages: de, zh_cn

# BtnSwitchView
source: Switch view
de: Ansicht wechseln
zh_cn: 切换检视

source: Choice of algorithm
de: Choice of cipher
zh_cn: 算法选择

# ChoiceOfAlgorithmToolTop
source: Here you can select one of the ciphers contained in the list. It can then be examined by differential cryptanalysis.
de: Hier können Sie eine der in der Liste enthaltenen Chiffren auswählen. Diese kann dann mittels differenzieller Kryptoanalyse untersucht werden.
zh_cn: 在这里，您可以选择列表中包含的一种密码。然后可以通过差分密码分析对其进行检查。

# ChoiceOfMode
source: Encrypt/Decrypt
de: Ver-/Entschlüsseln
zh_cn: 加密/解密

# ChoiceOfModeToolTop
source: Data is encrypted or decrypted depending on the selected operating option.
de: Je nach gewählter Betriebsoption werden Daten verschlüsselt oder entschlüsselt
zh_cn: 根据所选的操作选项，对数据进行加密或解密。

# Cipher1
source: Cipher 1: 16 bit block size, 2 round keys, 32 bit key length
de: Chiffre 1: 16 bit Blockgröße, 2 Rundenschlüssel, 32 bit Schlüssellänge
zh_cn: 密码1：16位块大小，2个圆形密钥，32位密钥长度

# Cipher1LblHeading
source: Cipher 1
de: Chiffre 1
zh_cn: 密码1

# Cipher1LblInputBlock
source: Input block
de: Eingabeblock
zh_cn: 输入块

# Cipher1LblOutputBlock
source: Output block
de: Ausgabeblock
zh_cn: 输出块

# Cipher1LblText
source: This block cipher works on 16 bit blocks. One encryption round is executed using a total of two round keys. The following steps are performed in the encryption round: Key addition, substitution and key addition. The round keys are 16 bits long, the S boxes each process 4 bits. The key length is therefore 32 bits.
de: Diese Blockchiffre arbeitet auf 16 bit großen Blöcken. Es wird eine Verschlüsselungsrunde ausgeführt, wobei insgesamt zwei Rundenschlüssel verwendet werden. In der Verschlüsselungsrunde werden folgende Schritte durchgeführt: Schlüsseladdidtion, Substitution und Schlüsseladdition. Die Rundenschlüssel sind 16 bit lang, die S-Boxen verarbeiten jeweils 4 bit. Die Schlüssellänge beträgt damit 32 bit.
zh_cn: 此块密码适用于16位块。使用总共两个回合密钥执行一轮加密。在加密回合中执行以下步骤：密钥添加，替换和密钥添加。圆形密钥长16位，每个S盒处理4位。因此，密钥长度为32位。

# Cipher2
source: Cipher 2: 16 bit block size, 4 round keys, 64 bit key length
de: Chiffre 2: 16 bit Blockgröße, 4 Rundenschlüssel, 64 bit Schlüssellänge
zh_cn: 密码2：16位块大小，4个圆形密钥，64位密钥长度

# Cipher2LblHeading
source: Cipher 2
de: Chiffre 2
zh_cn: 密码2

# Cipher2LblInputBlock
source: Input block
de: Eingabeblock
zh_cn: 输入块

# Cipher2LblOutputBlock
source: Output block
de: Ausgabeblock
zh_cn: 输出块

# Cipher2LblText
source: This block cipher works on 16 bit blocks. Three encryption rounds are performed, whereby a total of four round keys are used. Two round keys are used in the last encryption round. Each round consists of three sub-steps: key addition, substitution and permutation – in the last round the permutation is omitted and the last round key is added. The round keys are 16 bits long, the S boxes each process 4 bits. The key length is thus 64 bits.
de: Diese Blockchiffre arbeitet auf 16 bit großen Blöcken. Es werden drei Verschlüsselungsrunden durchgeführt, wobei insgesamt vier Rundenschlüssel verwendet werden. In der letzten Verschlüsselungsrunde werden zwei Rundenschlüssel angewandt. Jede Runde besteht aus drei Teilschritten: Schlüsseladdition, Substitution und Permutation – in der letzten Runde entfällt die Permutation und es wird der letzte Rundenschlüssel addiert. Die Rundenschlüssel sind 16 bit lang, die S-Boxen verarbeiten jeweils 4 bit. Die Schlüssellänge beträgt damit 64 bit.
zh_cn: 此块密码适用于16位块。执行三个加密回合，从而总共使用四个回合密钥。在上一轮加密中使用了两个回合密钥。每个回合包含三个子步骤：密钥添加，替换和置换–在最后一轮中，省略置换，并添加最后一轮密钥。圆形密钥长16位，每个S盒处理4位。因此，密钥长度为64位。

# Cipher3
source: Cipher 3: 16 bit block size, 6 round keys, 96 bit key length
de: Chiffre 3: 16 bit Blockgröße, 6 Rundenschlüssel, 96 bit Schlüssellänge
zh_cn: 密码3：16位块大小，6个圆形密钥，96位密钥长度

# Cipher3LblHeading
source: Cipher 3
de: Chiffre 3
zh_cn: 密码3

# Cipher3LblInputBlock
source: Input block
de: Eingabeblock
zh_cn: 输入块

# Cipher3LblOutputBlock
source: Output block
de: Ausgabeblock
zh_cn: 输出块

# Cipher3LblText
source: This block cipher works on 16 bit blocks. 5 encryption rounds are performed, whereby a total of six round keys are used. In the last encryption round two round keys are used. Each round consists of three sub-steps: key addition, substitution and permutation – in the last round the permutation unfolds and the last round key is added. The round keys are 16 bits long, the S boxes each process 4 bits. The key length is thus 96 bits.
de: Diese Blockchiffre arbeitet auf 16 bit großen Blöcken. Es werden 5 Verschlüsselungsrunden durchgeführt, wobei insgesamt sechs Rundenschlüssel verwendet werden. In der letzten Verschlüsselungsrunde werden zwei Rundenschlüssel angewandt. Jede Runde besteht aus drei Teilschritten: Schlüsseladdition, Substitution und Permutation – in der letzten Runde entfält die Permutation und es wird der letzte Rundenschlüssel addiert. Die Rundenschlüssel sind 16 bit lang, die S-Boxen verarbeiten jeweils 4 bit. Die Schlüssellänge beträgt damit 96 bit.
zh_cn: 此块密码适用于16位块。执行5次加密回合，总共使用六个回合密钥。在最后的加密回合中，使用了两个回合密钥。每个回合包含三个子步骤：密钥添加，替换和置换–在最后一轮中，置换展开并添加最后一轮密钥。圆形密钥长16位，每个S盒处理4位。因此，密钥长度为96位。

# Cipher4
source: Cipher 4: 4 bit block size , 4 round keys, 16 bit key length
de: Chiffre 4: 4 bit Blockgröße , 4 Rundenschlüssel, 16 bit Schlüssellänge
zh_cn: 密码4：4位块大小，4个圆形密钥，16位密钥长度

# Cipher4LblHeading
source: Cipher 4
de: Chiffre 4
zh_cn: 密码4

# Cipher4LblInputBlock
source: Input block
de: Eingabeblock
zh_cn: 输入块

# Cipher4LblOutputBlock
source: Output block
de: Ausgabeblock
zh_cn: 输出块

# Cipher4LblText
source: This block cipher works on 4 bit blocks. Three encryption rounds are performed, whereby a total of four round keys are used. Two round keys are used in the last encryption round. Each round consists of two sub-steps: key addition and substitution. In the last round, the last round key is then added. The lap keys are 4 bits long and the S boxes each work on 4 bits. The key length is thus 16 bits.
de: Diese Blockchiffre arbeitet auf 4 bit großen Blöcken. Es werden drei Verschlüsselungsrunden durchgeführt, wobei insgesamt vier Rundenschlüssel verwendet werden. In der letzten Verschlüsselungsrunde werden zwei Rundenschlüssel angewandt. Jede Runde besteht aus zwei Teilschritten: Schlüsseladdition und Substitution. In der letzten Runde wird anschließend der letzte Rundenschlüssel noch addiert. Die Rundenschlüssel sind 4 bit lang und die S-Boxen arbeiten auf jeweils 4 bit. Die Schlüssellänge beträgt damit 16 bit.
zh_cn: 此块密码适用于4位块。执行三个加密回合，从而总共使用四个回合密钥。在上一轮加密中使用了两个回合密钥。每个回合包含两个子步骤：密钥添加和替换。在最后一轮中，然后添加了最后一轮密钥。 lap键的长度为4位，S盒的每个键为4位。因此，密钥长度为16位。

# CipherDetails
source: Details
zh_cn: 细节

# CipherView
source: Cipher
de: Chiffre
zh_cn: 密码

# DescPermutation
source: The permutation swaps the fixed position i of an input bit to a position j in the output. The following table describes the permutation, with the first row representing the position of a bit in the input and the second row representing the position of the corresponding bit in the output.
de: Die Permutation vertauscht die feste Position i eines Eingabebits auf eine Position j in der Ausgabe. Die folgende Tabelle beschreibt die Permutation, wobei die erste Zeile die Position eines Bits in der Eingabe darstellt und die zweite Zeile die Position des entsprechenden Bits in der Ausgabe.
zh_cn: 排列将输入位的固定位置i交换为输出中的位置j。下表描述了排列，第一行代表输入中某个位的位置，第二行代表输出中相应位的位置。

# DescSBox
source: The S box substitutes fixed input bits for other output bits. The following table describes the SBox, where the first line represents the value of the input bits and the second line represents the output bits.
de: Die S-Box substituiert feste Eingabebits auf andere Ausgabebits. Die folgende Tabelle beschreibt die S-Box, wobei die erste Zeile den Wert der Eingabebits und die zweite Zeile die Ausgabebits darstellt.
zh_cn: S盒将固定输入位替换为其他输出位。下表描述了SBox，其中第一行代表输入位的值，第二行代表输出位。

# HeaderPermutation
source: Table of permutation:
de: Tabelle der Permutation:
zh_cn: 排列表：

# HeaderSBox
source: Table of S box:
de: Tabelle der S-Box:
zh_cn: S盒表：

source: Input
de: Eingabe
zh_cn: 输入值

# KeyError
source: The specified key is not long enough. Please check the requirements of this cipher.
de: Der angegebene Schlüssel ist nicht lang genug. Bitte überprüfen Sie die Anforderungen dieser Chiffre.
zh_cn: 指定的密钥不够长。请检查此密码的要求。

# KeyInput
source: Key
de: Schlüssel
zh_cn: 键

# KeyInputTooltip
source: Input for the key
de: Eingang für den Schlüssel
zh_cn: 按键输入

# MessageError
source: The messages entered are too small or too large. Please check the requirements of this cipher.
de: Die eingegebenen Nachrichten sind zu klein oder zu groß. Bitte überprüfen Sie die Anforderungen dieser Chiffre.
zh_cn: 输入的消息太小或太大。请检查此密码的要求。

# MessageInput
source: Plaintext / Ciphertext
de: Klartext / Geheimtext
zh_cn: 纯文本/密文

# MessageInputTooltip
source: Eingang für den Klartext / Geheimtext (je nach gewähltem Betriebsmodus)
zh_cn: 输入纯文本/密文（取决于所选的操作模式）

# MessageOutput
source: Plaintext / Ciphertext
de: Klartext / Geheimtext
zh_cn: 纯文本/密文

# MessageOutputTooltip
source: Input for plain text / ciphertext (depending on selected operating mode)
de: Ausgang für den Klartext / Geheimtext (je nach gewähltem Betriebsmodus)
zh_cn: 输入纯文本/密文（取决于所选的操作模式）

# Mode1
source: Encrypt
de: Verschlüsseln
zh_cn: 加密

# Mode2
source: Decrypt
de: Entschlüsseln
zh_cn: 解密

# OperatingOptions
source: Modes of operation
de: Betriebsoptionen
zh_cn: 操作方式

source: Output
de: Ausgabe
zh_cn: 输出量

# PluginCaption
source: DCA ToyCipher
de: DKA-ToyCipher
zh_cn: DCA玩具密码

# PluginTooltip
source: This component contains several symmetric block ciphers for encryption. The ciphers are very simple and short to demonstrate cryptographic principles or cryptoanalytic methods.
de: Diese Komponente enthält verschiedene symmetrische Blockchiffren zur Verschlüsselung. Die Chiffren sind sehr einfach und kurz, um an ihnen kryptografische Prinzipien oder kryptoanalytische Verfahren demonstrieren zu können.
zh_cn: 该组件包含用于加密的多个对称块密码。密码非常简单且简短，无法证明密码原理或密码分析方法。

# TablePermutationInput
source: Position in input
de: Position in Eingabe
zh_cn: 输入中的位置

# TablePermutationOutput
source: Position in output
de: Position in Ausgabe
zh_cn: 输出位置
