Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Transposition/Properties/Resources.*.resx
Languages: ru, zh_cn

# PluginCaption
source: Transposition
ru: перестановка
zh_cn: 换位

# PluginTooltip
source: Transposition cipher
ru: Транзитный шифр
zh_cn: 换位密码

# InputCaption
source: Input
ru: вход
zh_cn: 输入值

# InputTooltip
source: Text to be encrypted.
ru: Текст для шифрования.
zh_cn: 要加密的文本。

# KeywordCaption
source: Keyword
ru: Ключевое слово
zh_cn: 关键词

# KeywordTooltip
source: Keyword used for encryption
ru: Ключевое слово, используемое для шифрования
zh_cn: 用于加密的关键字

# OutputCaption
source: Output
ru: Вывод
zh_cn: 输出量

# OutputTooltip
source: Output
ru: Вывод
zh_cn: 输出量

# ControlSlaveCaption
source: Transposition Slave
ru: Транзитное подчинение
zh_cn: 换位从属

# ControlSlaveTooltip
source: Transposition Slave
ru: Транзитное подчинение
zh_cn: 换位从属

# ActionCaption
source: Action
ru: действие
zh_cn: 行动

# ActionTooltip
source: Select the Algorithm action
ru: Выберите действие «Алгоритм»
zh_cn: 选择算法动作

# NumberCaption
source: Number representation mode
ru: Режим представления чисел
zh_cn: 数字表示方式

# NumberTooltip
source: Select a mode of representation
ru: Выберите режим представления
zh_cn: 选择代表方式

# PermutationCaption
source: Permutation
ru: перестановка
zh_cn: 排列

# PermutationTooltip
source: Select permutation type
ru: Выберите тип перестановки
zh_cn: 选择排列类型

# PresentationSpeedCaption
source: Presentation speed
ru: Скорость передачи данных
zh_cn: 演示速度

# PresentationSpeedTooltip
source: Change the pace of the presentation
ru: Изменение темпа презентации
zh_cn: 改变演讲的节奏

# ReadInCaption
source: Read in
ru: Читайте в
zh_cn: 读入

# ReadInTooltip
source: Select read in mode
ru: Выберите режим чтения
zh_cn: 选择读入模式

# ReadOutCaption
source: Read out
ru: Зачитать
zh_cn: 读出

# ReadOutTooltip
source: Select read out type
ru: Выберите тип считывания
zh_cn: 选择读出类型

# ActionList1
source: Encrypt
ru: шифровать
zh_cn: 加密

# ActionList2
source: Decrypt
ru: расшифровывать
zh_cn: 解密

# NumberList1
source: Character
ru: символ
zh_cn: 字符

# NumberList2
source: Character-Code
ru: Характер-код
zh_cn: 字符代码

# PermutationList1
source: by row
ru: по ряду
zh_cn: 按行

# PermutationList2
source: by column
ru: по столбцам
zh_cn: 按列

# ReadInList1
source: by row
ru: по ряду
zh_cn: 按行

# ReadInList2
source: by column
ru: по столбцам
zh_cn: 按列

# ReadOutList1
source: by row
ru: по ряду
zh_cn: 按行

# ReadOutList2
source: by column
ru: по столбцам
zh_cn: 按列

source: Presentation
ru: презентация
zh_cn: 介绍

source: accomplished
ru: осуществляется
zh_cn: 完成的

source: permuting by column
ru: перестановка по столбцу
zh_cn: 按列排列

source: permuting by row
ru: перестановка по строке
zh_cn: 按行排列

source: reading in by column
ru: чтение в столбце
zh_cn: 按栏阅读

source: reading in by row
ru: чтение в строке
zh_cn: 逐行阅读

source: reading out by column
ru: чтение по столбцу
zh_cn: 按列读出

source: reading out by row
ru: чтение по строке
zh_cn: 逐行阅读

# PresentationGroup
source: Presentation
ru: презентация
zh_cn: 介绍

# ModeList1
source: by byte
ru: байт
zh_cn: 按字节

# ModeList2
source: by character
ru: по характеру
zh_cn: 按字符

# NumberModeCaption
source: Type of processing
ru: Тип обработки
zh_cn: 处理类型
