Repository: CrypToolProject/CrypTool-2
Catalog: CrypPluginsExperimental/Sigaba/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# ActionCaption
source: Action
de: Betriebsart
ru: действие
zh_cn: 行动

# ActionList1
source: Encrypt
de: Verschlüsseln
ru: шифровать
zh_cn: 加密

# ActionList2
source: Decrypt
de: Entschlüsseln
ru: расшифровывать
zh_cn: 解密

# ActionTooltip
source: Choose the mode of operation
de: Wählen Sie die Betriebsart der Sigaba.
ru: Выберите режим работы
zh_cn: 选择操作方式

# CaseHandlingCaption
source: Case handling
de: Groß-/Kleinschreibung
ru: Обработка корпуса
zh_cn: 案件处理

# CaseHandlingList1
source: Preserve case
de: keine Änderung
ru: Запасной корпус
zh_cn: 保留大小写

# CaseHandlingList2
source: Convert to upper
de: in Großbuchstaben konvertieren
ru: Преобразовать в верхнюю
zh_cn: 转换为上

# CaseHandlingList3
source: Convert to lower
de: in Kleinbuchstaben konvertieren
ru: Преобразовать в нижний
zh_cn: 转换为较低

# CaseHandlingTooltip
source: What should be done with upper and lower case letters?
de: Wie sollen Groß- und Kleinbuchstaben behandelt werden?
ru: Что нужно делать с помощью строчных и строчных букв?
zh_cn: 大写和小写字母应该怎么做？

# CipherGroup
source: Alphabet maze
de: Chiffrierrotoren
ru: Лабиринт лабиринта
zh_cn: 字母迷宫

# CipherKeyCaption
source: Cipher key
de: Chiffrierschlüssel
ru: Ключ шифрования
zh_cn: 密码键

# CipherKeyTooltip
source: Defines the starting positions of the cipher rotors
de: Definiert die Startpositionen der Chiffrierrotoren
ru: Определяет начальные положения роторов шифрования
zh_cn: 定义密码转子的起始位置

# CipherRotor1Caption
source: Cipher wheel 1 (most left)
de: Chiffrierrotor 1 (links)
ru: Шифр 1 (самый левый)
zh_cn: 密码轮1（最左侧）

# CipherRotor1Tooltip
source: Defines the type of the first cipher rotor
de: Definiert den Typ des ersten Chiffrierrotors
ru: Определяет тип первого ротора шифрования
zh_cn: 定义第一个密码转子的类型

# CipherRotor2Caption
source: Cipher wheel 2
de: Chiffrierrotor 2
ru: Шифр 2
zh_cn: 密码轮2

# CipherRotor2Tooltip
source: Defines the type of the second cipher rotor
de: Definiert den Typ des zweiten Chiffrierrotors
ru: Определяет тип второго ротора шифрования
zh_cn: 定义第二个密码转子的类型

# CipherRotor3Caption
source: Cipher wheel 3
de: Chiffrierrotor 3
ru: Шифр 3
zh_cn: 密码轮3

# CipherRotor3Tooltip
source: Defines the type of the third cipher rotor
de: Definiert den Typ des dritten Chiffrierrotors
ru: Определяет тип третьего ротора шифрования
zh_cn: 定义第三个密码转子的类型

# CipherRotor4Caption
source: Cipher wheel 4
de: Chiffrierrotor 4
ru: Шифр 4
zh_cn: 密码轮4

# CipherRotor4Tooltip
source: Defines the type of the fourth cipher rotor
de: Definiert den Typ des vierten Chiffrierrotors
ru: Определяет тип четвертого ротора шифрования
zh_cn: 定义第四个密码转子的类型

# CipherRotor5Caption
source: Cipher wheel 5 (most right)
de: Chiffrierrotor 5 (rechts)
ru: Шифр 5 (самый правый)
zh_cn: 密码轮5（最右侧）

# CipherRotor5Tooltip
source: Defines the type of the fifth cipher rotor
de: Definiert den Typ des fünften Chiffrierrotors
ru: Определяет тип пятого ротора шифрования
zh_cn: 定义第五个密码转子的类型

# ControlGroup
source: Stepping maze
de: Kontrollrotoren
ru: Шаговый лабиринт
zh_cn: 迷宫

# ControlKeyCaption
source: Control key
de: Kontrollschlüssel
ru: Клавиша управления
zh_cn: 控制键

# ControlKeyTooltip
source: Defines the starting positions of the control rotors
de: Definiert die Startpositionen der Kontrollrotoren
ru: Определяет начальные положения управляющих роторов
zh_cn: 定义控制转子的起始位置

# ControlRotor1Caption
source: Control wheel 1 (most right)
de: Kontrollrotor 1 (rechts)
ru: Управляющее колесо 1 (самое правое)
zh_cn: 控制轮1（最右侧）

# ControlRotor1Tooltip
source: Defines the type of the first control wheel
de: Definiert den Typ des ersten Kontrollrotors
ru: Определяет тип первого управляющего колеса
zh_cn: 定义第一个控制轮的类型

# ControlRotor2Caption
source: Control wheel 2
de: Kontrollrotor 2
ru: Управляющее колесо 2
zh_cn: 控制轮2

# ControlRotor2Tooltip
source: Defines the type of the second control wheel
de: Definiert den Typ des zweiten Kontrollrotors
ru: Определяет тип второго управляющего колеса
zh_cn: 定义第二个控制轮的类型

# ControlRotor3Caption
source: Control wheel 3
de: Kontrollrotor 3
ru: Управляющее колесо 3
zh_cn: 控制轮3

# ControlRotor3Tooltip
source: Defines the type of the third control wheel
de: Definiert den Typ des dritten Kontrollrotors
ru: Определяет тип третьего управляющего колеса
zh_cn: 定义第三个控制轮的类型

# ControlRotor4Caption
source: Control wheel 4
de: Kontrollrotor 4
ru: Управляющее колесо 4
zh_cn: 控制轮4

# ControlRotor4Tooltip
source: Defines the type of the fourth control wheel
de: Definiert den Typ des vierten Kontrollrotors
ru: Определяет тип четвертого управляющего колеса
zh_cn: 定义第四个控制轮的类型

# ControlRotor5Caption
source: Control wheel 5 (most left)
de: Kontrollrotor 5 (linker Rotor)
ru: Управляющее колесо 5 (большинство слева)
zh_cn: 控制轮5（最左侧）

# ControlRotor5Tooltip
source: Defines the type of the fifth control wheel
de: Definiert den Typ des fünften Kontrollrotors
ru: Определяет тип пятого управляющего колеса
zh_cn: 定义第五个控制轮的类型

# IndexGroup
source: Index maze
de: Indexrotoren
ru: Лабиринт индекса
zh_cn: 索引迷宫

# IndexKeyCaption
source: Index key
de: Indexschlüssel
ru: Ключ индекса
zh_cn: 索引键

# IndexKeyTooltip
source: Defines the starting positions of the index wheels
de: Definiert die Startpositionen der Indexrotoren
ru: Определяет начальные позиции индексных колес
zh_cn: 定义索引轮的起始位置

# IndexRotor1Caption
source: Index wheel 1 (most left)
de: Indexrotor 1 (linker Rotor)
ru: Индексированное колесо 1 (большинство слева)
zh_cn: 索引轮1（最左侧）

# IndexRotor1Tooltip
source: Defines the type of the first index wheel
de: Definiert den Typ des ersten Indexrotors
ru: Определяет тип первого индексного колеса
zh_cn: 定义第一个分度盘的类型

# IndexRotor2Caption
source: Index wheel 2
de: Indexrotor 2
ru: Индексный диск 2
zh_cn: 索引轮2

# IndexRotor2Tooltip
source: Defines the type of the second index wheel
de: Definiert den Typ des zweiten Indexrotors
ru: Определяет тип второго индексного колеса
zh_cn: 定义第二个分度盘的类型

# IndexRotor3Caption
source: Index wheel 3
de: Indexrotor 3
ru: Индексное колесо 3
zh_cn: 索引轮3

# IndexRotor3Tooltip
source: Defines the type of the third index wheel
de: Definiert den Typ des dritten Indexrotors
ru: Определяет тип третьего индексного колеса
zh_cn: 定义第三个分度盘的类型

# IndexRotor4Caption
source: Index wheel 4
de: Indexrotor 4
ru: Указательное колесо 4
zh_cn: 索引轮4

# IndexRotor4Tooltip
source: Defines the type of the fourth index wheel
de: Definiert den Typ des vierten Indexrotors
ru: Определяет тип четвертого колесика индекса
zh_cn: 定义第四个分度盘的类型

# IndexRotor5Caption
source: Index wheel 5 (most right)
de: Indexrotor 5 (rechter Rotor)
ru: Указательное колесо 5 (самое правое)
zh_cn: 索引轮5（最右边）

# IndexRotor5Tooltip
source: Defines the type of the fifth index wheel
de: Definiert den Typ des fünften Indexrotors
ru: Определяет тип пятого колесика индекса
zh_cn: 定义第五个分度盘的类型

# PluginCaption
source: Sigaba
ru: раздел
zh_cn: 部分

# PluginToolTip
source: American rotor cipher machine
de: Amerikanische Rotorverschlüsselungsmaschine
ru: Американский роторный шифратор
zh_cn: 美国转子密码机

# PositionOptionsGroup
source: Rotor start positions
de: Rotor-Startpositionen
ru: Позиции запуска ротора
zh_cn: 转子起始位置

# PresentationGroup
source: Presentation
de: Präsentation
ru: презентация
zh_cn: 介绍

# PresentationSpeedCaption
source: Speed
de: Geschwindigkeit
ru: скорость
zh_cn: 速度

# PresentationSpeedTooltip
source: Adjust the speed of the presentation animations
de: Stellen Sie hier die Geschwindigkeit der Präsentationsanimation ein.
ru: Отрегулируйте скорость анимации презентации
zh_cn: 调整演示动画的速度

# RotorA1
source: Code wheel 01
de: Codierrotor 01
ru: Кодовое колесо 01
zh_cn: 码盘01

# RotorA10
source: Code wheel 10
de: Codierrotor 10
ru: Кодовое колесо 10
zh_cn: 码盘10

# RotorA2
source: Code wheel 02
de: Codierrotor 02
ru: Кодовое колесо 02
zh_cn: 码盘02

# RotorA3
source: Code wheel 03
de: Codierrotor 03
ru: Колесо диска 03
zh_cn: 码盘03

# RotorA4
source: Code wheel 04
de: Codierrotor 04
ru: Кодовое колесо 04
zh_cn: 码盘04

# RotorA5
source: Code wheel 05
de: Codierrotor 05
ru: Кодовое колесо 05
zh_cn: 码盘05

# RotorA6
source: Code wheel 06
de: Codierrotor 06
ru: Кодовое колесо 06
zh_cn: 码盘06

# RotorA7
source: Code wheel 07
de: Codierrotor 07
ru: Кодовое колесо 07
zh_cn: 码盘07

# RotorA8
source: Code wheel 08
de: Codierrotor 08
ru: Кодовое колесо 08
zh_cn: 码盘08

# RotorA9
source: Code wheel 09
de: Codierrotor 09
ru: Кодовое колесо 09
zh_cn: 码盘09

# RotorB1
source: Index wheel 10
de: Indexrotor 10
ru: Индексное колесо 10
zh_cn: 索引轮10

# RotorB2
source: Index wheel 20
de: Indexrotor 20
ru: Индексное колесо 20
zh_cn: 索引轮20

# RotorB3
source: Index wheel 30
de: Indexrotor 30
ru: Индексное колесо 30
zh_cn: 索引轮30

# RotorB4
source: Index wheel 40
de: Indexrotor 40
ru: Указательное колесо 40
zh_cn: 索引轮40

# RotorB5
source: Index wheel 50
de: Indexrotor 50
ru: Индексное колесо 50
zh_cn: 索引轮50

# RotorReverseCaption
source: Reverse
de: Umdrehen
ru: Задний ход
zh_cn: 逆转

# RotorReverseTooltip
source: Activate the checkbox to revert this rotor.
de: Aktivieren Sie dieses Kontrollkästchen, um den Rotor umzudrehen.
ru: Установите флажок, чтобы вернуть этот ротор.
zh_cn: 激活复选框以还原该转子。

# TestRotor
source: Test wheel
de: Testrotor
ru: Контрольное колесо
zh_cn: 测试轮

# TextOptionsGroup
source: Text options
de: Textoptionen
ru: Параметры текста
zh_cn: 文字选项

# TypeCaption
source: Machine type
de: Maschinentyp
ru: Тип аппарата
zh_cn: 机型

# TypeTooltip
source: Choose the type of the Sigaba
de: Wählen Sie den Typ der Sigaba-Maschine.
ru: Выберите тип Sigaba
zh_cn: 选择Sigaba的类型

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Behandlung ungültiger Zeichen
ru: Неизвестная обработка символов
zh_cn: 未知符号处理

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (nicht ändern)
ru: Игнорировать (оставить без изменений)
zh_cn: 忽略（保留未修改的内容）

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen
ru: Удалить
zh_cn: 去掉

# UnknownSymbolHandlingList3
source: Replace with 'X'
de: Ersetzen durch 'X'
ru: Заменить на «X»
zh_cn: 替换为“ X”

# UnknownSymbolHandlingTooltip
source: What should be done with input characters that are not in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
ru: Что делать с входными символами, которые не находятся в алфавите?
zh_cn: 字母以外的输入字符应该怎么办？
