Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/FileOutput/Properties/Resources.*.resx
Languages: ru

# PluginCaption
source: File Output
ru: Выход файла

# PluginTooltip
source: File based output
ru: Выход на основе файлов

# StreamInputCaption
source: Stream Input
ru: Поток ввода

# StreamInputTooltip
source: Display the input file in HexEditor.
ru: Отобразите входной файл в HexEditor.

# ClearFileNameCaption
source: Clear file name
ru: Очистить имя файла

# ClearFileNameTooltip
source: Forget the output file name
ru: Забудьте имя выходного файла

# TargetFilenameCaption
source: Target file name
ru: Название целевого файла

# TargetFilenameTooltip
source: File to write data into.
ru: Файл для записи данных.

source: About
ru: Около

source: Cancel
ru: Отмена

source: Close
ru: Закрыть

source: Copy
ru: копия

source: Cut
ru: Порез

source: Edit
ru: редактировать

source: File
ru: файл

source: Find
ru: найти

source: Find:
ru: Найти:

source: Find next
ru: Найти следующее

source: Help
ru: Помогите

# If_you_want_to_copy
source: If you want to copy the input stream to a specific file, please select a target. If you do not select a target, the input stream will just be displayed. (To open a file please use the FileInput Plugin.)
ru: Если вы хотите скопировать входной поток в определенный файл, выберите цель. Если вы не выбрали цель, входной поток будет отображаться только. (Чтобы открыть файл, используйте FileInput Plugin.)

source: Paste
ru: Вставить

source: Save
ru: Сохранить

source: Search
ru: Поиск

source: Search Progress
ru: Поиск прогресса

source: Target file name:
ru: Название целевого файла:

# AppendCaption
source: Append text input
ru: Добавить текстовый ввод

# AppendTooltip
source: With this checkbox enabled, incoming text will be appended to the current text.
ru: Если этот флажок включен, входящий текст будет добавлен к текущему тексту.

# AppendBreaksCaption
source: Append n-breaks
ru: Добавить n-breaks

# AppendBreaksTooltip
source: Defines how many new lines are added after new input. (Applies only if "Append text input" is active.)
ru: Определяет количество новых строк после ввода новых данных. (Применяется только в том случае, если активен «Добавить текстовый ввод»).

# AppendGroup
source: Append
ru: присоединять
