Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/TranspositionAnalyser/Properties/Resources.*.resx
Languages: de

# PluginCaption
source: Transposition Analyzer
de: Transpositions-Analyse

# PluginTooltip
source: Performs several kinds of attacks against the columnar transposition
de: Führt verschiedene Angriffe auf die spaltenweise Transposition durch

# InputCaption
source: Ciphertext
de: Geheimtext

# InputTooltip
source: Enter the ciphertext that is to be analyzed.
de: Eingabe des zu untersuchenden Geheimtextes.

# CribTooltip
source: Enter the crib for Crib Analysis
de: Geben Sie den Crib für die Crib-Analyse ein.

# CostMasterCaption
source: Cost Master
de: Kostenberechnung (Master)

# CostMasterTooltip
source: Used for cost calculation
de: Steuerung der Kostenberechnung

# OutputCaption
source: Plaintext
de: Klartext

# OutputTooltip
source: Output of the best plaintext candidate
de: Ausgabe des besten Klartext-Kandidaten

# Analysis_methodCaption
source: Analysis method
de: Analysemethode

# Analysis_methodTooltip
source: Select the analysis method
de: Wählen Sie die Analysemethode.

# ColumnColumnColumnCaption
source: C-C-C
de: S-S-S

# ColumnColumnColumnTooltip
source: Bruteforce this transposition settings: Read in by column. Permute by column. Read out by column
de: Transposition: spaltenweise einlesen, spaltenweise permutieren, spaltenweise auslesen

# ColumnColumnRowCaption
source: C-C-R
de: S-S-Z

# ColumnColumnRowTooltip
source: Bruteforce this transposition settings: Read in by column. Permute by column. Read out by Row
de: Transposition: spaltenweise einlesen, spaltenweise permutieren, zeilenweise auslesen

# CribSearchKeylengthCaption
source: Maximum keylength for crib analysis
de: Maximale Schlüssellänge

# CribSearchKeylengthTooltip
source: Enter the maximum keylength for the crib-based analysis.
de: Bitte die maximale Schlüssellänge für die Crib-Analyse eingeben.

# IterationsCaption
source: Iterations
de: Iterationen

# IterationsTooltip
source: Enter the number of iterations the algorithm should perform for one random start value.
de: Geben Sie an, wie viele Iterationen der Algorithmus für einen zufälligen Startwert durchführen soll.

# KeySizeCaption
source: Keylength
de: Schlüsselgröße

# KeySizeTooltip
source: Enter the keylength to be searched.
de: Geben Sie die Länge des zu suchenden Schlüssels an.

# MaxLengthCaption
source: Max length of keyword
de: Maximale Schlüssellänge

# MaxLengthTooltip
source: Enter the maximum length to be analyzed
de: Geben Sie die maximale Länge für Analyse an.

# RepeatingsCaption
source: Repetitions
de: Wiederholungen

# RepeatingsTooltip
source: Enter the number of times the algorithm should be restarted with a new random start value.
de: Geben Sie an, wie oft der Algorithmus mit einem neuen, zufälligen Startwert wiederholt werden soll.

# RowColumnColumnCaption
source: R-C-C
de: Z-S-S

# RowColumnColumnTooltip
source: Bruteforce this transposition settings: Read in by row. Permute by column. Read out by Column
de: Transposition: zeilenweise einlesen, spaltenweise permutieren, spaltenweise auslesen

# RowColumnRowCaption
source: R-C-R
de: Z-S-Z

# RowColumnRowTooltip
source: Bruteforce this transposition settings: Read in by row. Permute by column. Read out by Row
de: Transposition: zeilenweise einlesen, spaltenweise permutieren, zeilenweise auslesen

# Analysis_methodList1
source: Bruteforce Analysis
de: Brute-Force-Analyse

# Analysis_methodList2
source: Analysis with Crib
de: Crib-Analyse

# Analysis_methodList3
source: Genetic algorithm
de: Genetischer Algorithmus

# ElapsedLabel
source: Elapsed:
de: Vergangen:

# EndLabel
source: End:
de: Ende:

# KeyHeader
source: Key
de: Schlüssel

# Keys_secLabel
source: Keys / sec:
de: Schlüssel / sec:

# LocalLabel
source: Local
de: Lokal

# RemainingLabel
source: Remaining:
de: Verbleibend:

# StartLabel
source: Start:
de: Beginn:

# ValueHeader
source: Value
de: Wert

# Copy_all
source: Copy all lines
de: Kopiere alle Zeilen

source: Copy key
de: Kopiere Schlüssel

source: Copy text
de: Kopiere Text

source: Copy value
de: Kopiere Wert

# Copy_line
source: Copy selected line
de: Kopiere ganze Zeile

# CharacterForColumn
source: C
de: S

# CharacterForRow
source: R
de: Z

# ModeHeader
source: Mode
de: Modus

# Analysis_methodList5
source: Dictionary Attack
de: Wörterbuchangriff

# CaseSensitiveCaption
source: Case sensitive
de: Beachte Klein-/Großschreibung

# CaseSensitiveTooltip
source: Dictionary attack is case sensitive
de: Wörterbuchangriff beachtet Klein-/Großschreibung

# DictionaryCaption
source: Dictionary
de: Wörterbuch

# DictionaryTooltip
source: Dictionary for the dictionary analysis
de: Wörterbuch für den Wörterbuchangriff

# MinLengthCaption
source: Min length of keyword
de: Minimale Schlüssellänge

# MinLengthTooltip
source: Enter the minimum length to be analyzed
de: Geben Sie die minimale Länge für Analyse an.

# CurrentlyAnalyzedKeylengthLabel
source: Currently analyzed keylength:
de: Aktuell analysierte Schlüssellänge:

# KeyLengthHeader
source: Key Length
de: Schlüssellänge
