Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/PRESENT/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: PRESENT
ru: НАСТОЯЩЕЕ ВРЕМЯ
zh_cn: 当下

# PluginTooltip
source: PRESENT is an ultra-lightweight block cipher
de: PRESENT ist eine ultra-leichtgewichtige Blockchiffre
ru: PRESENT - сверхлегкий блочный шифр
zh_cn: PRESENT是一种超轻量级分组密码

# InputStreamCaption
source: Input
de: Eingabedatenstrom
ru: вход
zh_cn: 输入值

# InputStreamTooltip
source: Data to be encrypted or decrypted.
de: zu ver-/entschlüsselnde Daten
ru: Данные должны быть зашифрованы или дешифрованы.
zh_cn: 要加密或解密的数据。

# InputKeyCaption
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# InputKeyTooltip
source: Must be 10 or 16 byte.
de: Der Schlüssel muss 10 oder 16 Bytes lang sein.
ru: Должно быть 10 или 16 байт.
zh_cn: 必须为10或16个字节。

# InputIVCaption
source: Initialization vector
de: Initialisierungsvektor
ru: Вектор инициализации
zh_cn: 初始化向量

# InputIVTooltip
source: IV to be used in chaining modes (CBC,CFB,OFB). It must be the same size as the block length (8 bytes).
de: Der Initialisierungsvektor (IV) für die Blockverschlüsselungs-Modi (CBC,CFB,OFB). Er muss gleich groß wie die Blockgröße sein (8 Bytes).
ru: IV для использования в цепных режимах (CBC, CFB, OFB). Он должен быть того же размера, что и длина блока (8 байтов).
zh_cn: IV用于链接模式（CBC，CFB，OFB）。它的大小必须与块长度相同（8个字节）。

# OutputStreamCaption
source: Output stream
de: Ausgabedatenstrom
ru: Выходной поток
zh_cn: 输出流

# OutputStreamTooltip
source: Encrypted or decrypted output data
de: Ver- bzw. entschlüsselter Ausgabedatenstrom
ru: Шифрованные или дешифрованные выходные данные
zh_cn: 加密或解密的输出数据

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionTooltip
source: Do you want the input data to be encrypted or decrypted?
de: Sollen die Eingabedaten ver- oder entschlüsselt werden?
ru: Вы хотите, чтобы входные данные были зашифрованы или дешифрованы?
zh_cn: 是否要对输入数据进行加密或解密？

# ModeCaption
source: Chaining Mode
de: Blockverkettungsmodus
ru: Цепочный режим
zh_cn: 链接模式

# ModeTooltip
source: Select the block cipher mode of operation.
de: Wählen Sie die Art der Blockverkettung.
ru: Выберите режим блочного шифрования.
zh_cn: 选择分组密码操作模式。

# PaddingCaption
source: Padding Mode
de: Auffüll-Methode (Padding)
ru: Режим заполнения
zh_cn: 填充模式

# PaddingTooltip
source: Select a mode to fill partial data blocks.
de: Wählen Sie die Methode, wie zu kurze Blöcke zur Blockgröße aufgefüllt werden.
ru: Выберите режим для заполнения частичных блоков данных.
zh_cn: 选择一种模式来填充部分数据块。

# ActionList1
source: Encrypt
de: Verschlüsselung
ru: шифровать
zh_cn: 加密

# ActionList2
source: Decrypt
de: Entschlüsselung
ru: расшифровывать
zh_cn: 解密

# ModeList1
source: Electronic Code Book (ECB)
ru: Электронная кодовая книга (ЕЦБ)
zh_cn: 电子密码书（ECB）

# ModeList2
source: Cipher Block Chaining (CBC)
zh_cn: 密码块链接（CBC）

# ModeList3
source: Cipher Feedback (CFB)
ru: Обратная связь с шифрованием (CFB)
zh_cn: 密码反馈（CFB）

# ModeList4
source: Output feedback (OFB)
ru: Выходная обратная связь (OFB)
zh_cn: 输出反馈（OFB）

source: About
de: Über
ru: Около
zh_cn: 关于

source: Add Roundkey
de: Rundenschlüssel addieren
ru: Добавить раунд
zh_cn: 添加圆键

source: animation speed
de: Animationsgeschwindigkeit
ru: скорость анимации
zh_cn: 动画速度

source: Assign
de: Übernehmen
ru: приписывать
zh_cn: 分配

source: A top-level algorithmic description of PRESENT:
de: Algorithmische Beschreibung des PRESENT-Verfahrens:
ru: Алгоритмическое описание верхнего уровня НАСТОЯЩЕГО:
zh_cn: PRESENT的顶级算法描述：

# bit_group_sbox
source: bit group {0} (bits {1:d2},{2:d2},{3:d2},{4:d2}) sbox : {5} -> {6}
de: Bitgruppe {0} (bits {1:d2},{2:d2},{3:d2},{4:d2}) S-Box : {5} -> {6}
ru: бит {0} (бит {1: d2}, {2: d2}, {3: d2}, {4: d2}) sbox: {5} -> {6}
zh_cn: 位组{0}（位{1：d2}，{2：d2}，{3：d2}，{4：d2}）sbox：{5}-&gt; {6}

# bit_group_xor
source: bit group {0} (bits {1:d2},{2:d2},{3:d2},{4:d2}) key xor : {5} XOR {6} = {7}
de: Bitgruppe {0} (Bits {1:d2},{2:d2},{3:d2},{4:d2}) Schlüssel XOR : {5} XOR {6} = {7}
ru: бит {0} (бит {1: d2}, {2: d2}, {3: d2}, {4: d2}) ключ xor: {5} XOR {6} = {7}
zh_cn: 位组{0}（位{1：d2}，{2：d2}，{3：d2}，{4：d2}）密钥xor：{5} XOR {6} = {7}

# Data_
source: Data (8 byte):
de: Daten (8 Byte):
ru: Данные (8 байт):
zh_cn: 数据（8字节）：

source: Done
de: Fertig
ru: Готово
zh_cn: 完成了

# Encrypted_to
source: Encrypted 0x{0:x16} to 0x{1:x16}
de: Verschlüsselt 0x{0:x16} nach 0x{1:x16}
ru: Шифрованный 0x {0: x16} до 0x {1: x16}
zh_cn: 加密的0x {0：x16}至0x {1：x16}

source: Encryption
de: Verschlüsselung
ru: шифрование
zh_cn: 加密

# Encryption_Data
source: Encryption: Data = 0x{0:x16}
de: Verschlüsselung: Daten = 0x{0:x16}
ru: Шифрование: данные = 0x {0: x16}
zh_cn: 加密：数据= 0x {0：x16}

source: Finished
de: Beendet
ru: Законченный
zh_cn: 已完成

source: Finished generating 32 roundkeys
de: Erzeugung der 32 Rundenschlüssel beendet
ru: Завершено создание 32 круглых клавиш
zh_cn: 完成生成32个圆键

# Key_
source: Key (10 byte):
de: Schlüssel (10 Byte):
ru: Ключ (10 байт):
zh_cn: 密钥（10个字节）：

source: Key Extraction
de: Schlüsselextraktion
ru: Экстракция ключа
zh_cn: 密钥提取

source: Key Schedule
de: Schlüsselerzeugung
ru: Расписание
zh_cn: 关键时间表

# Key_Schedule_
source: Key Schedule : Key = 0x{0:x16}{1:x4}
de: Schlüsselerzeugung: Schlüssel = 0x{0:x16}{1:x4}
ru: Ключевое расписание: Ключ = 0x {0: x16} {1: x4}
zh_cn: 密钥时间表：密钥= 0x {0：x16} {1：x4}

source: Key_Shift
de: Schlüssel verschieben
zh_cn: 键移

# Key_XOR_
source: Key XOR (0x{1:x16} -> 0x{2:x16})
de: Schlüssel XOR (0x{1:x16} -> 0x{2:x16})
ru: Ключ XOR (0x{1: x16} -> 0x{2: x16})
zh_cn: 异或键（0x {1：x16}-&gt; 0x {2：x16}）

source: next round
de: nächste Runde
ru: следующий раунд
zh_cn: 下一轮

source: next step
de: nächster Schritt
ru: следующий шаг
zh_cn: 下一步

source: Overview
de: Überblick
ru: обзор
zh_cn: 总览

# passing_leftmost_4_bits
source: passing leftmost 4 bits through S-box ({0} -> {1})
de: Weitergabe der 4 höchstwertigen Bits an die S-Box ({0} -> {1})
ru: прохождение крайних левых 4 бит через S-box ({0} -> {1})
zh_cn: 通过S-box（{0}-&gt; {1}）传递最左4位

# pause_resume
source: pause/resume animation
de: Animation anhalten/fortsetzen
ru: пауза / возобновление анимации
zh_cn: 暂停/恢复动画

source: Permutation
ru: перестановка
zh_cn: 排列

# picking_the_64_left_most_bits
source: picking the 64 leftmost bits as roundkey {0} (0x{1:x16})
de: Auswahl der 64 höchstwertigen Bits als Rundenschlüssel {0} (0x{1:x16})
ru: выбирая 64 левых бита как круглый ключ {0} (0x {1: x16})
zh_cn: 选择最左边的64个位作为圆键{0}（0x {1：x16}）

source: previous round
de: vorherige Runde
ru: предыдущий раунд
zh_cn: 前一轮

source: previous step
de: vorheriger Schritt
ru: предыдущий шаг
zh_cn: 前一步

# rotate_key_register_61
source: rotate key register 61 positions to the left (0x{0:x16} {1:x4} -> 0x{2:x16} {3:x4})
de: rotiere Schlüsselregister 61 Stellen nach links (0x{0:x16} {1:x4} -> 0x{2:x16} {3:x4})
ru: поверните регистр ключей 61 влево (0x {0: x16} {1: x4} -> 0x {2: x16} {3: x4})
zh_cn: 将密钥寄存器61旋转到左侧（0x {0：x16} {1：x4}-&gt; 0x {2：x16} {3：x4}）

source: Round:
de: Runde:
ru: Круглый:
zh_cn: 回合：

source: Settings
de: Einstellungen
ru: настройки
zh_cn: 设定值

source: Step:
de: Schritt:
ru: Шаг:
zh_cn: 步：

source: S-Box
zh_cn: 盒子

# The_PRESENT_cipher_is_an_example
source: The PRESENT cipher is an example of an SP-network and consists of 31 rounds. The block length is 64 bits and two key lengths of 80 and 128 bits are supported - but only the recommended 80-bit key version is implemented here.
de: Die PRESENT-Chiffre ist ein Beispiel für ein SP-Netzwerk und besteht aus 31 Runden. Die Blockgröße beträgt 64 Bits und Schlüssel mit 80 und 128 Bits werden unterstützt (in dieser Implementierung wird allerdings nur die 80-bit-Version unterstützt).
ru: PRESENT-шифр является примером SP-сети и состоит из 31 раунда. Длина блока составляет 64 бита, и поддерживаются две длины ключа 80 и 128 бит, но здесь используется только рекомендуемая 80-битная версия ключа.
zh_cn: PRESENT密码是SP网络的一个示例，由31个回合组成。块长度为64位，并且支持80和128位的两个密钥长度-但此处仅实现推荐的80位密钥版本。

source: Trace
de: Protokoll
ru: след
zh_cn: 跟踪

# xor_round_counter
source: xor round counter with key register : {0} XOR {1} = {2}
de: XOR Rundenzähler mit Schlüsselregister: {0} XOR {1} = {2}
ru: xor round counter с регистром ключей: {0} XOR {1} = {2}
zh_cn: 具有密钥寄存器的异或计数器：{0} XOR {1} = {2}

# PaddingList1
source: None
de: Keine
ru: Никто
zh_cn: 没有

# PaddingList2
source: Zeros
de: Nullen
ru: нули
zh_cn: 零点

# PaddingList6
source: 1-0 padding
ru: Отступ 1-0
zh_cn: 1-0填充

# AboutText
source: The visualization of the PRESENT cipher is independent from the data entered in the CT2 workspace. Input data for the presentation can be entered below the tab "Settings".
de: Die Visualisierung der PRESENT-Chiffre ist unabhängig von den Daten, die im CT2-Arbeitsbereich eingegeben werden. Die in der Präsentation zu nutzenden Eingabedaten können unter der Registerkarte "Einstellungen" geändert werden.
ru: Визуализация шифра PRESENT не зависит от фактических данных, введенных в рабочем пространстве CrypTool 2. Если необходимо изменить исходные данные презентации, необходимо использовать вкладку «Настройки».
zh_cn: PRESENT密码的可视化与CT2工作区中输入的数据无关。演示文稿的输入数据可以在“设置”标签下输入。

# SettingsInfoText
source: Here, you can change key and input (plaintext in hex) that are used in the presentation. The visualization encrypts exactly one block, thus, no additional data (like an initialization vector) is needed.
de: Hier können Schlüssel und Daten (Klartext in hex) zur Verwendung in der Präsentation geändert werden. Die Visualisierung verschlüsselt genau einen Block -- somit werden keine zusätzlichen Parameter (z.B. ein Initialisierungsvektor) benötigt.
ru: Здесь вы можете изменить ключ и блок ввода, используемые в презентации. Ровно один блок зашифрован, поэтому никаких дополнительных данных, таких как необходим вектор инициализации.
zh_cn: 在这里，您可以更改演示文稿中使用的键和输入（十六进制的纯文本）。可视化过程精确地加密了一个块，因此不需要其他数据（如初始化向量）。

source: Roundcounter XOR
de: Rundenzähler XOR
ru: Круглый стол XOR

source: Key_XOR
de: Schlüssel XOR
