Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/PaddingOracleAttack/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# BlocksizeCaption
source: Blocksize
de: Blockgröße
ru: Размер блока
zh_cn: 块大小

# BlocksizeTooltip
source: Enter the used block size.
de: Geben Sie die verwendete Blockgröße an.
ru: Введите размер используемого блока.
zh_cn: 输入使用的块大小。

# btnAll
source: Decrypt completely
de: Alles entschlüsseln
ru: Полностью расшифровать
zh_cn: 完全解密

# btnAuto
source: Auto search
de: Automatische Suche
ru: Авто поиск
zh_cn: 自动搜寻

# btnLblP1
source: Change Byte
de: Byte ändern
ru: Байт изменения
zh_cn: 更改字节

# btnLblP1End
source: Go to Phase 2
de: Zu Phase 2 gehen
ru: Перейти к этапу 2
zh_cn: 转到第二阶段

# btnLblP1Init
source: Send Request
de: Anfrage senden
ru: Послать запрос
zh_cn: 发送请求

# btnLblP2
source: Next byte
de: Nächstes Byte probieren
ru: Следующий байт
zh_cn: 下一个字节

# btnLblP2End
source: Go to Phase 3
de: Zu Phase 3 gehen
ru: Перейдите к Фазе 3
zh_cn: 转到第3阶段

# btnLblP2Init
source: Start Search
de: Suche beginnen
ru: Начать поиск
zh_cn: 开始寻找

# btnLblP3Decrypt
source: Decrypt Byte
de: Byte entschlüsseln
ru: Расшифровать байт
zh_cn: 解密字节

# btnLblP3End
source: Recover Plaintext
de: Klartext generieren
ru: Восстановить обычный текст
zh_cn: 恢复纯文本

# btnLblP3Find
source: Change Current Byte
de: Aktuelles Byte ändern
ru: Изменить текущий байт
zh_cn: 更改当前字节

# btnLblP3IncPad
source: Increase Padding
de: Padding erhöhen
ru: Увеличение заполнения
zh_cn: 增加填充

# btnNext
source: Next
de: Weiter
ru: следующий
zh_cn: 下一个

# CipherInputCaption
source: Cipher Input
de: Geheimtext
ru: Входной сигнал Cipher
zh_cn: 密码输入

# CipherInputTooltip
source: Input of the ciphertext
de: Eingabe des Geheimtextes
ru: Ввод зашифрованного текста
zh_cn: 密文输入

# descDone
source: Plaintext Recovered. Attack completed successfully.
de: Klartext erhalten. Der Angriff wurde erfolgreich beendet!
ru: Восстановлен Plaintext. Атака выполнена успешно.
zh_cn: 明文已恢复。攻击成功完成。

# descFinishAll
source: Please wait while the message is being decrypted.
de: Bitte warten Sie bis die Nachricht komplett entschlüsselt wurde.
ru: Подождите, пока сообщение будет расшифровано.
zh_cn: 邮件正在解密时，请等待。

# descP1Done
source: Phase 1 finished! Valid padding found.
de: Phase 1 beendet! Valides Padding gefunden.
ru: Фаза 1 закончена! Найдено допустимое дополнение.
zh_cn: 第一阶段完成！找到有效的填充。

# descP1Init
source: Phase 1: Find a message that decrypts to a valid padding. Send the unchanged message to see if a valid padding already exists.
de: Phase 1: Finde eine Nachricht mit einem gültigen Padding. Schicke die unveränderte Nachricht, um zu überprüfen, ob schon ein gültiges Padding existiert.
ru: Этап 1: найдите сообщение, которое расшифровывает действительное дополнение. Отправьте неизмененное сообщение, чтобы узнать, существует ли уже допустимая прокладка.
zh_cn: 阶段1：找到一条解密为有效填充的消息。发送未更改的消息以查看是否存在有效的填充。

# descP1Task
source: Task: Change the last byte until the padding is valid.
de: Das Padding ist falsch. Ändere das letzte Byte, bis das Padding gültig ist.
ru: Задача: изменить последний байт до тех пор, пока заполнение не будет действительным.
zh_cn: 任务：更改最后一个字节，直到填充有效。

# descP2Done
source: Phase 2 finished! First padding byte found! Padding length:
de: Phase 2 beendet! Das erste Padding-Byte wurde gefunden. Paddinglänge:
ru: Фаза 2 завершена! Найден первый байт заполнения. Длина прокладки:
zh_cn: 第二阶段完成！找到第一个填充字节！填充长度：

# descP2DoneSpecial
source: Phase 2 finished! The first 7 bytes did not affect the padding, so the padding length must be 1!
de: Phase 2 beendet! Die ersten 7 Bytes beeinflussen das Padding nicht, also muss die Paddinglänge 1 sein.
ru: Фаза 2 завершена! Первые 7 байт не повлияли на заполнение, поэтому длина заполнения должна быть 1!
zh_cn: 第二阶段完成！前7个字节不影响填充，因此填充长度必须为1！

# descP2Init
source: Phase 2: Find first padding byte. Change the bytes from left to right. If the padding turns invalid, a padding byte must have been changed.
de: Phase 2: Finde das erste Padding-Byte. Ändere die Bytes des Geheimtextes von links nach rechts. Wenn das Padding ungültig wird, muss ein Padding-Byte geändert worden sein.
ru: Этап 2: найдите первый байт заполнения. Измените байты слева направо. Если заполнение становится недействительным, должен быть изменен байт заполнения.
zh_cn: 阶段2：找到第一个填充字节。从左到右更改字节。如果填充无效，则必须更改填充字节。

# descP2Task
source: The changed byte does not belong to the padding. Try the next byte!
de: Das geänderte Byte gehörte anscheinend nicht zum Padding. Probiere das nächste Byte aus!
ru: Измененный байт не относится к заполнению. Попробуйте следующий байт!
zh_cn: 更改的字节不属于填充。尝试下一个字节！

# descP3Dec
source: Byte Decrypted! Increase the padding to continue the decryption.
de: Byte entschlüsselt! Erhöhe das Padding, um die Entschlüsselung fortzusetzen.
ru: Байт расшифрован! Увеличьте заполнение, чтобы продолжить расшифровку.
zh_cn: 字节解密！增加填充以继续解密。

# descP3DecDone
source: The byte was decrypted. Increase the padding to continue the decryption.
de: Das Byte wurde entschlüsselt. Erhöhe das Padding, um die Entschlüsselung fortzusetzen.
ru: Байт был расшифрован. Увеличьте заполнение, чтобы продолжить расшифровку.
zh_cn: 该字节已解密。增加填充以继续解密。

# descP3DecPadDone
source: All Padding Bytes Decrypted. Increase the padding to continue the decryption.
de: Alle Padding-Bytes wurden entschlüsselt! Erhöhe das Padding, um die Entschlüsselung fortzusetzen.
ru: Все байты заполнения расшифровываются. Увеличьте заполнение, чтобы продолжить расшифровку.
zh_cn: 所有填充字节已解密。增加填充以继续解密。

# descP3Done
source: Message was decrypted! Click to see the original plaintext.
de: Die Nachricht wurde komplett entschlüsselt! Klicke auf den "Weiter"-Button, um den Klartext zu erhalten.
ru: Сообщение было расшифровано! Нажмите, чтобы увидеть исходный текст.
zh_cn: 邮件已解密！单击以查看原始的纯文本。

# descP3FindDone
source: Valid padding found! Byte can be decrypted.
de: Gültiges Padding gefunden! Byte kann entschlüsselt werden.
ru: Допустимое заполнение найдено! Байт может быть расшифрован.
zh_cn: 找到有效的填充！字节可以解密。

# descP3FindTask
source: Task: Change the byte until the message decrypts to the desired value! If the correct value is found, the padding will turn valid.
de: Aufgabe: Ändere das ausgewählte Byte so lange, bis der gewünschte Wert gefunden wurde. Wenn der Wert gefunden wurde, wird das Padding automatisch gültig.
ru: Задача: изменение байта до тех пор, пока сообщение не расшифрует требуемое значение! Если правильное значение найдено, заполнение станет действительным.
zh_cn: 任务：更改字节，直到消息解密为所需值！如果找到正确的值，则填充将变为有效。

# descP3Init
source: Phase 3: Decrypt the message. Start with decrypting the padding bytes.
de: Phase 3: Entschlüssle die Nachricht. Beginne mit der Entschlüsselung der Padding-Bytes.
ru: Этап 3. Расшифруйте сообщение. Начните с расшифровки байтов заполнения.
zh_cn: 阶段3：解密邮件。从解密填充字节开始。

# descPadIn
source: Response from the Padding Oracle
de: Antwort vom Padding-Orakel
ru: Ответ от Oracle Padding
zh_cn: 来自填充Oracle的回复

# langCheck
source: English
de: Deutsch
ru: английский
zh_cn: 英语

# PaddingOracleInputCaption
source: Padding Valid
de: Padding gültig
ru: Допустимое заполнение
zh_cn: 填充有效

# PaddingOracleInputTooltip
source: Validity of the padding
de: Gültigkeit des Paddings
ru: Действительность заполнения
zh_cn: 填充的有效性

# PluginCaption
source: Padding Oracle Attack
de: Padding-Orakel-Angriff
ru: Заполнение Oracle Attack
zh_cn: 填充Oracle攻击

# PluginTooltip
source: Attacks an encrypted message using a Padding Oracle
de: Angriff auf eine verschlüsselte Nachricht mit einem Padding-Orakel
ru: Атакует зашифрованное сообщение с помощью Padding Oracle
zh_cn: 使用填充Oracle攻击加密的消息

# ResultOutputCaption
source: Manipulated Cipher Output
de: Manipulierter Geheimtext
ru: Манипулированный вывод Cipher
zh_cn: 操纵密码输出

# ResultOutputTooltip
source: Output of the manipulated cipher
de: Ausgabe des manipulierten Geheimtextes
ru: Выход управляемого шифра
zh_cn: 受控密码的输出

# ttBtnAll
source: Automatically decrypt the complete message.
de: Entschlüssle automatisch die komplette Nachricht.
ru: Автоматически расшифровывать полное сообщение.
zh_cn: 自动解密完整的消息。

# ttBtnAuto
source: Search automatically for the next valid value.
de: Suche automatisch nach dem nächsten gültigen Wert.
ru: Поиск автоматически для следующего допустимого значения.
zh_cn: 自动搜索下一个有效值。

# ttBtnNext
source: Perform the next step.
de: Führe den nächsten Angriffsschritt aus.
ru: Выполните следующий шаг.
zh_cn: 执行下一步。

# ttBtnReturn
source: Undo the last performed action.
de: Letzte Aktion rückgängig machen.
ru: Отмените последнее выполненное действие.
zh_cn: 撤消上一次执行的操作。

# ttBtnReturnPhase
source: Return to the beginning of the current phase.
de: Kehre zum Beginn der aktuellen Phase zurück.
ru: Вернитесь к началу текущего этапа.
zh_cn: 返回当前阶段的开始。

# ttCipherBlock
source: The encrypted informationblock.
de: Der verschlüsselte Informationsblock.
ru: Зашифрованный информационный блок.
zh_cn: 加密的信息块。

# ttCorruptedBlock
source: The corrupted initializationblock (original C1 XOR O).
de: Der korrumpierte Initialisierungsblock (Initialisierungsblock XOR Overlay).
ru: Поврежденный блок инициализации (оригинал C1 XOR O).
zh_cn: 损坏的初始化块（原始C1 XOR O）。

# ttDecBlock
source: The decrypted initializationblock (is completely known at the end). XORd with the original initializationblock C1 results in the plaintext P2.
de: Der entschlüsselte Initialisierungsblock (erst am Ende vollständig bekannt). XORed mit dem ursprünglichen Initialisierungblock ergibt den Klartext.
ru: Дешифрованный блок инициализации (полностью известен в конце). XORd с исходным инициализационным блоком C1 приводит к открытому тексту P2.
zh_cn: 解密后的初始化块（最后完全知道）。与原始初始化块C1的XORd产生明文P2。

# ttOverlayBlock
source: The overlay used to modify the initializationblock.
de: Das Overlay um den Initialisierungsblock zu modifizieren.
ru: Наложение используется для изменения блока инициализации.
zh_cn: 用于修改初始化块的叠加层。

# ttPlainBlock
source: The resulting plaintext when XORing D2 with the original initializationblock C1 and O.
de: Der resultierende Klartext, wenn man D2 mit dem korrumpierten Initialisierungsblock XORed.
ru: Полученный открытый текст при XORing D2 с исходным блоком инициализации C1 и O.
zh_cn: 将D2与原始初始化块C1和O进行XOR运算时得到的明文。

# ttPrelBlock
source: The encrypted initializationblock.
de: Der verschlüsselte Initialisierungsblock.
ru: Зашифрованный блок инициализации.
zh_cn: 加密的初始化块。

# ttSentRequests
source: Amount of requests sent to the server
de: Anzahl gesendeter Anfragen an den Server.
ru: Количество запросов, отправленных на сервер
zh_cn: 发送到服务器的请求数量

# ttViewByte
source: The plugin only displays 8 bytes at a time. If the block size exceeds 8 bytes, hidden bytes can be displayed by using the scrollbar.
de: Es können nur 8 byte gleichzeitig dargestellt werden. Sollte die Blocklänge größer als 8 sein, so können die anderen Bytes mit Hilfe des Scrollbalkens angezeigt werden.
ru: Плагин отображает только 8 байтов за раз. Если размер блока превышает 8 байтов, скрытые байты могут отображаться с помощью полосы прокрутки.
zh_cn: 该插件一次仅显示8个字节。如果块大小超过8个字节，则可以使用滚动条显示隐藏的字节。

# ttViewByteDesc
source: Currently Viewing Bytes
de: Angezeigte Bytes
ru: В настоящее время просмотр байтов
zh_cn: 当前查看字节

# lblAttackLogic
source: Attack Logic
de: Angriffslogik
ru: Логика атаки
zh_cn: 攻击逻辑

# lblComplete
source: COMPLETE
de: FERTIG
ru: ПОЛНОЕ
zh_cn: 完成

# lblInput
source: Input
de: Eingabe
ru: вход
zh_cn: 输入值

# lblInvalid
source: INVALID
de: UNGÜLTIG
ru: ИНВАЛИД
zh_cn: 无效

# lblOutput
source: Output
de: Ausgabe
ru: Вывод
zh_cn: 输出量

# lblRequests
source: Oracle Requests:
de: Orakel-Anfragen:
ru: Запросы Oracle:
zh_cn: Oracle请求：

# lblValid
source: VALID
de: GÜLTIG
ru: ДЕЙСТВУЕТ
zh_cn: 有效
