Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/EllipticCurveCryptography/Properties/Resources.*.resx
Languages: de

# EccInputCaption
source: ECC Input
de: ECC-Eingabe

# EccInputTooltip
source: Generates an elliptic curve and returns a point on the curve
de: Generiert eine elliptische Kurve und gibt einen Punkt auf dieser zurück

# EccOperationsCaption
source: ECC Operations
de: ECC-Operationen

# EccOperationsTooltip
source: Perform point addition or scalar multiplication
de: Punktaddition oder Skalarmultiplikation durchführen

source: Infinity Point
de: Punkt im Unendlichen

# ModeCaption
source: Return generator or custom point
de: Generatorpunkt oder eigener Punkt

# Point1Caption
source: Point 1
de: Punkt 1

# Point1Tooltip
source: First elliptic curve point input
de: Erster Punkt der elliptischen Kurve

# Point2Caption
source: Point 2
de: Punkt 2

# Point2Tooltip
source: Second elliptic curve point input
de: Zweiter Punkt der elliptischen Kurve

# PointCaption
source: Point
de: Punkt

# PointTooltip
source: A point on the curve
de: Ein Punkt auf der Kurve

# ResultPointCaption
source: Result
de: Ergebnis

# ResultPointTooltip
source: Resulting point after computation
de: Resultierender Punkt nach der Berechnung

# ScalarCaption
source: Scalar
de: Skalar

# ScalarTooltip
source: Scalar value for point multiplication
de: Skalarwert zur Punktmultiplikation

source: User defined curve
de: Benutzerdefinierte Kurve

# ACaption
source: Curve parameter a
de: Kurvenparameter a

# ATooltip
source: Set the value for the curve parameter a
de: Legen Sie den Wert für den Kurvenparameter a fest

# BCaption
source: Curve parameter b
de: Kurvenparameter b

# BTooltip
source: Set the value for the curve parameter b
de: Legen Sie den Wert für den Kurvenparameter b fest

# SelectedCurveCaption
source: Select curve
de: Kurve auswählen

# SelectedCurveTooltip
source: Select a predefined curve or define your own
de: Wählen Sie eine vordefinierte Kurve oder definieren Sie eine eigene

source: Enter custom point
de: Benutzerdefinierten Punkt eingeben

# XCaption
source: X coordinate of the point
de: X-Koordinate des Punkts

# XTooltip
source: Set the X coordinate of the point
de: Legen Sie die X-Koordinate des Punkts fest

# YCaption
source: Y coordinate of the point
de: Y-Koordinate des Punkts

# YTooltip
source: Set the Y coordinate of the point
de: Legen Sie die Y-Koordinate des Punkts fest

# CurveParametersGroup
source: Curve parameters
de: Kurvenparameter

# CurveSelectionGroup
source: Curve selection
de: Kurvenauswahl

# PointParametersGroup
source: Point parameters
de: Punktparameter

# UseGenerator
source: Use predefined generator point
de: Vordefinierten Generatorpunkt verwenden

# ModeTooltip
source: Choose whether to return an automatically computed generator point or a user-defined custom point.
de: Wählen Sie aus, ob ein automatisch berechneter Generatorpunkt oder ein benutzerdefinierter Punkt ausgegeben werden soll.
