Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Substitution/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionTooltip
source: Encrypt or decrypt?
de: Verschlüsseln oder entschlüsseln?
ru: Шифровать или расшифровывать?
zh_cn: 加密还是解密？

source: Decrypt
de: Entschlüsseln
ru: расшифровывать
zh_cn: 解密

# DestinationAlphabetCaption
source: Destination alphabet
de: Zielalphabet
ru: Атрибут назначения
zh_cn: 目的字母

# DestinationAlphabetTooltip
source: The alphabet which is used in the destination string
de: Das Alphabet des Ausgabeetextes
ru: Алфавит, который используется в целевой строке
zh_cn: 目标字符串中使用的字母

source: Encrypt
de: Verschlüsseln
ru: шифровать
zh_cn: 加密

# InputSeparatorSymbolCaption
source: Input Separator Symbol
de: Eingabesymboltrenner
ru: Символ разделителя ввода
zh_cn: 输入分隔符

# InputSeparatorSymbolTooltip
source: The symbol which should be used to split the input into tokens.
de: Das Zeichen das genutzt werden soll, die Eingabe zu trennen.
ru: Символ, который должен использоваться для разделения входа на токены.
zh_cn: 用于将输入拆分为标记的符号。

# InputStringCaption
source: Text input
de: Eingabetext
ru: Ввод текста
zh_cn: 文字输入

# InputStringTooltip
source: Input a string to be processed by the Substitution cipher
de: Eingabetext welcher mit der Substition verarbeitet werden soll
ru: Введите строку, подлежащую обработке с помощью шифрования Substitution
zh_cn: 输入要由替换密码处理的字符串

# MaxMappingsShownInPresentationCaption
source: Maximum number of mappings shown
de: Maximale Anzahl der angezeigten Substitutionszuordnungen

# MaxMappingsShownInPresentationTooltip
source: Maximum number of substitution mappings that are shown in the presentation
de: Maximale Anzahl von Substitutionszuordnungen, die in der Präsentation angezeigt werden

# OutputSeparatorSymbolCaption
source: Output Separator Symbol
de: Ausgabesymboltrenner
ru: Символ выходного разделителя
zh_cn: 输出分隔符

# OutputSeparatorSymbolTooltip
source: The symbol which should be used to split the output into tokens.
de: Das Zeichen das genutzt werden soll, die Ausgabe zu trennen.
ru: Символ, который должен использоваться для разделения вывода на токены.
zh_cn: 用于将输出拆分为标记的符号。

# OutputStringCaption
source: Text output
de: Ausgabetext
ru: Вывод текста
zh_cn: 文字输出

# OutputStringTooltip
source: The string after processing with the Substitution cipher
de: Der substituierte Text
ru: Строка после обработки с помощью шифрования замещения
zh_cn: 用替换密码处理后的字符串

# PluginTooltip
source: Classic substitution
de: Klassische Substitution
ru: Классическая замена
zh_cn: 经典替代

# ProcessPolypartitCaption
source: Process polypartit
de: Verarbeite polypartit
ru: Технологический полипарт
zh_cn: 工艺多方

# ProcessPolypartitTooltio
source: Process polypartit substitution
de: Verarbeite polypartite Substitutions-Syntax
ru: Замена поличаститов процесса
zh_cn: 流程多方替换

# ReplacementSymbolCaption
source: Unknown Symbol Replacement
de: Ersetzung unbekannter Symbole
ru: Неизвестная замена символа
zh_cn: 未知符号替换

# ReplacementSymbolTooltip
source: Which symbol should be used for the replacement of unknown symbols
de: Mit welchem Symbol sollen unbekannte Symbole ersetzt werden
ru: Какой символ следует использовать для замены неизвестных символов
zh_cn: 应使用哪个符号替换未知符号

# SourceAlphabetCaption
source: Source alphabet
de: Quellalphabet
ru: Исходный алфавит
zh_cn: 源字母

# SourceAlphabetTooltip
source: The alphabet which is used in the source string
de: Das Alphabet des Eingabetextes
ru: Алфавит, который используется в исходной строке
zh_cn: 源字符串中使用的字母

# SubstitutionAlreadyExists
source: A substitution for "{0}" already exsists ("{0}"->"{2}"). Ignore the new one ("{0}"->"{1}").
de: Es gibt bereits eine Ersetzung für "{0}" ("{0}"->"{2}"). Ignoriere die neue Ersetzung ("{0}"->"{1}").

# SymbolChoiceCaption
source: Symbol Choice
de: Symbol Auswahl
ru: Выбор символа
zh_cn: 符号选择

# SymbolChoiceList1
source: Round Robin
de: Sequentiell
ru: По-круговой
zh_cn: 循环赛

# SymbolChoiceList2
source: Random
de: Zufällig
ru: случайный
zh_cn: 随机

# SymbolChoiceTooltip
source: The method for chosing symbols in a homophone substitution
de: Die Methode um Symbole bei homophen Substitutionen auszuwählen
ru: Метод выбора символов в гомофоновой замене
zh_cn: 在同音字替换中选择符号的方法

# TooManyDuplicateSubstitutions
source: There are {0} duplicate subsitutions. Stopped showing log messages after the 10th log message.
de: Es gibt {0} doppelte Ersetzungen. Nach der 10. Logmeldung wurden keine weiteren Logmeldungen mehr ausgegeben.

# UnknownSymbolHandlingCaption
source: Unknown symbols handling
de: Behandlung unbekannter Symbole
ru: Управление неизвестными символами
zh_cn: 未知符号处理

# UnknownSymbolHandlingList1
source: Leave as is
de: Übernehmen
ru: Оставить как есть
zh_cn: 照原样

# UnknownSymbolHandlingList2
source: Replace
de: Ersetzen
ru: замещать
zh_cn: 更换

# UnknownSymbolHandlingList3
source: Remove
de: Entfernen
ru: Удалить
zh_cn: 去掉

# UnknownSymbolHandlingTooltip
source: What should be done with unknown symbols?
de: Was soll mit unbekannten Symbolen geschehen?
ru: Что делать с неизвестными символами?
zh_cn: 未知符号应该怎么办？

# PluginCaption
source: Substitution
ru: подмена
zh_cn: 替代
