Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/SpanishStripCipher/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# ActionTooltip
source: Encrypt or decrypt?
de: Verschlüsseln oder Entschlüsseln?
ru: Шифровать или расшифровывать?
zh_cn: 加密还是解密？

# ActionList2
source: Decryption
de: Entschlüsselung
ru: Дешифрирование
zh_cn: 解密

# ActionList1
source: Encryption
de: Verschlüsselung
ru: шифрование
zh_cn: 加密

# HomophonesCaption
source: Homophones table
de: Homophonen-Tabelle
ru: Гомофоны настольные
zh_cn: 谐音表

# HomophonesTooltip
source: This parameter contains 90 or 99 two-digit numbers in the range of 10-99 or 01-99. These numbers are used during encryption and decryption. To each letter, three or four numbers are assigned.
de: Dieser Parameter enthält 90 oder 99 zweistellige Zahlen im Bereich von 10-99 oder 01-99. Diese Zahlen werden bei der "Verschlüsselung" und der "Entschlüsselung" verwendet. Jedem Buchstaben werden drei oder vier Zahlen zugewiesen.
ru: Этот параметр содержит 90 или 99 двухзначных номеров в диапазоне 10-99 или 01-99. Эти номера используются во время шифрования и дешифрования. Каждой букве назначаются три или четыре номера.
zh_cn: 此参数包含90或99位两位数字，范围为10-99或01-99。这些数字在加密和解密期间使用。每个字母分配三个或四个数字。

# InputCaption
source: Input
de: Eingabe
ru: вход
zh_cn: 输入值

# InputTooltip
source: If action "Encryption" is selected, insert plaintext to be encrypted. If action "Decryption" is selected, insert ciphertext to be decrypted.
de: Geben Sie den Klartext ein, falls die Aktion "Verschlüsselung" ausgewählt wurde. Geben Sie den Geheimtext ein, falls die Aktion "Entschlüsselung" ausgewählt wurde.
ru: Если выбрано действие «Шифрование», вставьте незашифрованный текст для шифрования. Если выбрано действие «Расшифровка», вставьте зашифрованный текст, который нужно расшифровать.
zh_cn: 如果选择了“加密”操作，则插入要加密的纯文本。如果选择了“解密”操作，则插入要解密的密文。

# KeywordCaption
source: Keyword
de: Schlüsselwort
ru: Ключевое слово
zh_cn: 关键词

# KeywordTooltip
source: The keyword must consist of letters of the given alphabet. It is used to generate the random alphabet.
de: Das Schlüsselwort muss aus Buchstaben des eingestellten Alphabetes bestehen. Es wird verwendet, um das zufällige Alphabet zu generieren.
ru: Ключевое слово должно состоять из букв данного алфавита. Он используется для генерации случайного алфавита.
zh_cn: 关键字必须包含给定字母的字母。它用于生成随机字母。

# OrderedAlphabetCaption
source: Ordered alphabet
de: Geordnetes Alphabet
ru: Упорядоченный алфавит
zh_cn: 有序字母

# OrderedAlphabetTooltip
source: Spanish alphabet
de: Spanisches Alphabet
ru: Испанский алфавит
zh_cn: 西班牙字母

# OutputTooltip
source: Encrypted or decrypted output data
de: Verschlüsselte oder entschlüsselte Ausgabedaten
ru: Шифрованные или дешифрованные выходные данные
zh_cn: 加密或解密的输出数据

# PluginCaption
source: Spanish Strip Cipher
de: Spanische Streifen-Chiffre
ru: Испанский шифр
zh_cn: 西班牙地带密码

# PluginTooltip
source: Spanish Strip Cipher
de: Spanische Streifen-Chiffre
ru: Испанский шифр
zh_cn: 西班牙地带密码

# Position1Caption
source: Position random alphabet´s letter
de: Verschieben
ru: Расположить букву произвольного алфавита
zh_cn: 位置随机字母的字母

# Position1Tooltip
source: The random alphabet will be shifted until the letter indicated by this parameter matches the ordered alphabet´s letter indicated by the parameter "on ordered alphabet´s letter"
de: Dieser Parameter gibt an, um wie viele Positionen das zufällige Alphabet verschoben werden soll.
ru: Случайный алфавит будет сдвинут, пока буква, указанная этим параметром, не будет соответствовать букве упорядоченного алфавита, обозначенной параметром «на букве упорядоченного алфавита»,
zh_cn: 随机字母将一直移动，直到此参数表示的字母与参数“在有序字母的字母上”表示的有序字母的字母匹配为止

# Position2Caption
source: on ordered alphabet´s letter
de: nach
ru: на букву упорядоченного алфавита
zh_cn: 在订购的字母上

# Position2Tooltip
source: This parameter is used to shift the random alphabet.
de: Dieser Parameter gibt an, um wie viele Positionen das zufällige Alphabet verschoben werden soll.
ru: Этот параметр используется для сдвига случайного алфавита.
zh_cn: 此参数用于移动随机字母。

# UnorderedAlphabetPanelCaption
source: Random alphabet
de: Zufälliges Alphabet
ru: Случайный алфавит
zh_cn: 随机字母

# UnorderedAlphabetPanelTooltip
source: Spanish alphabet ordered randomly. The random order is defined by the keyword.
de: Zufällig geordnetes spanisches Alphabet. Die zufällige Reihenfolge wird durch das Schlüsselwort bestimmt.
ru: Испанский алфавит упорядочен случайным образом. Случайный порядок определяется ключевым словом.
zh_cn: 西班牙语字母随机排列。随机顺序由关键字定义。

# HomophonesTablesCaption
source: Homophones table
de: Homophonen-Tabelle
ru: Гомофоны настольные
zh_cn: 谐音表

# HomophonesTablesTooltip
source: Please select a homophones table.
de: Wählen Sie bitte eine Homophonen-Tabelle.
ru: Пожалуйста, выберите таблицу омофонов.
zh_cn: 请选择一个谐音表。

# HomophonesTablesList1
source: Random homophones table
de: Zufällige Homophonen-Tabelle
ru: Случайная таблица омофонов
zh_cn: 随机同音表

# HomophonesTablesList2
source: 90 homophones (10-99)
de: 90 Homophone (10-99)
ru: 90 омофонов (10-99)
zh_cn: 90个同音字（10-99）

# HomophonesTablesList3
source: 99 homophones (01-99)
de: 99 Homophone (01-99)
ru: 99 гомофонов (01-99)
zh_cn: 99个同音字（01-99）

# AlphabetsList1
source: Spanish alphabet (27 letters)
de: Spanisches Alphabet (27 Buchstaben)
ru: Испанский алфавит (27 букв)
zh_cn: 西班牙语字母（27个字母）

# AlphabetsList2
source: Spanish alphabet (29 letters - CH and LL included)
de: Spanisches Alphabet (29 Buchstaben, CH und LL inklusive)
ru: Испанский алфавит (29 букв - включены CH и LL)
zh_cn: 西班牙语字母（29个字母-包括CH和LL）

# AlphabetsTooltip
source: Select an alphabet.
de: Wählen Sie ein Alphabet.
ru: Выберите алфавит.
zh_cn: 选择一个字母。

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# AlphabetsCaption
source: Alphabet
ru: Алфавит
zh_cn: 字母

# OutputCaption
source: Output
de: Ausgabe
ru: Вывод
zh_cn: 输出量

# HomophoneSelectionCaption
source: Homophone selection
de: Auswahl der Homophone
ru: Выбор гомофонов
zh_cn: 同音字选择

# HomophoneSelectionList1
source: Random
de: Zufall
ru: случайный
zh_cn: 随机

# HomophoneSelectionList2
source: Round Robin
ru: По-круговой
zh_cn: 循环赛

# HomophoneSelectionTooltip
source: How should homophones be chosen from the list of possible homophones during encryption?
de: Bestimen Sie die Methode, wie Homophone bei der Verschlüsselung aus der Liste der möglichen Homophone ausgewählt werden sollen.
ru: Как следует выбирать гомофонов из списка возможных гомофонов во время шифрования?
zh_cn: 加密期间应如何从可能的同音字列表中选择同音字？
