Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/ImageProcessor/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionList1
source: No Action
de: keine Aktion
ru: Бездействие
zh_cn: 没有行动

# ActionList10
source: XOR-Connect Images
de: Bilder XOR-verknüpfen
ru: Изображения XOR-Connect
zh_cn: XOR-Connect图片

# ActionList11
source: Create Image
de: Bild erzeugen
ru: Создать изображение
zh_cn: 建立影像

# ActionList12
source: Crop Image
de: Bild beschneiden
ru: Обрезать изображение
zh_cn: 裁剪图片

# ActionList13
source: XOR GrayscaleImages
de: XOR Grayscale-Bild
zh_cn: XOR灰度图像

# ActionList14
source: Black and White
de: Schwarz-Weiß
ru: Черное и белое
zh_cn: 黑和白

# ActionList15
source: Image Contrast
de: Bildkontrast
ru: Контраст изображения
zh_cn: 影像对比

# ActionList2
source: Flip Image
de: Bild spiegeln
zh_cn: 翻转图像

# ActionList3
source: Gray Scale
de: Graustufen
ru: Серая шкала
zh_cn: 灰阶

# ActionList4
source: Smooth Image
de: Bild glätten
ru: Плавное изображение
zh_cn: 图像平滑

# ActionList5
source: Resize Image
de: Bildgröße ändern
ru: Изменить размер изображения
zh_cn: 调整图像大小

# ActionList6
source: Rotate Image
de: Bild rotieren
ru: Повернуть изображение
zh_cn: 旋转影像

# ActionList7
source: Invert Image
de: Bild invertieren
ru: Инвертировать изображение
zh_cn: 反转影像

# ActionList8
source: And-Connect Images
de: Bilder UND-verknüpfen
ru: И-Соединить изображения
zh_cn: 连接图像

# ActionList9
source: Or-Connect Images
de: Bilder ODER-verknüpfen
ru: Изображения
zh_cn: 或连接图像

# ActionTooltip
source: Select the action you want to perform on the images.
de: Wählen Sie die Aktion, die Sie auf das Bild anwenden wollen.
ru: Выберите действие, которое вы хотите выполнить на изображениях.
zh_cn: 选择要对图像执行的操作。

# ContrastCaption
source: Contrast
de: Kontrast
ru: контрастировать
zh_cn: 对比

# ContrastTooltip
source: Enter the value of the contrast.
de: Geben Sie den Wert für den Kontrast ein.
ru: Введите значение контраста.
zh_cn: 输入对比度的值。

# DegreesCaption
source: Degrees
de: Grad
ru: степени
zh_cn: 学位

# DegreesTooltip
source: Enter the degrees for the rotation.
de: Geben Sie an, um wieviel Grad das Bild gedreht werden soll.
ru: Введите градусы для вращения.
zh_cn: 输入旋转角度。

# FlipTypeCaption
source: Flip
de: Spiegeln
ru: кувырок
zh_cn: 翻转

# FlipTypeList2
source: Vertical
de: Vertikal
ru: вертикальный
zh_cn: 垂直

# FlipTypeTooltip
source: Flip the image horizontally or vertically
de: Spiegeln Sie das Bild horizontal oder vertikal.
ru: Переверните изображение по горизонтали или по вертикали
zh_cn: 水平或垂直翻转图像

# InputImage1Caption
source: InputImage1
de: Eingabebild 1

# InputImage1Caption2
source: InputImage2
de: Eingabebild 2

# InputImage1Tooltip
source: This is the standard image used for the processing.
de: Hier wird das für die Bildverarbeitung verwendete Bild eingegeben.
ru: Это стандартное изображение, используемое для обработки.
zh_cn: 这是用于处理的标准图像。

# InputImage1Tooltip2
source: This is the second image, only used for and-, or-, xor-functions.
de: Hier wird das zweite Bild eingegeben, falls die gewählte Aktion eine Verknüpfung zweier Bilder ist.
ru: Это второе изображение, которое используется только для and-, or-, xor-функций.
zh_cn: 这是第二张图像，仅用于“与”，“或”，“异或”功能。

# OutputFileFormatCaption
source: Output File Format
de: Ausgabebild-Format
ru: Формат выходного файла
zh_cn: 输出文件格式

# OutputFileFormatTooltip
source: Select the format of the output file.
de: Wählen sie aus, welches Format das Ausgabebild haben soll.
ru: Выберите формат выходного файла.
zh_cn: 选择输出文件的格式。

# OutputImageCaption
source: OutputImage
de: Ausgabebild

# OutputImageTooltip
source: This is the processed image.
de: Hier wird das bearbeitete Bild ausgegeben.
ru: Это обработанное изображение.
zh_cn: 这是经过处理的图像。

# PluginCaption
source: ImageProcessor
de: Bildverarbeitung
zh_cn: 图像处理器

# PluginTooltip
source: Processes and saves an image
de: Verarbeitet und speichert ein Bild
ru: Обрабатывает и сохраняет изображение
zh_cn: 处理并保存图像

# SizeXCaption
source: SizeX
de: Größe X
zh_cn: 尺寸X

# SizeXTooltip
source: Enter the value of horizontal pixels.
de: Geben Sie die Anzahl der horizontalen Pixel ein.
ru: Введите значение горизонтальных пикселей.
zh_cn: 输入水平像素的值。

# SizeYCaption
source: SizeY
de: Größe Y
zh_cn: 尺码Y

# SizeYTooltip
source: Enter the value of vertical pixels.
de: Geben Sie die Anzahl der vertikalen Pixel ein.
ru: Введите значение вертикальных пикселей.
zh_cn: 输入垂直像素的值。

# SliderX1Caption
source: Slider X1
de: Schieber X1
zh_cn: 滑块X1

# SliderX1Tooltip
source: Enter the value of left margin.
de: Geben Sie den Wert des linken Randes ein.
ru: Введите значение левого поля.
zh_cn: 输入左边距的值。

# SliderX2Caption
source: Slider X2
de: Schieber X2
zh_cn: 滑块X2

# SliderX2Tooltip
source: Enter the value of right margin.
de: Geben Sie den Wert des rechten Randes ein.
ru: Введите значение правого поля.
zh_cn: 输入右边距的值。

# SliderY1Caption
source: Slider Y1
de: Schieber Y1
ru: Ползунок Y1
zh_cn: 滑块Y1

# SliderY1Tooltip
source: Enter the value of top margin.
de: Geben Sie den Wert des oberen Randes ein.
ru: Введите значение верхнего поля.
zh_cn: 输入上边距的值。

# SliderY2Caption
source: Slider Y2
de: Schieber Y2
ru: Ползунок Y2
zh_cn: 滑块Y2

# SliderY2Tooltip
source: Enter the value of bottom margin.
de: Geben Sie den Wert des unteren Randes ein.
ru: Введите значение нижнего поля.
zh_cn: 输入底边距的值。

# SmoothCaption
source: Smooth
de: Glätten
ru: Гладкий; плавный
zh_cn: 光滑

# SmoothTooltip
source: Enter the smooth value.
de: Geben Sie den Glättungswert ein.
ru: Введите плавное значение.
zh_cn: 输入平滑值。

# ThresholdCaption
source: Threshold
de: Schwellenwert
ru: порог
zh_cn: 阈

# ThresholdTooltip
source: Enter the value of the threshold.
de: Geben Sie den Schwellenwert ein.
ru: Введите значение порога.
zh_cn: 输入阈值。

# FlipTypeList1
source: Horizontal
ru: горизонтальный
zh_cn: 卧式
