Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Primes/Primes/Properties/Resources.*.resx
Languages: de, zh_cn

# title_distribution
source: Distribution of prime numbers
de: Verteilung der Primzahlen in den natürlichen Zahlen
zh_cn: 质数的分布

# title_factorize
source: Factorization of numbers
de: Faktorisierung von Zahlen
zh_cn: 数字分解

# title_numberline
source: Distribution
de: Verteilung
zh_cn: 分配

# title_Numbertheory
source: Number theory
de: Zahlentheorie
zh_cn: 数论

# title_primecount
source: Prime number count
de: Anzahl der Primzahlen
zh_cn: 素数计数

# title_primesgeneration
source: Search for prime numbers
de: Erzeugung von Primzahlen
zh_cn: 搜索素数

# title_primespiral
source: Ulam spiral
de: Ulam-Spirale
zh_cn: 乌兰螺旋

# title_primetest
source: Prime number tests
de: Primzahltests
zh_cn: 素数测试

# title_primitivroot
source: Primitive root modulos
de: Primitivwurzeln von Primzahlen
zh_cn: 原始根模块

# title_start
source: World of Primes
de: Die Welt der Primzahlen Startseite
zh_cn: 素数世界

# title_soa
source: Sieve of Atkin
de: Sieb des Atkin
zh_cn: 阿特金筛

# PluginCaption
source: World of Primes
de: Die Welt der Primzahlen
zh_cn: 素数世界

# PluginTooltip
source: Properties and methods of prime numbers
de: Primzahlen: Methoden und Eigenschaften
zh_cn: 质数的性质和方法

# PrimesSettings
source: World of Primes
de: Die Welt der Primzahlen
zh_cn: 素数世界

source: Calculate Li(n) by using
de: Berechne Li(n) mittels
zh_cn: 通过使用计算Li（n）

# More
source: more information
de: weitere Informationen
zh_cn: 更多信息

source: Pari-GP
zh_cn: 巴黎大奖赛

source: Simpson formula
de: Simpson-Formel
zh_cn: 辛普森公式

source: Algorithms
de: Algorithmen
zh_cn: 演算法

# FL_F_factorization
source: Factorization of a number
de: Faktorisierung einer Zahl
zh_cn: 数的因式分解

# FL_F_numbertheory
source: Number theory
de: Zahlentheorie
zh_cn: 数论

# FL_F_primalitytest
source: Primality test
de: Primzahltests
zh_cn: 原始性测试

# FL_F_primedistribution
source: Distribution of primes
de: Verteilung der Primzahlen
zh_cn: 素数分布

# FL_F_primegeneration
source: Generation of primes
de: Erzeugung von Primzahlen
zh_cn: 素数的产生

# FL_P_atkin
source: Primality test\ Sieve of Atkin
de: Primzahltests\ Sieb des Atkin
zh_cn: 原始性检验\阿特金筛

# FL_P_bruteforce
source: Factorization\ Brute-force
de: Faktorisierung\ Probedivision
zh_cn: 分解\蛮力

# FL_P_eratosthenes
source: Primality test\ Sieve of Eratosthenes
de: Primzahltests\ Sieb des Eratosthenes
zh_cn: 素性测试\ Eratosthenes筛

# FL_P_goldbach
source: Number theory\ Goldbach's conjecture
de: Zahlentheorie\ Goldbach-Vermutung
zh_cn: 数论\哥德巴赫猜想

# FL_P_millerrabin
source: Primality test\ Miller-Rabin test
de: Primzahltests\ Miller-Rabin-Test
zh_cn: 素数检验\ Miller-Rabin检验

# FL_P_numbergrid
source: Distribution of primes\ Number grid
de: Verteilung der Primzahlen\ Zahlengitter
zh_cn: 素数\数字网格的分布

# FL_P_numberline
source: Distribution of primes\ Number line
de: Verteilung der Primzahlen\ Zahlengerade
zh_cn: 素数\数字线的分布

# FL_P_numberofprimes
source: Distribution of primes\ Number of primes
de: Verteilung der Primzahlen\ Anzahl der Primzahlen
zh_cn: 素数分布\素数

# FL_P_numbertheoryfunctions
source: Number theory\ Number-theoretic functions
de: Zahlentheorie\ Zahlentheoretische Funktionen
zh_cn: 数论\数论函数

# FL_P_powering_iteratingexponent
source: Number theory\ Powering (iterating exponent)
de: Zahlentheorie\ Potenzieren (laufender Exponent)
zh_cn: 数论\幂（迭代指数）

# FL_P_primegeneration
source: Generation of primes\ Generation of primes
de: Erzeugung von Primzahlen\ Erzeugung von Primzahlen
zh_cn: 素数生成\素数生成

# FL_P_primitiveroots
source: Number theory\ Primitive roots
de: Zahlentheorie\ Primitivwurzeln
zh_cn: 数论\原始根

# FL_P_qs
source: Factorization\ Quadratic Sieve
de: Faktorisierung\ Quadratisches Sieb
zh_cn: 分解\二次筛

# FL_P_ulam
source: Distribution of primes\ Ulam's spiral
de: Verteilung der Primzahlen\ Ulam-Spirale
zh_cn: 素数分布\ Ulam螺旋

# FL_P_powering_iteratingbase
source: Number theory\ Powering (iterating base)(RSA)
de: Zahlentheorie\ Potenzieren (laufende Basis)(RSA)
zh_cn: 数论\幂（迭代基础）（RSA）
