Repository: CrypToolProject/CrypTool-2
Catalog: Experimental/CrypPlugins/BlockmodeVisualizer/Properties/Resources.*.resx
Languages: de

# action_select
source: Action
de: Aktion

# action_select_tooltip
source: The action defines if the input data will be encrypted or decrypted.
de: Mit der Aktion kann eingestellt werden, ob der Eingabetext ver- oder entschlüsselt werden soll.

# ad_caption
source: Associated data
de: Assoziierte Daten

# ad_tooltip
source: The CCM and GCM mode can use so-called associated data for authentication additionally to the input data.
de: Die Betriebsmodi CCM und GCM können zusätzlich zum Eingabetext weitere, s.g. assoziierte, Daten für die Authentifizierung verwenden.

# authentication_error
source: The message could not be authenticated!
de: Die Nachricht konnte nicht authentifiziert werden!

# blockmode_select
source: Mode of Operation
de: Betriebsmodus

# blockmode_select_tooltip
source: For encryption and decryption the mode of operation for the selected blockcipher can be chosen.
de: Für die Ver- und Entschlüsselung kann hier eingestellt werden, mit welchem Betriebsmodus die Blockchiffre verwendet werden soll.

# cbc
source: Cipher Block Chaining Mode (CBC)
de: Cipher Block Chaining Modus (CBC)

# ccm
source: Counter with CBC-MAC Mode (CCM)
de: Counter mit CBC-MAC Modus (CCM)

# cfb
source: Cipher Feedback Mode (CFB)
de: Cipher Feedback Modus (CFB)

# ctr
source: Counter Mode (CTR)
de: Counter Modus (CTR)

# datasegment_length_input
source: Data segment length (in byte)
de: Datensegment-Länge (in Byte)

# datasegment_length_input_tooltip
source: For the CFB mode only a part of the ciphertext, the so-called data segment, will be used for the next block. Its length must not exceed the blocksize of the selected blockcipher.
de: Im CFB-Modus wird nur ein Teil des Geheimtexts, das Datensegment, für den nächsten Block verwendet. Die Länge des Datensegments muss kleiner oder gleich der Blockgröße der verwendeten Blockchiffre sein.

# data_segment_overflow_warning
source: The length of the data segment is too long. The actual length is:
de: Es wurde eine zu große Länge für das Datensegment eingestellt. Die korrigierte Länge ist:

# decrypt
source: Decryption
de: Entschlüsselung

# ecb
source: Electronic Codebook Mode (ECB)
de: Electronic Codebook Modus (ECB)

# encrypt
source: Encryption
de: Verschlüsselung

# gcm
source: Galois/Counter Mode (GCM)
de: Galois/Counter Modus (GCM)

# icontrol_caption
source: Blockcipher
de: Blockchiffre

# icontrol_tooltip
source: The selected blockcipher will be used in the chosen mode of operation for encryption or decryption.
de: Die ausgewählte Blockchiffre wird mit dem eingestellten Betriebsmodus verwendet, um den Eingabetext zu ver- oder entschlüsseln.

# iv_caption
source: Initialization vector
de: Initialisierungsvektor

# iv_tooltip
source: Every mode of operation but the ECB mode needs an initializing value for its first block or the counter.
de: Mit Ausnahme des ECB-Modus benötigt jeder Betriebsmodus einen Startwert für den ersten Block oder den Zähler.

# key_caption
source: Key
de: Schlüssel

# key_tooltip
source: The key will be used for the selected blockcipher. Its length is determined by the chosen blockcipher.
de: Der Schlüssel wird von der ausgewählten Blockchiffre verwendet. Die Schlüssellänge wird durch die Chiffre vorgegeben.

# long_ad_warning
source: The provided associated data are too long and have been trimmed:
de: Die assoziierten Daten sind zu lang und wurden entsprechend gekürzt:

# long_input_warning
source: The provided input text is too long and has been trimmed:
de: Der Eingabetext ist zu lang und wurde entsprechend gekürzt:

# long_iv_warning
source: The provided initialization vector is too long and has been trimmed:
de: Der Initialisierungsvektor ist zu lang und wurde entsprechend gekürzt:

# long_key_warning
source: The provided key is too long and has been trimmed:
de: Der Schlüssel ist zu lang und wurde entsprechend gekürzt:

# missing_blockcipher_warning
source: No blockcipher selected. Encryption or decryption not possible!
de: Es wurde keine Blockchiffre ausgewählt. Ver- oder Entschlüsselung sind nicht möglich!

source: None
de: Keine

# ofb
source: Output Feedback Mode (OFB)
de: Output Feedback Modus (OFB)

# padding_select
source: Padding
de: Auffüllmethode

# padding_select_tooltip
source: The padding extends the input text if it's too short. The ECB and CBC mode require an input whose length is a multiple of the blockcipher's blocksize.
de: Mit Hilfe einer Auffüllmethode (Padding) können zu kurze Eingabetexte auf passende Längen aufgefüllt werden. Die Betriebsmodi ECB und CBC benötigen Eingaben, deren Längen ein Vielfaches der Blockgröße der verwendeten Blockchiffre sind.

# plugin_caption
source: Blockmode Visualizer
de: Betriebsmodus-Visualisierer

# plugin_tooltip
source: The Blockmode Visualizer can execute symmetric blockciphers in different modes of operation and visualize their operating principles graphically.
de: Mit dem Betriebsmodus-Visualisierer lassen sich symmetrische Blockchiffren mit unterschiedlichen Betriebsmodi verwenden und deren Funktionsweise grafisch darstellen.

# short_ad_warning
source: The provided associated data are too short and have been padded with zeros:
de: Die assoziierten Daten sind zu kurz und wurden entsprechend mit Nullen aufgefüllt:

# short_input_warning
source: The input text is too short and has been padded with zeros:
de: Der Eingabetext ist zu kurz und wurde entsprechend mit Nullen aufgefüllt:

# short_iv_warning
source: The provided initialization vector is too short and has been padded with zeros:
de: Der Initialisierungsvektor ist zu kurz und wurde entsprechend mit Nullen aufgefüllt:

# short_key_warning
source: The provided key is too short and has been padded with zeros:
de: Der Schlüssel ist zu kurz und wurde entsprechend mit Nullen aufgefüllt:

# not_yet_implemented_exception
source: The selected blockmode is not yet implemented.
de: Der ausgewählte Betriebsmodus wurde noch nicht implementiert.

# tag_input_caption
source: Authentication tag input
de: Nachrichten-Tag Eingabe

# tag_input_tooltip
source: This input accepts the message authentication tag for authenticating the message in CCM or GCM mode only.
de: Für die Authentifizierung der Nachricht im CCM- und GCM-Modus wird hier das empfangene Nachrichten-Authentifizierungs-Tag eingegeben.

# tag_length
source: Tag length (in byte)
de: Tag-Länge (in Byte)

# tag_length_overflow_warning
source: The length of the message authentication tag exceeds the blocksize. The actual length is:
de: Es wurde eine zu große Länge für das Nachrichten-Tag eingestellt. Die korrigierte Länge ist:

# tag_length_tooltip
source: The length of the message authentication tag must not exceed the blocksize of the selected blockcipher.
de: Die Länge des zu berechnenden Nachrichten-Tags darf höchstens so groß sein wie die Blockgröße der verwendeten Chiffre.

# tag_output_caption
source: Authentication tag output
de: Nachrichten-Tag Ausgabe

# tag_output_tooltip
source: The message authentication tag will be generated in the CCM or GCM mode only.
de: Im CCM- und GCM-Modus wird hier das Nachrichten-Authentifizierungs-Tag ausgegeben.

# text_input_caption
source: Input text
de: Eingabetext

# text_input_tooltip
source: This input accepts the plaintext for encryption respectively the ciphertext for decryption.
de: Für die Verschlüsselung wird hier der Klartext eingegeben. Für die Entschlüsselung entsprechend der Geheimtext.

# text_output_caption
source: Output text
de: Ausgabetext

# text_output_tooltip
source: This output displays the ciphertext after encryption respectively the plaintext after decryption.
de: Nach der Verschlüsselung wird hier der Geheimtext ausgegeben. Nach der Entschlüsselung entsprechend der Klartext.

# xts
source: XEX with tweak and ciphertext stealing (XTS)
de: XEX mit Tweak und Ciphertext-Stealing (XTS)

source: Zeros
de: Nullen

# pres_headline_conjunction
source: in the
de: im

# pres_headline_mode
source: mode
de: -Modus

# pres_headline_decryption
source: decryption
de: -Entschlüsselung

# pres_headline_encryption
source: encryption
de: -Verschlüsselung
