Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Caesar/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: Caesar
ru: Цезарь
zh_cn: es撒

# PluginTooltip
source: Classic alphabet shift substitution cipher
de: Caesar – Klassische Substitutions-Verschlüsselung durch Alphabet-Verschiebung
ru: Классический алфавитный сдвиг
zh_cn: 经典字母移位替换密码

# InputStringCaption
source: Text input
de: Texteingabe
ru: Ввод текста
zh_cn: 文字输入

# InputStringTooltip
source: Input a string to be processed by the Caesar cipher
de: Geben Sie den Text ein, der mit dem Caesar-Verfahren ver-/entschlüsselt werden soll.
ru: Введите строку, подлежащую обработке с помощью цезарного шифра
zh_cn: 输入要由凯撒密码处理的字符串

# OutputStringCaption
source: Text output
de: Ausgabetext
ru: Вывод текста
zh_cn: 文字输出

# OutputStringTooltip
source: The string after processing with the Caesar cipher
de: Der mit der Caesar-Verfahren ver-/entschlüsselte Text
ru: Строка после обработки с помощью цезарного шифра
zh_cn: 用凯撒密码处理后的字符串

# InputAlphabetCaption
source: External alphabet input
de: Eingabe-Alphabet
ru: Вход внешнего алфавита
zh_cn: 外部字母输入

# InputAlphabetTooltip
source: Input a string containing the alphabet which should be used by Caesar. If no alphabet is provided on this input, the internal alphabet will be used.
de: Geben Sie die Zeichen an, aus denen das Eingabe-Alphabet für Caesar bestehen soll. Wenn hier nichts angegeben wird, dann wird das interne Alphabet verwendet (A-Z).
ru: Введите строку, содержащую алфавит, который должен использоваться Цезарем. Если на этом входе нет алфавита, будет использоваться внутренний алфавит.
zh_cn: 输入包含凯撒应该使用的字母的字符串。如果此输入中未提供字母，则将使用内部字母。

# ShiftKeyCaption
source: Shift value (integer)
de: Verschiebung (Zahl)
ru: Значение сдвига (целое число)
zh_cn: 移位值（整数）

# ShiftKeyTooltip
source: Same setting as Shift value in Settings-Pane but as dynamic input.
de: Geben Sie die Anzahl der Positionen ein, um die jedes Zeichen des Eingabetextes verschoben werden soll. Z.B. bedeutet ein Wert von 1 für den Schlüssel, dass das Klartextzeichen B durch das Geheimzeichen C ersetzt wird, usw.
ru: Та же настройка, что и значение сдвига в области настроек, но как динамический вход.
zh_cn: 与“设置”窗格中的“移位”值相同的设置，但与动态输入相同。

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionTooltip
source: Select the Algorithm action
de: Wählen Sie die Betriebsart des Plugins.
ru: Выберите действие «Алгоритм»
zh_cn: 选择算法动作

# ActionTPCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionTPTooltip
source: Select the Algorithm action
de: Wählen Sie die Betriebsart des Plugins.
ru: Выберите действие «Алгоритм»
zh_cn: 选择算法动作

# AlphabetCaseCaption
source: Case sensitive
de: Groß-/Kleinschreibung unterscheiden
ru: Деликатный случай
zh_cn: 区分大小写

# AlphabetCaseTooltip
source: Should upper and lower case be treated differently? (a != A)
de: Bei einer Unterscheidung wächst das Alphabet von 26 auf 52 Zeichen. Ohne Unterscheidung werden vor der Verschlüsselung die Kleinbuchstaben den Großbuchstaben zugeordnet.
ru: Следует ли обрабатывать верхний и нижний регистр по-разному? (a! = A)
zh_cn: 大写和小写应该区别对待吗？ （一个！=一个）

# AlphabetSymbolsCaption
source: Alphabet
ru: Алфавит
zh_cn: 字母

# AlphabetSymbolsTooltip
source: This is the used alphabet.
de: Verwendetes Eingabe-Alphabet
ru: Это используемый алфавит.
zh_cn: 这是使用的字母。

# ShiftValueCaption
source: Key as integer
de: Schlüssel als Zahl
ru: Ключ как целое
zh_cn: 键为整数

# ShiftValueTooltip
source: Enter the number of letters to shift. For instance a value of 1 means that the plaintext character a gets mapped to the ciphertext character B, b to C and so on.
de: Geben Sie die Anzahl der Positionen ein, um die jedes Zeichen des Eingabetextes verschoben werden soll. Z.B. bedeutet ein Wert von 1 für den Schlüssel, dass das Klartextzeichen B durch das Geheimzeichen C ersetzt wird, usw.
ru: Введите количество сдвигаемых букв. Например, значение 1 означает, что символ незашифрованного текста a сопоставляется с символом B шифрования B, b и C и т. Д.
zh_cn: 输入要转换的字母数。例如，值1表示明文字符a映射到密文字符B，b映射到C，依此类推。

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Behandlung ungültiger Zeichen
ru: Неизвестная обработка символов
zh_cn: 未知符号处理

# UnknownSymbolHandlingTooltip
source: What should be done with encountered characters at the input which are not in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
ru: Что нужно делать с встречающимися символами на входе, которые не находятся в алфавите?
zh_cn: 如果输入中遇到的字符不是字母，该怎么办？

# ActionList1
source: Encrypt
de: Verschlüsselung
ru: шифровать
zh_cn: 加密

# ActionList2
source: Decrypt
de: Entschlüsselung
ru: расшифровывать
zh_cn: 解密

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (nicht ändern)
ru: Игнорировать (оставить без изменений)
zh_cn: 忽略（保留未修改的内容）

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen
ru: Удалить
zh_cn: 去掉

# UnknownSymbolHandlingList3
source: Replace with '?'
de: Ersetzen durch '?'
ru: Заменить '?'
zh_cn: 用。。。来代替 &#39;？&#39;

# ShiftStringCaption
source: Character mapping
de: Zeichenzuordnung
ru: Отображение символов
zh_cn: 字符映射

# ShiftStringTooltip
source: This shows how a single character will be mapped with the current alphabet and shift key.
de: Zeigt die Zeichenzuordnung für ein einzelnes Zeichen des Eingabe-Alphabetes für die angegebene Verschiebung.
ru: Это показывает, как один символ будет отображаться с помощью текущего алфавита и клавиши переключения.
zh_cn: 这显示了如何使用当前字母和Shift键映射单个字符。

# ShiftCharCaption
source: Shift key (single letter)
ru: Клавиша сдвига (одна буква)
zh_cn: Shift键（单个字母）

# ShiftCharTooltip
source: Enter a single letter as the key.
ru: Введите одну букву в качестве ключа.
zh_cn: 输入一个字母作为密钥。

# AlphabetGroup
source: Alphabet parameters
de: Alphabet-Parameter
ru: Параметры алфавита
zh_cn: 字母参数

# MemorizeCaseCaption
source: Output contains Source Case
de: Ausgabeanzeige kennt ursprüngliche Groß-/Kleinschreibung
ru: Выход содержит исходный код
zh_cn: 输出包含源案例

# MemorizeCaseTooltip
source: Even the lowercase letters where mapped to uppercase letters (so that an "a" is processed like an "A") the old spelling of the letters remains
de: Obwohl die Kleinbuchstaben vor der Verschlüsselung einander zu geordnet wurden (so dass ein "a" wie ein "A" behandelt wird), merkt sich das Programm, welche Schreibweise der Buchstabe hatte und stellt ihn in der Ausgabe entsprechend dar
ru: Даже буквы в нижнем регистре, где отображаются буквы верхнего регистра (так, что «a» обрабатывается как «A»), сохраняется старое написание букв
zh_cn: 甚至将小写字母映射到大写字母（以便像处理“ A”一样处理“ a”），仍然保留字母的旧拼写
