Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/WEPAttacks/WEPAttacks/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# ActionCaption
source: Kind of attack
de: Art des Angriffes
ru: Вид атаки
zh_cn: 攻击种类

# ActionTooltip
source: Kind of attack
de: Art des Angriffes
ru: Вид атаки
zh_cn: 攻击种类

# FileOrNotCaption
source: Data comes from file
de: Daten kommen aus einer Datei
ru: Данные поступают из файла
zh_cn: 数据来自文件

# FileOrNotTooltip
source: Does the data come from file or not?
de: Kommen die Daten aus einer Datei?
ru: Имеются ли данные из файла или нет?
zh_cn: 数据是否来自文件？

# InputStreamCaption
source: Input stream
de: Eingabedatenstrom
ru: Входной поток
zh_cn: 输入流

# InputStreamTooltip
source: Encrypted WEP packets
de: Verschlüsselte WEP-Pakete
ru: Шифрованные WEP-пакеты
zh_cn: 加密的WEP数据包

# OutputStreamCaption
source: Output stream
de: Ausgabedatenstrom
ru: Выходной поток
zh_cn: 输出流

# OutputStreamTooltip
source: Decrypted frames
de: Entschlüsselte Frames
ru: Расшифрованные фреймы
zh_cn: 解密帧

# PluginCaption
source: Attacks on the WEP Protocol
de: Angriffe auf das WEP-Protokoll
ru: Атаки по протоколу WEP
zh_cn: 对WEP协议的攻击

# PluginTooltip
source: Implements different attacks on the WEP protocol
de: Implementiert verschiedene Angriffe auf das WEP-Protokoll
ru: Реализует различные атаки на протокол WEP.
zh_cn: 对WEP协议的攻击

# SuccessCaption
source: Success
de: Erfolg
ru: успех
zh_cn: 成功

# SuccessTooltip
source: Indicates if attack was successful or not
de: Zeigt an, ob der Angriff erfolgreich war
ru: Указывает, была ли атака успешной или нет
zh_cn: 指示攻击是否成功

# ActionList2
source: KoreK
ru: пробка
zh_cn: 插头

# FileOrNotList1
source: Data comes from file
de: Daten kommen aus einer Datei
ru: Данные поступают из файла
zh_cn: 数据来自文件

# Aborted_after
source: Aborted after [h:min:sec]:
de: Abgebrochen nach [h:min:sec]:
ru: Прервано после [ч: мин: сек]:
zh_cn: [h：min：sec]后中止：

# Attack_FMS
source: FMS attack running...
de: FMS-Angriff läuft...
ru: Атака FMS работает ...
zh_cn: FMS攻击正在运行...

# Attack_KoreK
source: KoreK attack running...
de: KoreK-Angriff läuft...
ru: Атака KoreK работает ...
zh_cn: 正在运行KoreK攻击...

# Attack_None
source: No attack running.
de: Kein Angriff läuft.
ru: Нет атаки.
zh_cn: 没有攻击在运行。

# Attack_PTW
source: PTW attack running...
de: PTW-Angriff läuft...
ru: Атака PTW работает ...
zh_cn: PTW攻击正在运行...

# Could_not_recover_key
source: Could not recover key. Maybe you need more packets for a successful attack.
de: Schlüssel nicht gefunden.
ru: Не удалось восстановить ключ. Возможно, вам нужно больше пакетов для успешной атаки.
zh_cn: 无法恢复密钥。也许您需要更多数据包才能成功进行攻击。

# FMS_more_packets
source: For a 104 bit key and a FMS attack you need usually 3 - 4 mio. encrypted packets.
de: Für einen 104-bit-Schlüssel und einen FMS-Angriff brauchen Sie normalerweise 3 - 4 Mio. verschlüsselte Pakete.
ru: Для 104-битного ключа и FMS-атаки вам обычно требуется 3 - 4 млн. зашифрованные пакеты.
zh_cn: 对于104位密钥和FMS攻击，通常需要3-4 mio。加密的数据包。

# KoreK_more_packets
source: For a KoreK attack you need usually 500.000 - 1 mio. encrypted packets.
de: Für einen KoreK-Angriff brauchen Sie normalerweise 500.000 - 1 Mio. verschlüsselte Pakete.
ru: Для атаки KoreK вам обычно требуется 500 000 - 1 миллион. зашифрованные пакеты.
zh_cn: 对于KoreK攻击，通常需要500.000-1 mio。加密的数据包。

# Maybe_you_need_more_packets
source: Maybe you need more packets for a successful attack.
de: Vielleicht brauchen Sie mehr Pakete für einen erfolgreichen Angriff.
ru: Возможно, вам нужно больше пакетов для успешной атаки.
zh_cn: 也许您需要更多数据包才能成功进行攻击。

# Maybe_you_need_more_packets_104
source: Maybe you need more packets. For a 104 bit key you usually need 100.000 ARP packets or a few more IP packets.
de: Vielleicht brauchen Sie mehr Pakete. Für einen 104-bit-Schlüssel brauchen Sie normalerweise 100.000 ARP- oder etwas mehr IP-Pakete.
ru: Возможно, вам нужно больше пакетов. Для 104-битного ключа вам обычно требуется 100 000 ARP-пакетов или несколько IP-пакетов.
zh_cn: 也许您需要更多的数据包。对于104位密钥，通常需要100.000 ARP数据包或更多IP数据包。

source: Possible key
de: Möglicher Schlüssel
ru: Возможный ключ
zh_cn: 可能的钥匙

source: Possible key found after using {0} packets!
de: Möglicher Schlüssel gefunden nach {0} Paketen!
ru: Возможный ключ, найденный после использования {0} пакетов!
zh_cn: 使用{0}数据包后找到可能的密钥！

source: Probably it is a strong key.
de: Vermutlich ist es ein starker Schlüssel.
ru: Наверное, это сильный ключ.
zh_cn: 可能这是一个强大的关键。

source: Sniffed packets:
de: Gelesene Pakete:
ru: Понюханные пакеты:
zh_cn: 嗅探到的数据包：

# Time_used
source: Time used [h:min:sec]:
de: Benötigte Zeit [h:min:sec]:
ru: Используемое время [ч: мин: сек]:
zh_cn: 使用时间[h：min：sec]：

source: Used packets:
de: Verwendete Pakete:
ru: Используемые пакеты:
zh_cn: 已使用的数据包：
