Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Primes/Primes/Resources/lang/Numbertheory/Numbertheory.*.resx
Languages: de

# copy_savetable
source: Save whole table to file
de: Gesamte Tabelle in Datei speichern

# copy_selectedrow
source: Copy selected row to clipboard
de: Markierte Zeile in die Zwischenablage kopieren

# copy_table
source: Copy whole table to clipboard
de: Gesamte Tabelle in die Zwischenablage kopieren

# eulerphi
source: Euler's totient function
de: Eulersche Phi-Funktion

# eulerphisum
source: Sum of divisor totients
de: Teilersummenformel

# eulerphivalues
source: List of coprimes
de: Liste der Teilerfremden

# exteuclid
source: Extended Euclidean algorithm
de: Erweiterter euklidischer Algorithmus

# gcd
source: Greatest common divisor
de: Größter gemeinsamer Teiler

# goldbach_desc
source: y(n) is the number of ways that the number n can be expressed as the sum of two prime numbers. Example: 10 = 3 + 7 and 10 = 5 + 5, thus y(10)=2.
de: y(n) gibt an, auf wie viele Arten sich die Zahl n als Summe zweier Primzahlen schreiben lässt. Beispiel: 10 = 3 + 7 und 10 = 5 + 5, also ist y(10)=2.

# goldbach_sum
source: sum
de: Summe

# goldbach_sums
source: sums
de: Summen

# groupbox_choosefunctions
source: Choose functions
de: Auswahl der zu berechnenden Funktionen

# groupbox_input
source: Input
de: Eingabe

# invalidnumber
source: {0} does not lie between {1} und {2} and is not evaluated further.
de: {0} ist keine Zahl zwischen {1} und {2}. Sie wird daher nicht weiter ausgewertet.

# lcm
source: Least common multiple
de: Kleinstes gemeinsames Vielfaches

# modinv
source: Modular multiplicative inverse
de: Modulare multiplikative Inverse

# pix
source: Number of primes
de: Anzahl der Primzahlen

# powermod_base
source: Base
de: Basis

# powermod_max_base
source: Max. base
de: Max. Basis

# powermod_btncancel
source: Cancel
de: Abbrechen

# powermod_btnexecute
source: Execute
de: Ausführen

# powermod_btnnextstep
source: Next step
de: Nächster Schritt

# powermod_btnresume
source: Continue with automatic execution
de: Weiter mit automatischer Ausführung

# powermod_ccw
source: anti-clockwise
de: gegen den Uhrzeigersinn

# powermod_cw
source: clockwise
de: im Uhrzeigersinn

# powermod_cycle_length
source: Cycle length: {0}
de: Zykluslänge: {0}

# powermod_cycle_duplicate_values
source: (cycle contains duplicate values)
de: (Zyklus beinhaltet doppelte Werte)

# powermod_inputgroupbox
source: Input parameter
de: Eingabeparameter

# powermod_points
source: Point order
de: Anordnung der Punkte

# powermod_progress
source: Progress
de: Fortschritt

# powermod_rsa_description
source: Typical parameters for RSA: (N, e) = (33, 3), (55, 7), (143, 23)
de: Typische Parameter für RSA: (N, e) = (33, 3), (55, 7), (143, 23)

# powermod_cycle_length_description
source: The maximum cycle length is phi(N). It can be reached for the multiplicative group Z*_N, e.g. with N=11 and b=2 or b=6: phi(N)=10.
de: Die maximale Zykluslänge ist phi(N). Sie kann für die multiplikative Gruppe Z*_N erreicht werden, z.B. mit N=11 und b=2 oder b=6: phi(N)=10.

# powermod_missing_values
source: Missing values: {0}
de: Fehlende Werte: {0}

# powermod_no_missing_values
source: No values are missing.
de: Es fehlen keine Werte.

# powermod_rbautomatic
source: automatic execution
de: Automatische Ausführung

# powermod_stepwise
source: stepwise execution
de: Schrittweise Ausführung

# proot_btnCancel
source: Cancel
de: Abbrechen

# proot_btnExecute
source: Execute
de: Auswerten

# proot_btnSkipCalculation
source: Skip current calculation
de: Die aktuelle Berechnung überspringen

# proot_calculating
source: Calculating the roots...
de: Primitivwurzeln werden berechnet...

# proot_genprimes
source: Generate primes
de: Primzahlen generieren

# proot_input
source: Input
de: Eingabe

# proot_insert
source: Please enter a number
de: Bitte geben Sie etwas ein.

# proot_noprime
source: {0} is not a prime.
de: {0} ist keine Primzahl. Sie wird daher nicht weiter ausgewertet.

# proot_noprimes
source: No primes were found in the given interval(s).
de: Die angegebenen Intervalle enthalten keine Primzahlen.

# proot_novalidnumber
source: {0} is not a number between {1} and {2}.
de: {0} ist keine Zahl zwischen {1} und {2}. Sie wird daher nicht weiter ausgewertet.

# proot_printing
source: Printing...
de: Ausgabe...

# proot_progress
source: Progress
de: Fortschritt

# proot_rangeboth
source: Please enter the interval boundaries.
de: Bitte geben Sie beide Intervall-Grenzen an.

# proot_rangedown
source: Please enter the interval boundaries. The number {0} is interpreted as the lower boundary of a closed interval, the upper boundary is still missing.
de: Bitte geben Sie beide Intervall-Grenzen an. Die Zahl {0} wird als Untergrenze eines geschlossenen Intervalls interpretiert. Es fehlt noch die Eingabe für die Obergrenze.

# proot_rangeupper
source: Please enter the interval boundaries. The number {0} is interpreted as the upper boundary of a closed interval, the lower boundary is still missing.
de: Bitte geben Sie beide Intervall-Grenzen an. Die Zahl {0} wird als Obergrenze eines geschlossenen Intervalls interpretiert. Es fehlt noch die Eingabe für die Untergrenze.

# proot_result
source: Result
de: Ergebnis

# proot_resultcalc
source: {0} has {1} primitive root
de: {0} hat {1} Primitivwurzel

# proot_resultscalc
source: {0} has {1} primitive roots
de: {0} hat {1} Primitivwurzeln

# proot_skip
source: The calculation was skipped.
de: Die Berechnung wurde abgebrochen.

# proot_warningbiginterval
source: Warning: The interval {0} contains big numbers for which the calculation may take some time.
de: Warnung: Das Intervall {0} enthält große Zahlen, für die die Berechnung sehr lange dauern kann.

# proot_warningbignumber
source: Warning: For big numbers like {0} the calculation may take some time.
de: Warnung: Für große Zahlen wie {0} kann die Berechnung sehr lange dauern.

# proot_wronginterval
source: The first number of the interval {0} has to be smaller than the second.
de: Die erste Zahl des Intervalls {0} muss kleiner sein als die zweite.

# secondparametermissing
source: You selected a function that requires the second parameter.
de: Sie haben eine Funktion ausgewählt, die den zweiten Parameter benötigt.

# sigma
source: Sum of divisors
de: Summe der Teiler

# tabitemheader_goldbach
source: Goldbach's conjecture
de: Goldbach-Vermutung

# tabitemheader_ntfunctions
source: Number-theoretic functions
de: Zahlentheoretische Funktionen

# tabitemheader_power
source: Powering (iterating exponent)
de: Potenzieren (laufender Exponent)

# tabitemheader_powerBase
source: Powering (iterating base)(RSA)
de: Potenzieren (laufende Basis)(RSA)

# tabitemheader_proots
source: Primitive roots
de: Primitivwurzeln

# tau
source: Number of divisors
de: Anzahl der Teiler

# tauvalues
source: List of divisors
de: Liste der Teiler
