Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/TextSteganography/Properties/Resources.*.resx
Languages: de, zh_cn

# ActionCaption
source: Action
de: Aktion
zh_cn: 行动

# ActionList1
source: Hide
de: Verstecken
zh_cn: 隐藏

# ActionList2
source: Extract
de: Extrahieren
zh_cn: 提取

# ActionTooltip
source: Select the action type
de: Wählen Sie die Aktion
zh_cn: 选择动作类型

# CoverTextCaption
source: Cover Text
zh_cn: 封面文字

# CoverTextTooltip
source: Text used to hide the secret message
de: Text, in dem die geheime Nachricht versteckt wird
zh_cn: 隐藏秘密信息的文字

# DotAbove
source: Dot above the letter
de: Punkt über dem Buchstaben
zh_cn: 点以上字母

# DotUnder
source: Dot under the letter
de: Punkt unter dem Buchstaben
zh_cn: 字母下的圆点

# MarkingCaption
source: Marking
de: Markierung
zh_cn: 打标

# MarkingTooltip
source: Choose how the letters should be marked
de: Wählen Sie aus, wie die Buchstaben markiert werden sollen
zh_cn: 选择字母的标记方式

# ModeCaption
source: Mode
de: Modus
zh_cn: 模式

# ModeTooltip
source: Choose how the message will be hidden/extracted
de: Wählen Sie aus, welcher Modus für das Verstecken/Extrahieren benutzt werden soll
zh_cn: 选择如何隐藏/提取消息

# NotAllMessageHidden1
source: Not all of the secret message could be hidden because not all letters of the message were found in the cover text in an ordered way.
de: Die geheime Nachricht konnte nicht komplett versteckt werden, da nicht alle Buchstaben der Nachricht in geordneter Weise im Cover-Text gefunden wurden.
zh_cn: 并非所有秘密消息都可以被隐藏，因为并非所有消息的字母都以有序方式在封面文本中找到。

# NotAllMessageHidden2
source: Not all of the secret message could be hidden, because cover text length is shorter than the number of bits of the secret message
de: Die geheime Nachricht konnte nicht komplett versteckt werden, da die Länge des Cover-Texts kürzer als die Anzahl der Bits der geheimen Nachricht ist
zh_cn: 并非所有的秘密消息都可以隐藏，因为封面文字的长度比秘密消息的位数短

# OffsetTooltip
source: Enter the index, where the zero width spaces should be inserted, this value should be between 0 and the length of the cover text.
de: Geben Sie einen Index an, an welcher Stelle die Leerzeichen hinzugefügt werden sollen. Dieser Wert muss zwisch 0 und der Länge des Covertexts liegen.
zh_cn: 输入索引，在该索引中应插入零宽度空格，该值应介于0和封面文字的长度之间。

# PluginCaption
source: Text Steganography
de: Text-Steganografie
zh_cn: 文字隐写术

# PluginTooltip
source: Hide secret message inside Text
de: Geheime Nachricht in Text verstecken
zh_cn: 在文本内隐藏秘密消息

# SecretMessageInputCaption
source: Secret message Input
de: Geheime Nachricht als Eingabe
zh_cn: 秘密信息输入

# SecretMessageInputTooltip
source: Secret message to be hidden
de: Geheime Nachricht, die versteckt werden soll
zh_cn: 隐藏的秘密讯息

# SecretMessageOutputCaption
source: Secret message Output
de: Geheime Nachricht als Ausgabe
zh_cn: 秘密信息输出

# SecretMessageOutputTooltip
source: Secret message extracted from cover text
de: Extrahierte geheime Nachricht
zh_cn: 从封面文字中提取秘密消息

# ShowMessageBitsCB
source: Show message bits
de: Nachrichtenbits anzeigen
zh_cn: 显示消息位

# StegoTextCaption
source: Steg Text
de: Steganografie-Text
zh_cn: 步骤文字

# StegoTextTooltip
source: Cover Text with secret message encoded
de: Cover-Text, kodiert mit der geheimen Nachricht
zh_cn: 带有秘密消息编码的封面文字

# ZeroWidthText
source: Zero Width Spaces not shown in the output text.
de: Leerzeichen ohne Breite, die in der Textausgabe nicht angezeigt werden.
zh_cn: 零宽度空格未在输出文本中显示。
