Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/HKDFSHA256/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: HKDF SHA-256
zh_cn: 港币基金SHA-256

# HKDFSHA256Tooltip
source: Visualization of the Key Derivation Function HKDF SHA-256
de: Visualisierung der Schlüsselgenerierungs-Funktion HKDF SHA-256
ru: Визуализация функции деривации ключа HKDF SHA-256
zh_cn: 密钥派生函数HKDF SHA-256的可视化

# ConfigInfinityOutput
source: Orientate implementation to RFC 5869
de: Implementierung gemäß RFC 5869
ru: Ориентация на RFC 5869
zh_cn: 将实现定向到RFC 5869

# ConfigInfinityOutputTooltip
source: Configuration is based on RFC 5869. This means that an 8-bit counter is used and the length of the output bytes is limited to 8192. Further information can be found in the help.
de: Implementierung gemäß RFC 5869. Das heißt, es wird ein 8-bit-Zähler (Counter) verwendet und die Länge der Ausgabebytes ist auf 8192 beschränkt. Weitere Informationen sind in der Hilfe zu finden.
ru: Конфигурация основана на RFC 5869. Это означает, что используется 8-разрядный счетчик, а длина выходных байтов ограничена 8192. Дополнительная информация может быть найдена в справке.
zh_cn: 配置基于RFC5869。这意味着使用8位计数器，并且输出字节的长度限制为8192。可以在帮助中找到更多信息。

# ConfigPresCaption
source: Explain the HKDF SHA-256
de: Präsentation aktiv?
ru: Объясните HKDF SHA-256
zh_cn: 解释HKDF SHA-256

# ConfigPresTooltip
source: Activates or deactivates the explanations
de: Aktiviert oder deaktiviert die Präsentation der Komponente
ru: Активирует или деактивирует объяснения
zh_cn: 激活或取消激活说明

# ConfigPrintKMToFileCaption
source: Save generated key material to file
de: Generiertes Schlüsselmaterial in Datei speichern
ru: Сохранение сгенерированного ключевого материала в файл
zh_cn: 将生成的密钥材料保存到文件

# ConfigPrintKMToFileTooltip
source: Defines, that the generated key material will be saved to a file, so that it can be used in other tools.
de: Legt fest, dass das generierte Schlüsselmaterial in einer Datei gespeichert wird, um dieses eventuell in anderen Tools zu verwenden
ru: Определяет, что сгенерированный материал ключа будет сохранен в файл, чтобы его можно было использовать в других инструментах.
zh_cn: 定义将生成的密钥材料保存到文件中，以便可以在其他工具中使用。

# InputSaltCaption
source: Salt
ru: Поваренная соль
zh_cn: 盐

# InputSaltToolTip
source: Input of the salt
de: Eingabe des Salt
ru: Ввод соли
zh_cn: 盐的输入

# InputOutputLengthCaption
source: Length of the key material
de: Länge Schlüsselmaterial (in Byte)
ru: Длина ключевого материала
zh_cn: 钥匙材料长度

# InputOutputLengthToolTip
source: Length of the key material (in byte)
de: Länge des zu generierenden Schlüsselmaterial (in Byte)
ru: Длина ключевого материала (в байтах)
zh_cn: 密钥材料的长度（以字节为单位）

# InputSKMCaption
source: Source Key Material
de: Quellschlüssel-Material
ru: Материал исходного ключа
zh_cn: 源密钥材料

# InputSKMToolTip
source: Input of source key material
de: Eingabe des Quellschlüssel-Material
ru: Ввод исходного материала ключа
zh_cn: 输入源密钥资料

# OutputKeyMaterialCaption
source: Key Material
de: Schlüsselmaterial
ru: Ключевой материал
zh_cn: 关键材料

# OutputKeyMaterialDebugCaption
source: Debug
ru: Отлаживать
zh_cn: 除错

# OutputKeyMaterialDebugToolTip
source: Output of the single steps of the key derivation
de: Ausgabe der Zwischenschritte der Schlüsselgenerierung
ru: Вывод одиночных шагов вывода ключа
zh_cn: 密钥推导的单个步骤的输出

# OutputKeyMaterialToolTip
source: Output of the to generate key material
de: Ausgabe des zu generierenden Schlüsselmaterials
ru: Выход для генерации ключевого материала
zh_cn: 输出以生成关键材料

# PresCalc
source: Skip calculation
de: Berechnungschritte überspringen
ru: Пропустить расчет
zh_cn: 跳过计算

# PresIntro
source: Skip chapter
de: Kapitel überspringen
ru: Пропустить главу
zh_cn: 跳过章节

# PresNext
source: Next
de: Weiter
ru: следующий
zh_cn: 下一个

# SaveFileDialogCaption
source: Save key material to file:
de: Speichere Schlüsselmaterial in Datei
ru: Сохранение ключевого материала в файл:
zh_cn: 将关键材料保存到文件：

# SaveFileDialogTooltip
source: Specifies the output file for the generated key material, if you want to save it to a file
de: Spezifiziert die Datei, in der das Schlüsselmaterial gespeichert werden kann
ru: Задает выходной файл для сгенерированного ключевого материала, если вы хотите сохранить его в файл
zh_cn: 指定生成的密钥材料的输出文件（如果要保存到文件中）

# PresConstructionSectionHeading
source: Construction
de: Konstruktion
ru: Строительство HKDF SHA-256
zh_cn: 施工

# PresConstructionSectionHeadingNum
source: 2. Construction of HKDF SHA-256
de: 2. Konstruktion HKDF SHA-256
ru: 2. Конструкция HKDF SHA-256
zh_cn: 2. HKDF SHA-256的建造

# PresExplanationSectionHeading
source: HKDF SHA-256
zh_cn: 港币基金SHA-256

# PresIntroductionPart1Text
source: The function HKDF SHA-256 is a key derivation function (KDF). It uses the Keyed-Hash Message Authentication Code (HMAC) as a pseudorandom function (PRF). As inputs it gets the SKM and the secret key. In this implementation, the SHA-256 is used in the HMAC. This key derivation fuction is recommended by the National Institute of Standards and Technology (NIST).
de: Die Funktion HKDF SHA-256 ist eine Schlüsselgenerierungs- funktion (Key Derivation Function, KDF). Als Pseudozufallsfunktion (Pseudorandom Function, PRF) wird der Keyed-Hash Message Authentication Code (HMAC) verwendet. Dieser erhält neben dem SKM auch den geheimen Schlüssel als Eingabe. In dieser Implementierung wird als Hashfunktion der SHA-256 im HMAC verwendet. Dieses Schlüsselgenerierungsverfahren wird u.a. vom National Institute of Standards and Technology (NIST) empfohlen.
ru: Функция HKDF SHA-256 является ключевой функцией деривации (KDF). В качестве псевдослучайной функции (PRF) он использует код аутентификации сообщения с ключом-хэшем (HMAC). В качестве вкладов он получает SKM и секретный ключ. В этой реализации SHA-256 используется в HMAC. Этот ключевой дедукционный метод рекомендуется Национальным институтом стандартов и технологий (NIST).
zh_cn: 函数HKDF SHA-256是密钥派生函数（KDF）。它使用密钥哈希消息验证码（HMAC）作为伪随机函数（PRF）。作为输入，它获取SKM和密钥。在此实现中，SHA-256用于HMAC。美国国家标准与技术研究院（NIST）推荐这种关键的推导功能。

# PresIntroductionSectionHeading
source: Introduction
de: Einführung
ru: Введение
zh_cn: 介绍

# PresIntroductionSectionHeadingNum
source: 1. Introduction
de: 1. Einführung
ru: 1. Введение
zh_cn: 1.简介

# PresSectionIntroductionText
source: <Bold><Underline>Inputs:</Underline></Bold> <Bold>Source Key Material:</Bold> Specifies the source key material (SKM) <Bold>Salt:</Bold> Specifies the salt value for the calculation of the pseudorandom key (PRK). Does not have to be secret. <Bold>Context Information:</Bold> Specifies the applicationspecific constant context information (CTXInfo). Can be empty. <Bold>Length of the key material (in byte):</Bold> Specifies the length of the key material in byte. <Bold><Underline>Outputs:</Underline></Bold> <Bold>Key Material:</Bold> After the calculation, the resulting key material (KM) is visible in the text field. <Bold>Debug:</Bold> The key material will be calculated in multiple steps. Each subresult will be visible in this text field.
de: <Bold><Underline>Eingaben:</Underline></Bold> <Bold>Quellschlüssel-Material:</Bold> Spezifiziert das Quellschlüssel- Material (Source Key Material, SKM). <Bold>Salt:</Bold> Spezifiziert den Saltwert zur Berechnung des Pseudozufallsschlüssel (Pseudorandom Key, PRK). Dieser muss nicht geheim sein. <Bold>Kontext-Information:</Bold> Spezifiziert die anwendungsspezifische Konstante CTXInfo (Context Information, CTXInfo). Diese kann auch leer sein. <Bold>Länge des Schlüsselmaterials (in Byte):</Bold> Spezifiziert die Länge des Schlüsselmaterials in Byte. <Bold><Underline>Ausgaben:</Underline></Bold> <Bold>Schlüsselmaterial:</Bold> Nach der Berechnung ist das generierte Schlüsselmaterial (Key Material, KM) im Textfeld zu sehen. <Bold>Debug:</Bold> Das Schlüsselmaterial wird sukzessive in mehreren Schritten berechnet. Die Ergebnisse der jeweiligen Teilschritte sind in der Debugausgabe zu sehen.
ru: <Bold> Входы: </Bold><Bold> Материал исходного ключа: </Bold> Определяет материал исходного ключа (SKM) <Bold> Поваренная соль: </Bold> Задает значение соли для вычисления псевдослучайной клавиши (PRK). Не обязательно быть тайной. <Bold> Контекстная информация: </Bold> Указывает специфическую контекстную информацию для конкретных приложений (CTXInfo). Может быть пустым. <Bold> Длина ключевого материала (в байтах): </Bold> Задает длину ключевого материала в байте. <Bold> Выходы: </Bold><Bold> Ключевой материал: </Bold> После вычисления итоговый ключевой материал (KM) отображается в текстовом поле. <Bold> Отлаживать: </Bold> Ключевой материал будет рассчитан в несколько этапов. Каждый подрезультат будет отображаться в этом текстовом поле.
zh_cn: <Bold><Underline>输入：</Underline></Bold><Bold>源密钥材料：</Bold>指定源密钥材料（SKM）<Bold>盐：</Bold>指定用于计算伪随机密钥（PRK）的盐值。不必保密。<Bold>上下文信息：</Bold>指定特定于应用程序的常量上下文信息（CTXInfo）。可以为空。<Bold>密钥材料的长度（以字节为单位）：</Bold>指定密钥材料的长度（以字节为单位）。<Bold><Underline>输出：</Underline></Bold><Bold>关键材料：</Bold>计算后，结果的关键材料（KM）在文本字段中可见。<Bold>调试：</Bold>关键材料将分多个步骤计算。每个子结果将在此文本字段中可见。

# PresTitleHeading
source: HKDF SHA-256 -- a Key Derivation Function with extendable output length
de: HKDF SHA-256 -- Eine Schlüsselgenerierungs-Funktion mit erweiterbarer Ausgabelänge
ru: HKDF SHA-256 a Функция деривации ключей с расширяемой выходной длиной
zh_cn: HKDF SHA-256-具有可扩展输出长度的密钥推导功能

# ExToMuchOutputRequested
source: Please specify a smaller value for requested length of outputbytes. You specified: {0}. Allowed is only: {1}
de: Bitte geben Sie einen kleineren Wert für die Länge der Ausgabebytes ein. Es wurde angegeben: {0}. Erlaubt sind maximal: {1}
ru: Укажите меньшее значение для запрашиваемой длины выходных данных. Вы указали: {0}. Разрешено только: {1}
zh_cn: 请为请求的输出字节长度指定一个较小的值。您指定了：{0}。仅允许使用：{1}

# InputCtxInfoToolTip
source: Input of the applicationspecific constant CTXInfo
de: Eingabe der anwendungsspezifischen Konstante CTXInfo
ru: Ввод применения конкретной константы CTXInfo
zh_cn: 输入特定于应用程序的常量CTXInfo

# KeyMaterialDebugTextTemplate
source: Output of the {0}{ord} calculation round: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
de: Ausgabe der {0}{ord} Berechnungsrunde: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
ru: Вывод {0}. Вычисление: Байт 1 - 8: {1} Байт 9 - 16: {2} Байт 17 - 24: {3} Байт 25 - 32: {4}
zh_cn: {0} {ord}计算回合的输出：字节1-8：{1}字节9-16：{2}字节17-24：{3}字节25-32：{4}

# PresConstructionPart1Text
source: The calculation of the key material can be described as following:
de: Die Berechnung des Schlüsselmaterials kann formal wie folgt beschrieben werden:
ru: Расчет основного материала можно описать следующим образом:
zh_cn: 关键材料的计算可描述如下：

# PresConstructionPart2Text
source: The HKDF procedure consists of two steps. In the first step, a pseudo random key (PRK) is generated. It is calculated on the basis of the SKM and an optional salt.
de: Das HKDF-Verfahren besteht aus zwei Schritten. Im ersten Schritt wird ein Pseudozufallsschlüssel (Pseudorandom Key, PRK) generiert. Dieser wird auf Basis des SKM und eines optionalen Salts berechnet.
ru: Процедура HKDF состоит из двух этапов. На первом этапе генерируется псевдослучайный ключ (PRK). Он рассчитывается на основе СКМ и необязательной соли.
zh_cn: HKDF程序包括两个步骤。第一步，生成伪随机密钥（PRK）。它是根据SKM和可选盐计算的。

# PresConstructionPart3Text
source: In step 2, the key material is calculated. For this purpose, the prk from step 1 is used as a secret key for the HMAC. The KM is calculated step by step. The HKDF method uses a feedback loop and a counter for this purpose: The respective precalculated value is used as input for the subsequent calculation. The counter is incremented in each step. The input CTXinfo is an application-specific constant, which can also be empty.
de: Im zweiten Schritt wird das Schlüsselmaterial berechnet. Dazu wird der PRK aus dem ersten Schritt als geheimer Schlüssel verwendet. Das KM wird schrittweise berechnet. Das HKDF-Verfahren verwendet dazu eine Feedback-Schleife und einen Zähler: Der jeweiligs vorher berechnete Wert wird als Eingabe für die nachfolgende Berechnung verwendet. Der Zähler wird bei jedem Schritt inkrementiert. Die Eingabe CTXinfo ist eine anwendungsspezifische Konstante, diese kann auch entfallen.
ru: На шаге 2 вычисляется ключевой материал. Для этой цели prk с шага 1 используется как секретный ключ для hmac. KM вычисляется шаг за шагом. Для этой цели метод HKDF использует контур обратной связи и счетчик: соответствующее предварительное значение используется как вход для последующего расчета. Счетчик увеличивается на каждом шаге. Вход CTXinfo - это константа, зависящая от приложения, которая также может быть пустой.
zh_cn: 在步骤2中，计算密钥材料。为此，将步骤1中的prk用作HMAC的密钥。 KM是逐步计算的。 HKDF方法为此使用反馈回路和计数器：各个预先计算的值用作后续计算的输入。计数器在每个步骤中递增。输入CTXinfo是一个特定于应用程序的常量，也可以为空。

# PresConstructionPart4Text
source: The following picture shows the second step:
de: Die folgende Abbildung visualisiert Schritt zwei:
ru: На следующем рисунке показан второй шаг:
zh_cn: 下图显示了第二步：

# PresConstructionScheme
source: Step 1: Extract PRK = HMAC-SHA256(Salt, SKM) Step 2: Expand KM(0) = empty string (zero length) KM(1) = HMAC-SHA256(PRK, KM(0) || info || CTR) KM(2) = HMAC-SHA256(PRK, KM (1) || info || CTR) … KM(n) = HMAC-SHA256(PRK, KM (n-1) || info || CTR)
de: Step 1: Extrahierung PRK = HMAC-SHA256(salt, SKM) Step 2: Erweiterung KM(0) = empty string (zero length) KM(1) = HMAC-SHA256(PRK, KM(0) || info || CTR) KM(2) = HMAC-SHA256(PRK, KM (1) || info || CTR) … KM(n) = HMAC-SHA256(PRK, KM (n-1) || info || CTR)
ru: Шаг 1: Извлечь PRK = HMAC-SHA256 (Salt, SKM) Шаг 2: Развернуть KM (0) = пустая строка (нулевая длина) KM (1) = HMAC-SHA256 (PRK, KM (0) || info || CTR ) KM (2) = HMAC-SHA256 (PRK, KM (1) || info || CTR) ... KM (n) = HMAC-SHA256 (PRK, KM (n-1) || info || CTR)
zh_cn: 步骤1：提取PRK = HMAC-SHA256（Salt，SKM）步骤2：展开KM（0）=空字符串（零长度）KM（1）= HMAC-SHA256（PRK，KM（0）||信息||点阅率）KM（2）= HMAC-SHA256（PRK，KM（1）|| info || CTR）…KM（n）= HMAC-SHA256（PRK，KM（n-1）|| info || CTR）

# PresIterationPRKCalc
source: Step 1: Calculation of PRK with following inputs: SKM: {0} Salt: {1}
de: Step 1: Berechnung des PRK mit folgenden Eingaben: SKM: {0} Salt: {1}
ru: Шаг 1: Расчет PRK со следующими входами: SKM: {0} Соль: {1}
zh_cn: 步骤1：使用以下输入来计算PRK：SKM：{0}盐：{1}

# PresIterationRounds
source: Step 2: Calculation round {0} of {1} PRK: {2} SKM: {3} CTXInfo: {4} Counter: {5}
de: Step 2: Berechnungsrunde {0} von {1} PRK: {2} SKM: {3} CTXInfo: {4} Counter: {5}
ru: Шаг 2: Calculationround {0} из {1} PRK: {2} SKM: {3} CTXInfo: {4} Счетчик: {5}
zh_cn: 步骤2：在{1} PRK：{2} SKM：{3} CTXInfo：{4}计数器：{5}中，从{0}开始计算

# PresKeyMaterialDebugTextTemplate
source: Output of the {0}{ord} calculation round: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
de: Ausgabe der {0}{ord} Berechnungsrunde: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
ru: Вывод {0}. Вычисление: Байт 1 - 8: {1} Байт 9 - 16: {2} Байт 17 - 24: {3} Байт 25 - 32: {4}
zh_cn: {0} {ord}计算回合的输出：字节1-8：{1}字节9-16：{2}字节17-24：{3}字节25-32：{4}

# PresPRKDebugTextTemplate
source: Output of PRK: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
de: Ausgabe des PRK: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
ru: Выход PRK: Байт 1 - 8: {1} Байт 9 - 16: {2} Байт 17 - 24: {3} Байт 25 - 32: {4}
zh_cn: PRK的输出：字节1-8：{1}字节9-16：{2}字节17-24：{3}字节25-32：{4}

# PRKDebugTextTemplate
source: Output of PRK: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
de: Ausgabe des PRK: Byte 1 - 8: {1} Byte 9 - 16: {2} Byte 17 - 24: {3} Byte 25 - 32: {4}
ru: Выход PRK: Байт 1 - 8: {1} Байт 9 - 16: {2} Байт 17 - 24: {3} Байт 25 - 32: {4}
zh_cn: PRK的输出：字节1-8：{1}字节9-16：{2}字节17-24：{3}字节25-32：{4}

# ExSystemOutOfMemory
source: While requesting memory from your system, there was an exception. Please try a smaller value for the output bytes.
de: Bei der Anforderung des Speichers ist ein Fehler aufgetreten. Bitte spezifizieren Sie einen kleineren Wert für die Ausgabelänge.
ru: При запросе памяти из вашей системы произошло исключение. Попробуйте меньшее значение для выходных байтов.
zh_cn: 从系统请求内存时，发生了异常。请为输出字节尝试较小的值。

# PresErrorText
source: An error occured. Please find detailed information in the log of CrypTool2.
de: Es ist ein Fehler aufgetreten. Weitere Informationen sind im Protokoll des CrypTool2 zu finden.
ru: Произошла ошибка. Пожалуйста, найдите подробную информацию в журнале CrypTool2.
zh_cn: 发生错误。请在CrypTool2的日志中找到详细信息。

# PresFinishedSectionHeading
source: 4. Calculation finished
de: 4. Berechnung beendet
ru: 4. Расчет завершен
zh_cn: 4.计算完成

# PresFinishedText
source: To repeat the calculation, there are 3 alternatives: - either stop the execution and start it again - or change one of the inputs - or click on the "Restart" button (then the calculation will restart automatically)
de: Zum Wiederholen der Berechnung gibt es 3 Alternativen: - Entweder die Ausführung stoppen und wieder starten - Eine der Eingaben ändern - Auf den Button "Neustart" klicken (dann startet die Berechnung automatisch neu)
ru: Чтобы повторить вычисление, существует 3 альтернативы: либо прекратите выполнение, либо запустите его снова, измените один из входов или нажмите кнопку «Перезапустить». Затем расчет будет перезагружен автоматически.
zh_cn: 要重复计算，有3种选择：-停止执行并再次开始执行-或更改输入之一-或单击“重新启动”按钮（然后计算将自动重新开始）

# PresIterationSectionHeading
source: Calculation
de: Berechnung
ru: расчет
zh_cn: 计算方式

# PresIterationSectionHeadingNum
source: 3. Calculation
de: 3. Berechnung
ru: 3. Расчет
zh_cn: 3.计算

# PresRestart
source: Restart
de: Neustart
ru: Перезапуск
zh_cn: 重新开始

# PresStart
source: Start
ru: Начало
zh_cn: 开始

# TooMuchOutputRequestedLogForKPFStd
source: The maximum amout of outputbytes are 8160 in case of implementation refered to RFC 5869 . The requested amout of {0} byte was set to the maximum.
de: Die größte Menge an Ausgabebytes sind 8160 byte bei der Implementierung gemäß RFC 5869 . Die angeforderte Menge von {0} byte wurde auf das Maximum gesetzt.
ru: Максимальное количество выходных байтов составляет 8160 в случае реализации, относящегося к RFC 5869. Запрошенный максимум из {0} байта был установлен на максимум.
zh_cn: 如果参考RFC 5869实施，则输出字节的最大大小为8160。 {0}字节的请求amout设置为最大值。

# TooMuchOutputRequestedLogMSG
source: The maximum amount of output are 5 MB 5242880 byte). The requested amount of {0} byte was set to the maximum.
de: Die größte Menge an Ausgabebytes sind 5 MB 5242880byte). Die angeforderte Menge von {0} byte wurde auf das Maximum gesetzt.
ru: Максимальный объем вывода - 5 МБ 5242880 байт). Запрошенное количество {0} байт установлено максимально.
zh_cn: 最大输出量为5 MB 5242880字节）。请求的{0}字节数量已设置为最大值。

# PrintToFileGroup
source: Saving-Parameters
de: Speicher-Parameter
ru: Сохранение-параметров
zh_cn: 保存参数
