Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/LFSR/Properties/Resources.*.resx
Languages: de, zh_cn

# PluginTooltip
source: Linear Feedback Shift Register
de: Linear rückgekoppeltes Schieberegister
zh_cn: 线性反馈移位寄存器

# InputTapSequenceCaption
source: TapSequence
de: Tap-Sequenz

# InputTapSequenceTooltip
source: A string containing the taps as a sequence of the c_i or as a polynomial (e.g.: 1011, which is equal to the string x^4 + x^2 + x + 1. Note, that the last 1, which is x^0, is implicitly set to 1 inside the plugin).
de: Tap-Sequenz-Funktion in binärer Darstellung.
zh_cn: 包含抽头的字符串，作为c_i的序列或多项式（例如：1011，它等于字符串x ^ 4 + x ^ 2 + x +1。请注意，最后一个1是x ^ 0 ，在插件中隐式设置为1）。

# InputSeedCaption
source: Seed
de: Startwert
zh_cn: 种子

# InputSeedTooltip
source: The initial binary value of all states (E.g.: 1001).
de: Startwert des LFSR in binärer Darstellung.
zh_cn: 所有状态的初始二进制值（例如：1001）。

# InputClockBoolCaption
source: Clock
de: Takt
zh_cn: 时钟

# InputClockBoolTooltip
source: Optional external clock signal (through CLK plugin).
de: Optionaler Takteingang. Das LFSR schreitet nur fort, wenn das Taktsignal hohen Pegel hat.
zh_cn: 可选的外部时钟信号（通过CLK插件）。

# OutputStringCaption
source: String Output
de: Textausgabe
zh_cn: 字符串输出

# OutputStringTooltip
source: The string containing the output stream with a length of the rounds (e.g.: 1001001, assuming that seven rounds have been performed).
de: Gibt die Ausgabe als Zeichenfolge aus, deren Länge der Anzahl der Runden entspricht. Verwenden Sie diesen Ausgang, wenn kein Takt anliegt.
zh_cn: 包含具有舍入长度的输出流的字符串（例如：1001001，假设已经执行了7个舍入）。

# OutputBoolCaption
source: Boolean Output
de: Boolesche Ausgabe
zh_cn: 布尔输出

# OutputBoolTooltip
source: Contains the current output bit as a boolean value.
de: Boolesche Ausgabe des LFSR. Verwenden Sie diese Ausgabe, wenn ein Taktsignal anliegt.
zh_cn: 包含当前输出位作为布尔值。

# OutputClockingBitCaption
source: Additional Output Bit
de: zusätzliches Ausgabebit
zh_cn: 附加输出位

# OutputClockingBitTooltip
source: Outputs a specific stage of the LFSR as a boolean value.
de: zusätzliches Ausgabebit
zh_cn: 将LFSR的特定阶段输出为布尔值。

# OutputBoolArrayCaption
source: Boolean Array Output of Stages
de: Zustandsausgabe als Boolesches Array
zh_cn: 阶段的布尔数组输出

# OutputBoolArrayTooltip
source: Outputs all stages of the LFSR.
de: Ausgabe der Zustände des LFSR als ein Boolesches Array.
zh_cn: 输出LFSR的所有阶段。

# AlwaysCreateOutputCaption
source: Always create output
de: Ausgabe immer erzeugen
zh_cn: 始终创建输出

# AlwaysCreateOutputTooltip
source: With this checkbox enabled, an output will be generated, even though the clock is set to false. The output bit will be the bit from the last clock cycle.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird ein Ausgabebit auch generiert, wenn der Takt niedrigen Pegel hat. Dieses ist dann das Bit des letzten Taktzyklus.
zh_cn: 启用此复选框后，即使时钟设置为false，也会生成输出。输出位将是最后一个时钟周期的位。

# ClockingBitCaption
source: Additional output bit #
de: zusätzliches Ausgabebit #
zh_cn: 附加输出位＃

# ClockingBitTooltip
source: Which bit shall be generated as an additional output? For example as a clocking bit.
de: Welches Bit soll als zusätzlich ausgegeben werden (z.B. zur Verwendung als Taktsignal)?
zh_cn: 哪一位应作为附加输出生成？例如作为时钟位。

# NoQuickwatchCaption
source: Do not display presentation
de: Präsentation nicht anzeigen
zh_cn: 不显示简报

# NoQuickwatchTooltip
source: With this checkbox enabled, no presentation will be shown and performance will be better.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird keine Präsentation angezeigt und die Performance wird besser.
zh_cn: 启用此复选框后，将不会显示任何演示文稿，并且性能会更好。

# OutputStagesCaption
source: Output stages
de: Ausgabe des Zustandes
zh_cn: 输出阶段

# OutputStagesTooltip
source: With this checkbox enabled, the current state will be output.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird der momentane Zustand ausgegeben.
zh_cn: 启用此复选框后，将输出当前状态。

# PeriodCaption
source: Period of LFSR:
de: Periode des LFSR:
zh_cn: LFSR的时期：

# PeriodTooltip
source: Indicates the period depending on feedback polynomial and seed.
de: Die berechnete Periode des LFSR
zh_cn: 根据反馈多项式和种子指示周期。

# PolynomialCaption
source: Feedback polynomial
de: Generatorpolynom
zh_cn: 反馈多项式

# PolynomialTooltip
source: Define the feedback polynomial either in a textual or a numeric way. For example x^5 + x^2 + 1 which is equal to 10010.
de: Definiere das Generatorpolynom entweder in Textform oder numerisch. Z.B. x^5 + x^2 + 1 oder äquivalent 10010.
zh_cn: 以文本或数字方式定义反馈多项式。例如，x ^ 5 + x ^ 2 +1等于10010。

# RoundsCaption
source: Rounds
de: Runden
zh_cn: 回合

# RoundsTooltip
source: How many bits shall be generated? Note: This only applies if no external clock is used.
de: Wie viele Bits sollen generiert werden? Hinweis: Dies trifft nur zu, wenn kein externes Taktsignal anliegt.
zh_cn: 应生成多少位？注意：仅在不使用外部时钟的情况下才适用。

# SaveCurrentStateCaption
source: Save the state of the LFSR
de: Speichere den Zustand des LFSR
zh_cn: 保存LFSR的状态

# SaveCurrentStateTooltip
source: Saves the current state when stopping and restarting the plugin or saving the workspace.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird der momentane Zustand beim Öffnen eines Arbeitsbereiches wiederhergestellt.
zh_cn: 停止并重新启动插件或保存工作空间时，保存当前状态。

# SeedCaption
source: Seed
de: Startwert
zh_cn: 种子

# SeedTooltip
source: Define the seed (initial state) of the LFSR. For example 11100.
de: Definiere die Startbelegung des LFSR (z.B. 11100).
zh_cn: 定义LFSR的种子（初始状态）。例如11100。

# UseAdditionalOutputBitCaption
source: Generate add. output bit
de: Generiere zusätzliches Ausgabebit
zh_cn: 生成添加。输出位

# UseAdditionalOutputBitTooltip
source: With this checkbox enabled, the additional output bit will be generated.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird ein zusätzliches Ausgabebit generiert.
zh_cn: 启用此复选框后，将生成附加输出位。

# UseBoolClockCaption
source: Use external clock
de: Verwende externes Taktsignal
zh_cn: 使用外部时钟

# UseBoolClockTooltip
source: With this checkbox enabled, an external clock will be used.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird ein externes Taktsignal verwendet.
zh_cn: 启用此复选框后，将使用外部时钟。

# UseBoolClockTPCaption
source: Use external clock
de: Verwende externes Taktsignal
zh_cn: 使用外部时钟

# UseBoolClockTPTooltip
source: With this checkbox enabled, an external clock will be used (e.g. the CLK component).
de: Wenn dieses Kontrollkästchen aktiviert ist, wird ein externes Taktsignal verwendet (z.B. das CLK-Plugin).
zh_cn: 启用此复选框后，将使用外部时钟（例如CLK组件）。

# initLFSRCaption
source: Draw LFSR
de: Zeichne LFSR
zh_cn: 抽奖

# initLFSRTooltip
source: Draws the presentation of the LFSR, if the polynomial fits to the seed.
de: Initialisiert LFSR und zeichnet die Präsentation. Wird benötigt, um die Präsentation von LFSR vor Beginn der Ausführung darzustellen.
zh_cn: 如果多项式适合种子，则绘制LFSR。

# No_Quickwatch_data_right_now_
source: No data to present right now.
de: Momentan keine Daten zur Präsentation vorhanden.
zh_cn: 现在没有数据可显示。

# AlwaysCreateOutputList1
source: Always generate output?
de: Ausgabe immer erzeugen?
zh_cn: 总是产生输出？

# ClockGroup
source: Clock Properties
de: Takteigenschaften
zh_cn: 时钟属性

# ClockingBitGroup
source: Additional Output Bit
de: Zusätzliches Ausgabebit
zh_cn: 附加输出位

# Feedback_polynomial
source: Generator polynomial
de: Generatorpolynom
zh_cn: 反馈多项式

# NoQuickwatchList1
source: Display presentation?
de: Präsentation anzeigen?
zh_cn: 显示演示文稿？

source: Period of LFSR
de: Periode des LFSR
zh_cn: LFSR的时期

# SaveCurrentStateList1
source: Save current state?
de: Momentanen Zustand speichern?
zh_cn: 保存当前状态？

# UseAdditionalOutputBitList1
source: Generate additional output bit?
de: Zusätzliches Ausgabebit generieren?
zh_cn: 产生额外的输出位？

# UseBoolClockList1
source: Use external clock?
de: Externen Takt verwenden?
zh_cn: 使用外部时钟？

# MaxRecordedRoundsCaption
source: Max. intermediate results recorded
de: Max. aufgezeichnete Rundenergebnisse
zh_cn: 最高记录中间结果

# MaxRecordedRoundsTooltip
source: The maximum number of intermediate states (shifts) to keep in memory
de: Maximale Runden für die Ergebnisse zwischengespeichert werden
zh_cn: 要保留在内存中的最大中间状态（移位）数

# PresentationShiftCaption
source: Rewind count of rounds in presentation
de: Präsentation um n Runden nach hinten verschieben
zh_cn: 倒退演示中的回合数

# PresentationShiftTooltip
source: The presentation shows the round that is this many rounds behind the current one
de: Die Präsentation zeigt die Runde, welche so viele Runden vor der aktuellen Runde kam.
zh_cn: 演示文稿显示了当前一轮落后许多回合的回合

# RoundNumber
source: Round:
de: Runde:
zh_cn: 回合：

# SeedFlippedCaption
source: Seed: left bit first in
de: Seed: Linkes Bit zuerst
zh_cn: 种子：左位在先

# SeedFlippedTooltip
source: The seed is initially shifted into the register with the leftmost bit first (so that it appears in the register in flipped order compared to the input)
de: Gibt an, ob der Seed mit dem linken Bit zuerst in das Register eingeschoben wird. Dies führt dazu, dass die Eingabezeichenfolge dieselbe Reihenfolge wie die Bits im Shiftregister haben.
zh_cn: 种子首先从最左位开始移入寄存器（与输入相比，种子以翻转的顺序出现在寄存器中）
