Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Converter/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: Converter
de: Konvertierer
ru: конвертер
zh_cn: 转换器

# PluginTooltip
source: Converts input to another type
de: Konvertiert die Eingabe in einen anderen Typ
ru: Преобразует ввод в другой тип
zh_cn: 将输入转换为另一种类型

# InputOneCaption
source: Input
de: Eingabe
ru: вход
zh_cn: 输入值

# InputOneTooltip
source: Input.
de: Eingabe
ru: Ввод.
zh_cn: 输入。

# OutputCaption
source: Output
de: Ausgabe
ru: Вывод
zh_cn: 输出量

# OutputTooltip
source: Output.
de: Ausgabe
ru: Вывод.
zh_cn: 输出。

# ConverterCaption
source: Converting to
de: Konvertieren in
ru: Преобразование в
zh_cn: 转换成

# ConverterTooltip
source: Choose the output type
de: Wählen Sie den Typ der Ausgabe
ru: Выберите тип вывода
zh_cn: 选择输出类型

# InputEncodingSettingCaption
source: Encoding of input
de: Zeichencodierung Eingabe
ru: Кодирование ввода
zh_cn: 输入编码

# InputEncodingSettingTooltip
source: Choose the expected character encoding of the input byte array or stream.
de: Wählen Sie die erwartete Zeichencodierung der Eingabe (falls Byte-Array oder Datenstrom).
ru: Выберите ожидаемую кодировку символов для входного байтового массива или потока.
zh_cn: 选择输入字节数组或流的预期字符编码。

# FormatAmerCaption
source: Format
de: Fließkomma-Format
ru: Формат
zh_cn: 格式

# FormatAmerTooltip
source: Choose whether double values are recognized via german or american syntax. German: "1.234.567,89" American: "1,234,567.89"
de: Sollen Fließkommazahlen nach deutscher (1.234.567,89) oder amerikanischer (1,234,567.89) Schreibweise interpretiert werden?
ru: Выберите, распознаются ли двойные значения через немецкий или американский синтаксис. Немецкий: «1.234.567,89» Американский: «1,234,567.89»
zh_cn: 选择是否通过德语或美式语法识别双精度值。德语：“ 1.234.567,89”；美国人：“ 1,234,567.89”

# NumericCaption
source: Numeric
de: Numerisch
ru: числовой
zh_cn: 数字

# NumericTooltip
source: Choose whether inputs are interpreted as numeric values if possible
de: Sollen die Eingabewerte, soweit möglich, numerisch interpretiert werden?
ru: Выберите, будут ли входы интерпретироваться как числовые значения, если возможно
zh_cn: 选择是否将输入解释为数值

# PresentationFormatSettingTooltip
source: Choose the format that will be used te present the output data.
de: Wählen Sie das Format, das für die Datenausgabe verwendet werden soll.
ru: Выберите формат, который будет использоваться te, чтобы представить выходные данные.
zh_cn: 选择将用于显示输出数据的格式。

# EncodingSettingList5
source: ASCII
zh_cn: ASCII码

# FormatAmerList1
source: german
de: deutsch
ru: Немецкий
zh_cn: 德语

# FormatAmerList2
source: american
de: amerikanisch
ru: американский
zh_cn: 美国人

# NumericList1
source: no
de: nein
ru: нет
zh_cn: 没有

# NumericList2
source: yes
de: ja
ru: да
zh_cn: 是

# PresentationFormatSettingList1
source: Text
ru: Текст
zh_cn: 文本

# PresentationFormatSettingList2
source: Hex
ru: наговор
zh_cn: 十六进制

# ReverseOrderCaption
source: Reverse byte order
de: Bytefolge umdrehen
ru: Обратный порядок байтов
zh_cn: 反向字节顺序

# ReverseOrderTooltip
source: Reverse the order of the bytes before giving it to the output.
de: Soll die Reihenfolge der Bytes vor der Ausgabe umgedreht werden?
ru: Отмените порядок байтов перед передачей на выход.
zh_cn: 在将字节提供给输出之前，请先反转其顺序。

# EndiannessCaption
source: Endianness
de: Byte-Wertigkeit
ru: Порядок байтов
zh_cn: 字节序

# EndiannessList1
source: Big Endian
ru: Большой Эндиан
zh_cn: 大端

# EndiannessList2
source: Little Endian
ru: Маленький Эндиан
zh_cn: 小端

# EndiannessTooltip
source: Specify the endianness of the input bytes when the input is a byte array.
de: Geben Sie die Wertigkeit der Eingabe-Bytes an, wenn die Eingabe ein Byte-Array ist.
ru: Укажите конечность входных байтов, когда вход представляет собой массив байтов.
zh_cn: 当输入是字节数组时，指定输入字节的字节序。

# OutputEncodingSettingCaption
source: Encoding of output
de: Zeichencodierung Ausgabe
ru: Кодирование вывода
zh_cn: 输出编码

# OutputEncodingSettingTooltip
source: Choose the character encoding of the output byte array or stream.
de: Wählen Sie die Zeichencodierung der Ausgabe (falls Byte-Array oder Datenstrom).
ru: Выберите кодировку символов выходного байтового массива или потока.
zh_cn: 选择输出字节数组或流的字符编码。

# TypesList1
source: string
ru: строка
zh_cn: 串

# TypesList2
source: int
ru: ИНТ
zh_cn: 整型

# TypesList3
source: short
ru: короткая
zh_cn: 短

# TypesList4
source: byte
ru: байт
zh_cn: 字节

# TypesList5
source: double
ru: двойной
zh_cn: 双

# TypesList6
source: BigInteger
zh_cn: 大整数

# TypesList7
source: byte[]
ru: байт[]
zh_cn: 字节[]

# TypesList8
source: CrypToolstream
zh_cn: 密码流

# FormatCaption
source: Numeric format
de: Numerisches Format
ru: Цифровой формат
zh_cn: 数值格式

# FormatTooltip
source: Provide a format string for specifying the conversion of a numeric type in the common .NET format. Leave blank if you don't know what that means.
de: Gib eine Formatzeichenkette im allgemeinen .NET-Format an um die Konvertierung eines numerischen Typs zu spezifizieren. Leer lassen, wenn du nicht weißt was das bedeutet.
ru: Укажите строку формата для указания преобразования числового типа в общем формате .NET. Оставьте пустым, если вы не знаете, что это значит.
zh_cn: 提供格式字符串，用于指定通用.NET格式的数字类型的转换。如果您不知道这意味着什么，请保留空白。

# TypesList9
source: bool
zh_cn: 布尔

# DigitsCaption
source: Digits
de: Ziffern
zh_cn: 位数

# DigitsGroupCaption
source: Digits Group Size
de: Ziffernblockgröße
ru: Размер группы цифр
zh_cn: 位数组大小

# DigitsGroupTooltip
source: Enter the size of the digit groups into which to divide the datastream.
de: Geben Sie die Größe der Zifferngruppen an, in die der Datenstrom zerlegt werden soll.
ru: Введите размер групп цифр, в которые необходимо разделить поток данных.
zh_cn: 输入将数据流划分为的数字组的大小。

# DigitsTooltip
source: Enter the digits the datastream consists of.
de: Geben Sie die Ziffern an, aus denen der Datenstrom besteht.
ru: Введите цифры, из которых состоит поток данных.
zh_cn: 输入数据流组成的数字。

# DigitsBaseCaption
source: Number Base
de: Zahlenbasis
ru: Номер базы
zh_cn: 数字基

# DigitsBaseTooltip
source: Enter the number base to use for the conversion from/to UInt[]
de: Geben Sie die Zahlenbasis an, die zur Konvertierung von/nach UInt[] verwendet werden soll.
ru: Введите базу чисел, используемую для преобразования из / в UInt []
zh_cn: 输入用于从/向UInt []转换的数字基数

# DigitsDefinitionCaption
source: Define Digits as
de: Definiere Ziffern als
ru: Определите цифры как
zh_cn: 将数字定义为

# DigitsDefinitionList1
source: String of Digits
de: Zeichenkette
ru: Строка цифр
zh_cn: 数字串

# DigitsDefinitionList2
source: Byte Interval
de: Byte-Intervall
ru: Интервал байтов
zh_cn: 字节间隔

# DigitsDefinitionTooltip
source: Specify how you want to define the digits for converting from/to UInt[]: either as a sequence of arbitrary characters or as an interval of consecutive byte values.
de: Geben Sie an, wie Sie die Ziffern für die Konvertierung von/nach UInt[] definieren wollen: entweder als als beliebig wählbare Zeichenkette oder als ein Intervall aufeinanderfolgender Bytewerte.
ru: Укажите, как вы хотите определить цифры для преобразования из / в UInt []: либо в виде последовательности произвольных символов, либо в качестве интервала последовательных байтовых значений.
zh_cn: 指定要如何定义从/向UInt []转换的数字：可以是任意字符序列或连续字节值的间隔。

# DigitsEndiannessCaption
source: Endianness
de: Byte-Wertigkeit
ru: Порядок байтов
zh_cn: 字节序

# DigitsEndiannessTooltip
source: Specify the endianness when converting from/to UInt[].
de: Geben Sie die Wertigkeit bei der Konvertierung von bzw. in UInt[] an.
ru: Укажите значение endianness при преобразовании из / в UInt [].
zh_cn: 从/向UInt []转换时，指定字节顺序。

# DigitsGroup
source: Digits for UInt[]
de: Ziffern für UInt[]
ru: Цифры для UInt []
zh_cn: UInt的数字[]

# DigitsOffsetCaption
source: Byte Offset
ru: Смещение байта
zh_cn: 字节偏移

# DigitsOffsetTooltip
source: Enter the offset of the byte value that corresponds to the digit "zero".
de: Geben Sie den Offset des Bytewertes an, der als die Ziffer "Null" interpretiert werden soll.
ru: Введите смещение значения байта, которое соответствует цифре «ноль».
zh_cn: 输入与数字“零”相对应的字节值的偏移量。

# PresentationFormatSettingCaption
source: PresentationFormatSetting
de: Ausgabeformat
