Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/NetworkSender/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AmountLabel
source: Transmitted Packages:
de: Gesendete Pakete:
ru: Передаваемые пакеты:
zh_cn: 传输包：

# IPFromHeader
source: Receiver IP Address
de: Empfänger IP
ru: IP-адрес получателя
zh_cn: 接收方IP地址

# MetaLabel
source: Info
ru: Информация
zh_cn: 信息

# PaylodHeader
source: Transmitted Data
de: Gesendete Daten
ru: Переданные данные
zh_cn: 传输数据

# PluginCaption
source: Network Sender
de: Netzwerk-Sender
ru: Сетевой отправитель
zh_cn: 网络发件人

# PluginTooltip
source: Sends packets over a network
de: Sendet Pakete über ein Netzwerk
ru: Отправляет пакеты по сети
zh_cn: 通过网络发送数据包

# PortCaption
source: Port
ru: порт
zh_cn: 港口

# PortTooltip
source: Port on which the data packets are sent
de: Port, auf dem die Daten versendet werden
ru: Порт, по которому отправляются пакеты данных
zh_cn: 发送数据包的端口

# SendPackagesLabel
source: Send Packages
de: Gesendete Pakete
ru: Отправить пакеты
zh_cn: 发送包裹

# StartLabel
source: Start Time:
de: Gestartet Um:
ru: Время начала:
zh_cn: 开始时间：

# StreamInputCaption
source: Package Data
de: zu sendende Daten
ru: Данные пакета
zh_cn: 包装数据

# StreamInputTooltip
source: Data to be sent over the network.
de: Daten, die über das Netzwerk gesendet werden sollen
ru: Данные, отправляемые по сети.
zh_cn: 要通过网络发送的数据。

# TOSHeader
source: Transmitted at
de: Gesendet Um
ru: Передано в
zh_cn: 在传送

# DeviceIPCaption
source: Network Device IP Address
de: IP-Adresse
ru: IP-адрес сетевого устройства
zh_cn: 网络设备IP地址

# DeviceIPTooltip
source: Enter the IP address of the receiver.
de: Geben Sie die IP-Adresse des Empfängers an, um an diese IP-Adresse zu senden.
ru: Введите IP-адрес получателя.
zh_cn: 输入接收器的IP地址。

# LisPort
source: Port:
ru: Порт:
zh_cn: 港口：

source: Size
de: Größe
ru: Размер
zh_cn: 尺寸

# ByteAsciiSwitchCaption
source: show bytes as ASCII
de: Bytes als ASCII anzeigen
ru: показывать байты как ASCII
zh_cn: 将字节显示为ASCII

# ByteAsciiSwitchTooltip
source: show bytes as ASCII
de: Bytes als ASCII anzeigen
ru: показывать байты как ASCII
zh_cn: 将字节显示为ASCII

# IpInputCaption
source: Destination IP Address
de: Ziel IP
ru: IP-адрес получателя
zh_cn: 目的IP地址

# IpInputTooltip
source: Set the IP address of your destination here or in the settings of the component.
de: Setzen Sie die Ziel IP-Adresse hier oder in den Einstellungen der Komponente.
ru: Задайте IP-адрес получателя здесь или в настройках компонента.
zh_cn: 在此处或在组件设置中设置目标IP地址。

# ProtocolCaption
source: Protocol
de: Protokoll
ru: протокол
zh_cn: 协议

# ProtocolTooltip
source: Changes the protocol type
de: Ändert den Protokoll-Typ
ru: Изменяет тип протокола
zh_cn: 更改协议类型

# SpeedrateLabel
source: Transmission Rate:
de: Übertragungsrate:
ru: Скорость передачи:
zh_cn: 传输速率：

# ConnectIntervallCaption
source: Connection-establishment interval
de: Verbindungsaufbau-Intervall
ru: Интервал установления соединения
zh_cn: 连接建立间隔

# ConnectIntervallTooltip
source: Determines the time interval in the attempt to establish the connection to the server
de: Bestimmt das Zeit-Intervall, in dem versucht wird, die Verbindung zum Server aufzubauen
ru: Определяет временной интервал при попытке установить соединение с сервером
zh_cn: 确定尝试与服务器建立连接的时间间隔

# TryConnectCaption
source: Repeat connection establishment
de: Wiederhole Verbindungsaufbau
ru: Повторное установление соединения
zh_cn: 重复建立连接

# TryConnectTooltip
source: Tries to connect to the server in a given time interval
de: Versucht in einem gegebenen Zeit-Intervall, eine Verbindung zum Server aufzubauen
ru: Пытается подключиться к серверу за определенный промежуток времени
zh_cn: 尝试在给定的时间间隔内连接到服务器

source: TCP/IP Settings
de: TCP/IP-Eigenschaften
ru: Настройки TCP / IP
zh_cn: TCP / IP设置

# ConnectionIDInputCaption
source: Connection Input
de: Verbindungseingang
ru: Вход для подключения
zh_cn: 连接输入

# ConnectionIDInputTooltip
source: Specifies which connection should be used for transmitting
de: Gibt an, welche Verbindung für die Übertragung verwendet werden soll
ru: Указывает, какое соединение следует использовать для передачи
zh_cn: 指定应使用哪个连接进行传输

# ConnectionIDOutputCaption
source: Connection Output
de: Verbindungsausgang
ru: Выход подключения
zh_cn: 连接输出

# ConnectionIDOutputTooltip
source: Shows the ID of the current connection.
de: Gibt die ID der aktuellen Verbindung an
ru: Показывает идентификатор текущего соединения.
zh_cn: 显示当前连接的ID。

# NetworkConditionsGroup
source: Network Settings
de: Netzwerk-Einstellungen
ru: Настройки сети
zh_cn: 网络设置

# PresentationSettingsGroup
source: Presentation
de: Präsentation
ru: презентация
zh_cn: 介绍
