Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/EnigmaAnalyzer/Properties/Resources.*.resx
Languages: de, zh_cn

# AnalysisLanguageCaption
source: Language
de: Sprache
zh_cn: 语言

# AnalysisLanguageTooltip
source: Use this language for the cost function.
de: Verwende diese Sprache für die Kostenfunktion.
zh_cn: 使用此语言表示费用功能。

source: Analysis mode:
de: Analyse-Modus:
zh_cn: 分析模式：

# AnalysisModeCaption
source: Analysis mode
de: Analyse-Modus
zh_cn: 分析模式

# AnalysisModeTooltip
source: Which cryptanalysis mode should be performed?
de: Welcher Kryptoanalysemodus soll ausgeführt werden?
zh_cn: 应该执行哪种密码分析模式？

source: Analysis step:
de: Analyse-Schritt:
zh_cn: 分析步骤：

# AnalysisTypeGroup
source: Analysis type
de: Analyseverfahren
zh_cn: 分析类型

# CiphertextCaption
source: Ciphertext
de: Geheimtext
zh_cn: 密文

# CiphertextTooltip
source: The ciphertext that should be analyzed.
de: Der zu analysierender Geheimtext
zh_cn: 应该分析的密文。

# CribCaption
source: Crib
zh_cn: 婴儿床

# CribPositionFromCaption
source: Crib position from
de: Crib-Position von
zh_cn: 婴儿床位置

# CribPositionFromTooltip
source: Start position of crib used during the analysis
de: Startposition des während der Analyse zu verwendenen Cribbs
zh_cn: 分析过程中使用的婴儿床的起始位置

# CribPositionToCaption
source: Crib position to
de: Crib-Position bis
zh_cn: 婴儿床位置

# CribPositionToTooltip
source: End position of crib used during the analysis
de: Endposition des während der Analyse zu verwendenen Cribs
zh_cn: 分析过程中使用的婴儿床的最终位置

# CribTooltip
source: Crib that is used during the cryptanalysis using the Turing Bombe.
de: Crib, der während der Kryptoanalyse mit der Turing-Bombe verwendet wird.
zh_cn: 使用Turing Bombe进行密码分析时使用的婴儿床。

# EndLabel
source: End time:
de: Ende:
zh_cn: 时间结束：

# GreekRingFromCaption
source: Greek ring from
de: Griechischer Ring von
zh_cn: 希腊环起

# GreekRingFromTooltip
source: First ring in Greek position to analyze
de: Erster Ring, der in der griechischen Position zu analysieren ist.
zh_cn: 在希腊位置的第一环进行分析

# GreekRingToCaption
source: Greek ring to
de: Griechischer Ring bis
zh_cn: 希腊环向

# GreekRingToTooltip
source: Last ring in Greek position to analyze
de: Letzter Ring, der in der griechischen Position zu analysieren ist.
zh_cn: 最后一环在希腊位置进行分析

# GreekRoto PositionToTooltip
source: Last rotor position in Greek position to analyze
de: Letzte zu analysierende Rotorstellung in der griechischer Position.
zh_cn: 最后一个转子位置在希腊位置以进行分析

# GreekRotorFromCaption
source: Greek rotor from
de: Griechischer Rotor von
zh_cn: 来自的希腊转子

# GreekRotorFromTooltip
source: First rotor in Greek position to analyze
de: Erster Rotor, der in der griechischen Position zu analysieren ist.
zh_cn: 第一个转子位于希腊位置以进行分析

# GreekRotorPositionFromCaption
source: Greek rotor position from
de: Griechische Rotorstellung von
zh_cn: 希腊转子位置从

# GreekRotorPositionFromTooltip
source: First rotor position in Greek position to analyze
de: Erste Rotorstellung, welche in der griechischen Position zu analysieren ist.
zh_cn: 要分析的希腊语中的第一个转子位置

# GreekRotorPositionToCaption
source: Greek rotor position to
de: Griechische Rotorstellung bis
zh_cn: 希腊转子位置

# GreekRotorToCaption
source: Greek rotor to
de: Griechischer Rotor bis
zh_cn: 希腊转子

# GreekRotorToTooltip
source: Last rotor in Greek position to analyze
de: Letzter Rotor, der in griechischer Stellung zu analysieren ist.
zh_cn: 最后一个转子位于希腊位置以进行分析

# KeyCaption
source: Best key
de: Bester Schlüssel
zh_cn: 最好的钥匙

# KeyHeader
source: Key
de: Schlüssel
zh_cn: 键

# KeyTooltip
source: The best key found during the analysis.
de: Der beste Schlüssel, der während der Analyse gefunden wurde.
zh_cn: 分析过程中找到的最佳密钥。

# LeftRingFromCaption
source: Left ring from
de: Linker Ring von
zh_cn: 左环起

# LeftRingFromTooltip
source: First ring in left position to analyze
de: Erster Ring, der in der linken Position zu analysieren ist.
zh_cn: 第一环在左侧位置以进行分析

# LeftRingToCaption
source: Left ring to
de: Linker Ring bis
zh_cn: 左环到

# LeftRingToTooltip
source: Last ring in left position to analyze
de: Letzter Ring, der in der linken Position zu analysieren ist.
zh_cn: 最后一圈在左侧位置以进行分析

# LeftRotorFromCaption
source: Left rotor from
de: Letzte zu analysierende Rotorstellung in der linken Position.
zh_cn: 左转子从

# LeftRotorFromTooltip
source: First rotor in left position to analyze
de: Linker Rotor von
zh_cn: 第一个转子位于左侧位置以进行分析

# LeftRotorPositionFromCaption
source: Left rotor position from
de: Erster Rotor, der in der linken Position zu analysieren ist.
zh_cn: 从左转子位置

# LeftRotorPositionFromTooltip
source: First rotor position in left position to analyze
de: Linke Rotorstellung von
zh_cn: 第一转子位置在左侧位置以进行分析

# LeftRotorPositionToCaption
source: Left rotor position to
de: Erste Rotorstellung, welche in der linken Position zu analysieren ist.
zh_cn: 左转子位置

# LeftRotorPositionToTooltip
source: Last rotor position in left position to analyze
de: Linke Rotorstellung bis
zh_cn: 最后的转子位置在左侧位置以进行分析

# LeftRotorToCaption
source: Left rotor to
de: Linker Rotor bis
zh_cn: 左转子到

# LeftRotorToTooltip
source: Last rotor in left position to analyze
de: Letzter Rotor, der in linker Position zu analysieren ist.
zh_cn: 最后一个转子位于左侧位置以进行分析

# LocalLabel
source: Local
de: Lokal
zh_cn: 本地

# MachineModelCaption
source: Machine model
de: Maschinen-Modell
zh_cn: 机器型号

# MachineModelTooltip
source: The model of the Enigma that should be analyzed.
de: Das Modell der Enigma, das analysiert werden soll.
zh_cn: 应该分析的Enigma模型。

# MiddleRingFromCaption
source: Middle ring from
de: Mittler Ring von
zh_cn: 中环起

# MiddleRingFromTooltip
source: First ring in middle position to analyze
de: Erster Ring, der in der mittleren Position zu analysieren ist.
zh_cn: 第一环处于中间位置以进行分析

# MiddleRingToCaption
source: Middle ring to
de: Mittler Ring bis
zh_cn: 中环到

# MiddleRingToTooltip
source: Last ring in middle position to analyze
de: Letzter Ring, der in der mittleren Position zu analysieren ist.
zh_cn: 最后一圈处于中间位置以进行分析

# MiddleRotorFromCaption
source: Middle rotor from
de: Letzte zu analysierende Rotorstellung in der linken Position.
zh_cn: 中间转子

# MiddleRotorFromTooltip
source: First rotor in middle position to analyze
de: Mittler Rotor von
zh_cn: 第一个处于中间位置的转子进行分析

# MiddleRotorPositionFromCaption
source: Middle rotor position from
de: Erster Rotor, der in der mittleren Position zu analysieren ist.
zh_cn: 转子中间位置从

# MiddleRotorPositionFromTooltip
source: First rotor position in middle position to analyze
de: Mittler Rotorstellung von
zh_cn: 第一转子位置在中间位置以进行分析

# MiddleRotorPositionToCaption
source: Middle rotor position to
de: Erste Rotorstellung, welche in der mittleren Position zu analysieren ist.
zh_cn: 转子中间位置

# MiddleRotorPositionToTooltip
source: Last rotor position in middle position to analyze
de: Mittlere Rotorstellung bis
zh_cn: 最后一个转子位置在中间位置以进行分析

# MiddleRotorToCaption
source: Middle rotor to
de: Mittlerer Rotor bis
zh_cn: 中转子

# MiddleRotorToTooltip
source: Last rotor in middle position to analyze
de: Letzter Rotor, der in der mittleren Position zu analysieren ist.
zh_cn: 最后一个转子处于中间位置以进行分析

# PlaintextCaption
source: Best plaintext
de: Bester Klartext
zh_cn: 最佳明文

# PlaintextTooltip
source: The best plaintext which was found during the analysis.
de: Der beste Klartext der während der Analyse gefunden wurde.
zh_cn: 分析过程中发现的最佳明文。

# PluginCaption
source: Enigma Analyzer
de: Enigma-Analyse
zh_cn: 谜分析器

# PluginTooltip
source: Component to cryptanalyze different types of the Enigma crypto machine
de: Komponente zur Kryptoanalyse verschiedener Typen der Enigma-Rotorschlüsselmaschine.
zh_cn: 加密分析不同类型的Enigma加密机的组件

# PlugsInputCaption
source: Plugs
de: Stecker
zh_cn: 插头

# PlugsInputTooltip
source: Plugs, that are used during Trigram Search.
de: Stecker, die bei der Trigramm-Suche verwendet werden.
zh_cn: 在Trigram搜索期间使用的插头。

# RankingHeader
source: Ranking
de: Rangfolge
zh_cn: 排行

# ReflectorFromCaption
source: Reflector from
de: Reflektor von
zh_cn: 反射镜来自

# ReflectorFromTooltip
source: First reflector to analyze
de: Erster zu analysierender Reflektor
zh_cn: 首先要分析的反射器

# ReflectorFromTooltip1
source: Last reflector to analyze
de: Letzter zu analysierender Reflektor
zh_cn: 最后要分析的反射器

# ReflectorGroup
source: Reflectors
de: Reflektoren
zh_cn: 反光板

# ReflectorToCaption
source: Reflector to
de: Reflektor zu
zh_cn: 反光板

# RightRingFromCaption
source: Right ring from
de: Rechter Ring von
zh_cn: 右环起

# RightRingFromTooltip
source: First ring in right position to analyze
de: Erster Ring, der in der rechten Position zu analysieren ist.
zh_cn: 第一环处于正确位置以进行分析

# RightRingToCaption
source: Right ring to
de: Rechter Ring bis
zh_cn: 右环到

# RightRingToTooltip
source: Last ring in right position to analyze
de: Letzter Ring, der in der rechten Position zu analysieren ist.
zh_cn: 最后一个环处于正确位置以进行分析

# RightRotorFromCaption
source: Right rotor from
de: Letzte zu analysierende Rotorstellung in der rechten Position.
zh_cn: 右转子从

# RightRotorFromTooltip
source: First rotor in right position to analyze
de: Rechter Rotor von
zh_cn: 第一个转子处于正确位置以进行分析

# RightRotorPositionFromCaption
source: Right rotor position from
de: Erster Rotor, der in der rechten Position zu analysieren ist.
zh_cn: 从右转子位置

# RightRotorPositionFromTooltip
source: First rotor position in right position to analyze
de: Rechter Rotorstellung von
zh_cn: 第一个转子位置在正确位置以进行分析

# RightRotorPositionToCaption
source: Right rotor position to
de: Erste Rotorstellung, welche in der rechten Position zu analysieren ist.
zh_cn: 右转子位置

# RightRotorPositionToTooltip
source: Last rotor position in right position to analyze
de: Rechte Rotorstellung bis
zh_cn: 最后的转子位置在正确位置以进行分析

# RightRotorToCaption
source: Right rotor to
de: Rechter Rotor bis
zh_cn: 右转子到

# RightRotorToTooltip
source: Last rotor in right position to analyze
de: Letzter Rotor, der in rechter Position zu analysieren ist.
zh_cn: 最后一个转子处于正确位置以进行分析

# RingGroup
source: Ring positions
de: Ringstellungen
zh_cn: 戒指位置

# RotorGroup
source: Rotors
de: Rotoren
zh_cn: 转子

# RotorPositionGroup
source: Rotor positions
de: Rotorstellungen
zh_cn: 转子位置

source: Search from:
de: Suche von:
zh_cn: 搜索来自：

source: Search to:
de: Suche bis:
zh_cn: 搜索到：

# StartLabel
source: Start time:
de: Startzeit:
zh_cn: 开始时间：

# TextHeader
source: Text
zh_cn: 文本

# ThreadsCaption
source: Threads
zh_cn: 线程数

# ThreadsTooltip
source: How many threads should be used during the analysis?
de: Wie viele Threads sollen während der Analyse verwendet werden?
zh_cn: 分析期间应使用多少个线程？

# TimeLeftLabel
source: Time left:
de: Verbleibende Zeit:
zh_cn: 剩下的时间：

# TopTenLabel
source: Top list
de: Bestenliste
zh_cn: 排行榜

# ValueHeader
source: Value
de: Wert
zh_cn: 值
