Repository: CrypToolProject/CrypTool-2
Catalog: CrypPluginsExperimental/SIgabaKnownPlaintext/Properties/Resources.*.resx
Languages: de

# ActionTooltip
source: Choose the mode of operation
de: Operationsmodus

# AnalysisUseRotorICaption
source: Use code wheel 01
de: Benutze Chiffre/Steuer-Rotor 01

# AnalysisUseRotorIICaption
source: Use code wheel 02
de: Benutze Chiffre/Steuer-Rotor 02

# AnalysisUseRotorIIICaption
source: Use code wheel 03
de: Benutze Chiffre/Steuer-Rotor 03

# AnalysisUseRotorIVCaption
source: Use code wheel 04
de: Benutze Chiffre/Steuer-Rotor 04

# AnalysisUseRotorIXCaption
source: Use code wheel 09
de: Benutze Chiffre/Steuer-Rotor 09

# AnalysisUseRotorVCaption
source: Use code wheel 05
de: Benutze Chiffre/Steuer-Rotor 05

# AnalysisUseRotorVICaption
source: Use code wheel 06
de: Benutze Chiffre/Steuer-Rotor 06

# AnalysisUseRotorVIICaption
source: Use code wheel 07
de: Benutze Chiffre/Steuer-Rotor 07

# AnalysisUseRotorVIIICaption
source: Use code wheel 08
de: Benutze Chiffre/Steuer-Rotor 08

# AnalysisUseRotorXCaption
source: Use code wheel 10
de: Benutze Chiffre/Steuer-Rotor 10

# AnalyzeCipherRotors1Caption
source: Show cipher wheel 1 analyse options
de: Zeige Analyseoptionen Chiffre-Rotor 1

# AnalyzeCipherrotors2caption
source: Show cipher wheel 2 analyse options
de: Zeige Analyseoptionen Chiffre-Rotor 2

# AnalyzeCipherRotors3Caption
source: Show cipher wheel 3 analyse options
de: Zeige Analyseoptionen Chiffre-Rotor 3

# AnalyzeCipherRotors4Caption
source: Show cipher wheel 4 analyse options
de: Zeige Analyseoptionen Chiffre-Rotor 4

# AnalyzeCipherrotors5caption
source: Show cipher wheel 5 analyse options
de: Zeige Analyseoptionen Chiffre-Rotor 5

# AnalyzeControlRotors1Caption
source: Show control wheel 1 analyse options
de: Zeige Analyseoptionen Steuer-Rotor 1

# AnalyzeControlrotors2caption
source: Show control wheel 2 analyse options
de: Zeige Analyseoptionen Steuer-Rotor 2

# AnalyzeControlRotors3Caption
source: Show control wheel 3 analyse options
de: Zeige Analyseoptionen Steuer-Rotor 3

# AnalyzeControlRotors4Caption
source: Show control wheel 4 analyse options
de: Zeige Analyseoptionen Steuer-Rotor 4

# AnalyzeControlrotors5caption
source: Show control wheel 5 analyse options
de: Zeige Analyseoptionen Steuer-Rotor 5

# AnalyzeIndexRotors1Caption
source: Show index wheel 1 analyse options
de: Zeige Analyseoptionen Index-Rotor 1

# AnalyzeIndexrotors2caption
source: Show index wheel 2 analyse options
de: Zeige Analyseoptionen Index-Rotor 2

# AnalyzeIndexRotors3Caption
source: Show index wheel 3 analyse options
de: Zeige Analyseoptionen Index-Rotor 3

# AnalyzeIndexRotors4Caption
source: Show index wheel 4 analyse options
de: Zeige Analyseoptionen Index-Rotor 4

# AnalyzeIndexrotors5caption
source: Show index wheel 5 analyse options
de: Zeige Analyseoptionen Index-Rotor 5

# CalculateKeypaceCaption
source: Calculate keyspace
de: Berechne Schlüsselraum

# CalculateKeypaceTooltip
source: Calculates the keyspace of the actual settings
de: Berechne den Schlüsselraum nach diesen Analyseoptionen

# CaseHandlingCaption
source: Case handling
de: Groß/Kleinschreibung

# CaseHandlingList1
source: Preserve case
de: Speichern

# CaseHandlingList2
source: Convert to upper
de: Konvertieren in Großbuchstaben

# CaseHandlingList3
source: Convert to lower
de: Konvertieren in Kleinbuchstaben

# CaseHandlingTooltip
source: What should be done with upper and lower case letters?
de: Wie soll mit Groß/Kleinschreibung umgegangen werden?

# Cipher1AnalysisOptionsGroup
source: Choice for cipher wheel 1
de: Auswahl für Chiffre-Rotor 1

# Cipher2AnalysisOptionsGroup
source: Choice for cipher wheel 2
de: Auswahl für Chiffre-Rotor 2

# Cipher3AnalysisOptionsGroup
source: Choice for cipher wheel 3
de: Auswahl für Chiffre-Rotor 3

# Cipher4AnalysisOptionsGroup
source: Choice for cipher wheel 4
de: Auswahl für Chiffre-Rotor 4

# Cipher5AnalysisOptionsGroup
source: Choice for cipher wheel 5
de: Auswahl für Chiffre-Rotor 5

# CipherGroup
source: Alphabet maze
de: Chiffre-Bank

# CipherKeyCaption
source: Cipher key
de: Schlüssel Chiffre-Bank

# CipherKeyHeader
source: Cipher key
de: Schlüssel Chiffre-Bank

# CipherKeyTooltip
source: Defines the positions of the cipher rotors
de: Stellt die Positionen der Chiffre-Rotoren dar

# CipherRotor1Caption
source: Cipher rotor 1 (most left)
de: Chiffre-Rotor 1 (ganz links)

source: Cipher rotor 1: From
de: Chiffre-Rotor 1: Von

# CipherRotor1ReverseCaption
source: Reverse
de: Rückwärts

# CipherRotor1Tooltip
source: Defines the typ of the first cipher rotor
de: Bestimmt den Typ von Chiffre Rotor 1

# CipherRotor2Caption
source: Cipher rotor 2
de: Chiffre-Rotor 2

# CipherRotor2FromCaption
source: Cipher rotor 2: From
de: Chiffre-Rotor 2: Von

# CipherRotor2ReverseTooltip
source: Check for plug the rotor heads up
de: bestimmt die Ausrichtung des Rotoren

# CipherRotor2Tooltip
source: Defines the typ of the second cipher rotor
de: Bestimmt den Typ des zweiten Chiffre-Rotors

# CipherRotor3Caption
source: Cipher Rotor 3
de: Chiffre-Rotor 3

# CipherRotor3FromCaption
source: Cipher rotor 3: From
de: Chiffre-Rotor 3: Von

# CipherRotor3ToolTip
source: Defines the type of the third cipher rotor
de: Bestimmt den Typ des dritten Chiffre-Rotors

# CipherRotor4Caption
source: Cipher Rotor 4
de: Chiffre-Rotor 4

# CipherRotor4FromCaption
source: Cipher rotor 4: From
de: Chiffre-Rotor 4: Von

# CipherRotor4Tooltip
source: Defines the type of the fourth cipher rotor
de: Bestimmt den Typ des vierten Chiffre-Rotors

# CipherRotor5Caption
source: Cipher Rotor 5 (most right)
de: Chiffre-Rotor 5 ganz rechts)

# CipherRotor5FromCaption
source: Cipher rotor 5: From
de: Chiffre-Rotor 5: Von

# CipherRotor5Tooltip
source: Defines the type of the fith cipher rotor
de: Bestimmt den Typ des fünften Chiffre-Rotors

# CipherRotorsHeader
source: Cipher wheels
de: Chiffre-Rotoren

# Control1AnalysisOptionsGroup
source: Choice for control wheel 1
de: Auswahl für Steuer-Rotor 1

# Control2AnalysisOptionsGroup
source: Choice for control wheel 2
de: Auswahl für Steuer-Rotor 2

# Control3AnalysisOptionsGroup
source: Choice for control wheel 3
de: Auswahl für Steuer-Rotor 3

# Control4AnalysisOptionsGroup
source: Choice for control wheel 4
de: Auswahl für Steuer-Rotor 4

# Control5AnalysisOptionsGroup
source: Choice for control wheel 5
de: Auswahl für Steuer-Rotor 5

# ControlGroup
source: Stepping maze
de: Steuerlabyrinth

# ControlKeyCaption
source: Control key
de: Schlüssel Steuer-Bank

# ControlKeyHeader
source: Control key
de: Schlüssel Steuer-Bank

# ControlKeyTooltip
source: Defines the positions of the control rotors
de: Bestimmt die Position der Steuer-Rotoren

# ControlRotor1Caption
source: Control rotor 1 (most right)
de: Steuer-Rotor 1 (ganz rechts)

# ControlRotor1FromCaption
source: Control rotor 1: From
de: Steuer-Rotor 1: Von

# ControlRotor1ReverseCaption
source: Reverse
de: Rückwärts

# ControlRotor1Tooltip
source: Defines the typ of the first control rotor
de: Bestimmt den Typ des ersten Steuer-Rotor

# ControlRotor2Caption
source: Control rotor 2
de: Steuer-Rotor 2

# ControlRotor2FromCaption
source: Control rotor 2: From
de: Steuer-Rotor 2: Von

# ControlRotor2ReverseTooltip
source: Click for plug in the rotor heads up
de: Bestimmt die Ausrichtung des Rotoren

# ControlRotor2Tooltip
source: Defines the typ of the second control rotor
de: Bestimmt den Typen des zweiten Steuer-Rotors

# ControlRotor3Caption
source: Control rotor 3
de: Steuer-Rotor 3

# ControlRotor3FromCaption
source: Control rotor 3: From
de: Steuer-Rotor 3: Von

# ControlRotor3Tooltip
source: Defines the type of the third control rotor
de: Bestimmt den Typen des dritten Steuer-Rotors

# ControlRotor4Caption
source: Control rotor 4
de: Steuer-Rotor 4

# ControlRotor4FromCaption
source: Control rotor 4: From
de: Steuer-Rotor 4: Von

# ControlRotor4ToolTip
source: Defines the type of the fourth control rotor
de: Bestimmt den Typen des vierten Steuer-Rotors

# ControlRotor5Caption
source: Control rotor 5 (most left)
de: Steuer-Rotor 5 (ganz links)

# ControlRotor5FromCaption
source: Control rotor 5: From
de: Steuer-Rotor 5: Von

# ControlRotor5ToolTip
source: Defines the type of the fith control rotor
de: Bestimmt den Typen des fünften Steuer-Rotors

# ControlRotorsHeader
source: Control wheels
de: Steuer-Rotoren

# ElapsedLabel
source: Elapsed:
de: Vergangen:

# EndLabel
source: End:
de: Ende:

# IndexAnalysisUseRotorICaption
source: Use index wheel 10
de: Benutze Index-Rotor 10

# IndexAnalysisUseRotorIICaption
source: Use index wheel 20
de: Benutze Index-Rotor 20

# IndexAnalysisUseRotorIIICaption
source: Use index wheel 30
de: Benutze Index-Rotor 30

# IndexAnalysisUseRotorIVCaption
source: Use index wheel 40
de: Benutze Index-Rotor 40

# IndexAnalysisUseRotorVCaption
source: Use index wheel 50
de: Benutze Index-Rotor 50

# IndexGroup
source: Index maze
de: Index-Labyrinth

# IndexKeyCaption
source: Index key
de: Schlüssel Index-Bank

# IndexKeyHeader
source: Index key
de: Schlüssel Index-Bank

# IndexKeyTooltip
source: Defines the positions of the index rotors
de: Bestimmt die Positionen der Index-Rotoren

# IndexRotor1Caption
source: Index Rotor 1 (most left)
de: Index-Rotor 1 (ganz links)

# IndexRotor1FromCaption
source: Index rotor 1: From
de: Index-Rotor 1: Von

# IndexRotor1Tooltip
source: Defines the type of the first index rotor
de: Bestimmt den Typ des ersten Index-Rotors

# IndexRotor2FromCaption
source: Index rotor 2: From
de: Index-Rotor 2: Von

# IndexRotor2Tooltip
source: Defines the type of the second index rotor
de: Bestimmt den Typ des zweiten Index-Rotors

# IndexRotor3FromCaption
source: Index rotor 3: From
de: Index-Rotor 3: Von

# IndexRotor3Tooltip
source: Defines the type of the third index rotor
de: Bestimmt den Typ des dritten Index-Rotors

# IndexRotor4FromCaption
source: Index rotor 4: From
de: Index-Rotor 4: Von

# IndexRotor4Tooltip
source: Defines the type of the fourth index rotor
de: Bestimmt den Typ des vierten Index-Rotors

# IndexRotor5Caption
source: Index Rotor 5 (most right)
de: Index-Rotor 5 (ganz rechts)

# IndexRotor5FromCaption
source: Index rotor 5: From
de: Index-Rotor 5: Von

# IndexRotor5Tooltip
source: Defines the type of the fith index rotor
de: Bestimmt den Typ des fünften Index-Rotors

# IndexRotorHeader
source: Index wheels
de: Index-Rotoren

# KeyspaceCaption
source: Keyspace
de: Schlüsselraum

# Keys_secLabel
source: Keys/Second:
de: Schlüssel/Sekunde:

# LocalLabel
source: Main
de: Haupt

# PluginCaption
source: SIGABA Known Plaintext
de: SIGABA-Schlüsselsucher

# PluginToolTip
source: Analyzing tool for the American rotor cipher machine SIGABA with known plaintext
de: Amerikanische Rotorverschlüsselungsmaschine

# PositionOptionsGroup
source: Wheel positions
de: Rotor-Positionen

# RemainingLabel
source: Remaining:
de: Verbleibend:

# RevCaption
source: Use reverse position
de: Betrachte rückwärts Positionen

# reverseCaption
source: reverse
de: Rückwärts

# SigabaSettings_SigabaSettings_Cipher
source: Encrypt
de: Entschlüsseln

# SigabaSettings_SigabaSettings_Decipher
source: Decrypt
de: Verschlüsseln

# TextOptionsGroup
source: Text options
de: Textoptionen

# ToCaption
source: To
de: Bis

# undefinedCaption
source: undefined
de: undefiniert

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Umgang mit unbekannten Zeichen

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (unmodifiziert lassen)

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen

# UnknownSymbolHandlingList3
source: Replace with 'X'
de: Ersetzen mit 'X'

# UnknownSymbolHandlingTooltip
source: What should be done with encountered characters at the input which are not in the alphabet?
de: Was soll mit Zeichen geschehen, die nicht im Alphabet der Maschine enthalten sind?

# ValueHeader
source: Value
de: Wert
