Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/LAMBDA1/Properties/Resources.*.resx
Languages: de, zh_cn

# DecryptButton
source: Decrypt
de: Entschlüsseln
zh_cn: 解密

# EncryptButton
source: Encrypt
de: Verschlüsseln
zh_cn: 加密

# ErrorInputBlockLength
source: Could not start decrypting; the ciphertext input ({0} bytes) is not a multiple of the LAMBDA1 block length {1}. Check if you copied all bytes from the encryption process.
de: Entschlüsselungsvorgang kann nicht gestartet werden; das eingegebene Chiffrat ({0} Byte) ist kein Vielfaches der LAMBDA1-Blocklänge {1}. Möglicherweise wurde das Eingabe-Chiffrat unabsichtlich abgeschnitten.
zh_cn: 无法开始解密；密文输入（{0}字节）不是LAMBDA1块长度{1}的倍数。检查是否复制了加密过程中的所有字节。

# ErrorInputDataEmpty
source: No data provided. The length is {0}.
de: Keine Eingabedaten vorhanden. Die Länge der Eingabedaten ist {0}
zh_cn: 没有提供数据。长度为{0}。

# ErrorInputDataNull
source: No input data connected.
de: Es sind keine Eingabedaten vorhanden.
zh_cn: 未连接输入数据。

# ErrorIVLength
source: The given initialization vector has an invalid length ({0} byte). The length must match with the block size of {1} bytes.
de: Der angegebene Initialisierungsvektor hat eine ungültige Länge ({0} Byte). Die Länge muss mit der Blocklänge von {1} Byte übereinstimmen.
zh_cn: 给定的初始化向量的长度无效（{0}字节）。该长度必须与{1}个字节的块大小匹配。

# ErrorKeyLengthEmpty
source: The given key is empty ({0} bytes). The required key length is {1} bytes.
de: Der eingegebene Schlüssel ist leer ({0} Byte). Es wird ein Schlüssel der Länge {1} Byte benötigt.
zh_cn: 给定的键为空（{0}字节）。所需的密钥长度为{1}字节。

# ErrorKeyLengthShort
source: The given key is too short ({0} bytes). The required key length is {1} bytes.
de: Der eingegebene Schlüssel ist zu kurz ({0} Byte). Es wird ein Schlüssel der Länge {1} Bytes benötigt.
zh_cn: 给定的密钥太短（{0}字节）。所需的密钥长度为{1}字节。

# ErrorKeyNull
source: No input key connected. A key with 32 bytes must be provided.
de: Es ist kein Schlüsselkonnektor verbunden. Schließen Sie eine Eingabe mit einem Schlüssel der Länge 32 Byte an.
zh_cn: 未连接输入键。必须提供一个32字节的密钥。

# ErrorKeyOverlength
source: The given key is too long ({0} bytes). The required key length is {1}. Exceeding bytes will be truncated.
de: Der eingegebene Schlüssel ist zu kurz ({0} Byte). Es wird ein Schlüssel der Länge {1} Bytes benötigt. Die überzähligen Bytes werden abgeschnitten.
zh_cn: 给定的密钥太长（{0}字节）。所需的密钥长度为{1}。超出的字节将被截断。

# InfoIVMissing
source: No initialization vector provided, will use 0x00...0x00
de: Kein Initialisierungsvektor angegeben, falle zurück auf 0x00...0x00
zh_cn: 没有提供初始化向量，将使用0x00 ... 0x00

source: Input data
de: Eingabedaten
zh_cn: 输入数据

# InputDataTooltip
source: Enter a plaintext message (for encryption) or a ciphertext (for decryption)
de: Geben Sie einen beliebigen Klartext (zum Verschlüsseln) oder ein Chiffrat (zum Entschlüsseln) ein.
zh_cn: 输入纯文本消息（用于加密）或密文（用于解密）

# InputIV
source: Initialization Vector
zh_cn: 初始化向量

# InputIVTooltip
source: Specify initialization vector (IV)
zh_cn: 指定初始化向量（IV）

# InputKey
source: Key
de: Schlüssel
zh_cn: 键

# InputKeyTooltip
source: Provide a 32 byte key (256 bit) for the algorithm
de: Geben Sie einen 32-Byte-Schlüssel (256 Bits) für den Algorithmus ein.
zh_cn: 为算法提供32字节的密钥（256位）

source: Mode
de: Modus
zh_cn: 模式

# ModeDescription
source: Choose whether you want to encrypt or decrypt data
de: Bestimmt ob die Eingangsdaten ver- oder entschlüsselt werden.
zh_cn: 选择您要加密还是解密数据

source: Output Data
de: Ausgabedaten
zh_cn: 输出数据

# OutputDataTooltip
source: Outputs a ciphertext in hexadecimal or a decrypted plaintext in ASCII
de: Gibt ein Chiffrat in hexadezimaler Form oder einen entschlüsselten Klartext als ASCII aus.
zh_cn: 输出十六进制密文或ASCII解密明文

# PluginTooltip
source: LAMBDA1 is a historic block cipher based on DES. It was developed in the 1980s in Eastern Germany
de: LAMBDA1 ist eine historische Blockchiffre, die auf DES basiert. Sie wurde in den 1980er Jahren in der Deutschen Demokratischen Republik (DDR) entwickelt.
zh_cn: LAMBDA1是基于DES的历史分组密码。它于1980年代在德国东部开发
