Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Primes/Primes/Resources/lang/WpfControls/Primetest/Primetest.*.resx
Languages: de

# mr_calculating1
source: Calculate {0}^{1} mod {2} = {3}
de: Berechne {0}^{1} mod {2} = {3}

# mr_calculating2
source: Calculate ({0}^{1})^{2} mod {3} = {4}^2 mod {3} = {5}
de: Berechne ({0}^{1})^{2} mod {3} = {4}^2 mod {3} = {5}

# mr_choosearnd
source: Choose a base from 2 to
de: Auswahl der Basis von 2 bis

# mr_chooseasys
source: Choose a base
de: Wahl der Basis

# mr_countrounds
source: Maximum number of rounds
de: Maximale Anzahl der Runden

# mr_iseven
source: {0} is odd and thus not a prime.
de: {0} ist gerade und kann daher keine Primzahl sein.

# mr_isnotprime1
source: {0} is a square root of 1 mod {1}. Thus {1} can't be a prime.
de: {0} ist eine Quadratwurzel von 1 mod {1}. Daher kann {1} keine Primzahl sein.

# mr_isnotprime2
source: {0} has failed the Fermat test, as {1}^{2} mod {3} = {4} ≠ 1. Thus {0} can't be a prime.
de: {0} hat den Fermat-Test nicht bestanden, denn {1}^{2} mod {3} = {4} ≠ 1. Daher kann {0} keine Primzahl sein.

# mr_isprime
source: Round with base {0} finished. {1} could be a prime.
de: Runde mit Basis {0} beendet. {1} könnte eine Primzahl sein.

# mr_options
source: Options
de: Optionen

# mr_rbchoosearnd
source: Random base choice
de: Zufällige Wahl der Basen

# mr_rbchooseasys
source: Systematic base choice
de: Systematische Auswahl der Basen

# mr_round
source: Round {0} with base {1}
de: Runde {0} mit Basis {1}

# mr_shiftcalc
source: Calculate the biggest power of 2, that divides n-1 = {0}.
de: Berechne die größte Zweierpotenz, die n-1 = {0} teilt.

# mr_shiftedright
source: There was {0} right shift: : {1} = 2^{0} * {2}
de: Es wurde {0} mal nach rechts geschoben: {1} = 2^{0} * {2}

# mr_shiftedright2
source: There were {0} right shifts: : {1} = 2^{0} * {2}
de: Es wurde {0} mal nach rechts geschoben: {1} = 2^{0} * {2}

# mr_shiftright
source: {0} is even and is shifted right by 1 bit = {1}
de: {0} ist gerade und wird um ein Bit nach rechts geschoben = {1}

# mr_witnessfound1
source: Found a witness after {0} round. Thus {1} is not a prime number.
de: Nach {0} Runde wurde ein Zeuge gefunden, daher ist {1} keine Primzahl.

# mr_witnessfound2
source: Found a witness after {0} rounds. Thus {1} is not a prime number.
de: Nach {0} Runden wurde ein Zeuge gefunden, daher ist {1} keine Primzahl.

# mr_witnessnotfound1
source: No witnesses found after {0} round. Thus {1} is probably a prime number.
de: Nach {0} Runde wurde kein Zeuge gefunden, daher ist {1} wahrscheinlich eine Primzahl.

# mr_witnessnotfound2
source: No witnesses found after {0} rounds. Thus {1} is probably a prime number.
de: Nach {0} Runden wurde kein Zeuge gefunden, daher ist {1} wahrscheinlich eine Primzahl.

# soe_btnresume
source: Resume automatic execution
de: Weiter mit automatischer Ausführung

# soe_done
source: done
de: fertig

# soe_doneautomatic
source: Execution done:
de: Ausführung beendet:

# soe_infostepwise1
source: List all numbers from 2 to {0}!
de: Es werden alle Zahlen von 2 bis {0} aufgelistet!

# soe_infostepwise2
source: Please remove all multiples of the next number, beginning with 2, by clicking the number.
de: Bitte streichen Sie Vielfache der nächsten Zahl, beginnend bei 2, indem Sie die Zahl anklicken.

# soe_isnotprime
source: {0} is not a prime
de: {0} ist keine Primzahl

# soe_isprime
source: {0} is a prime
de: {0} ist eine Primzahl

# soe_method
source: Method
de: Verfahren

# soe_methodauto
source: automatic
de: Automatisch

# soe_methodstepwise
source: stepwise
de: Schrittweise geführt

# soe_multiplenotexpected
source: The number {0} was not expected.
de: Die Zahl {0} wurde nicht erwartet.

# soe_removemultiple
source: The multiples of {0} are removed.
de: Die Vielfachen von {0} werden entfernt.

# soe_removemultipleof
source: Remove multiples of {0}.
de: Entferne Vielfache von {0}.

# soe_validatormessage
source: Only numbers from {0} to {1} are allowed for the "Sieve of Eratosthenes".
de: Für das Verfahren "Sieb des Eratosthenes" werden nur Zahlen von {0} bis {1} zugelassen.

# test_fermat
source: Fermat-Test
de: Test nach Fermat

# test_genNumber
source: Generate prime candidate
de: Die zu testende Zahl generieren

# test_groupboxheader
source: Prime candidate
de: Zu testende Zahl

# test_soa
source: Sieve of Atkin
de: Sieb des Atkin

# test_soe
source: Sieve of Eratosthenes
de: Sieb des Eratosthenes
