Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/ImageHash/Properties/Resources.*.resx
Languages: de, zh_cn

# PluginCaption
source: ImageHash
de: BildHash
zh_cn: 图像哈希

# PluginTooltip
source: Calculates the robust hash of an image
de: Berechnet den robusten Hashwert eines Bildes
zh_cn: 计算图像的鲁棒哈希

# OutputHashCaption
source: OutputHash
de: Ausgabe-Hash
zh_cn: 输出哈希

# InputImageTooltip
source: This is the standard image used for the hashing.
de: Das ist das Standardbild, dessen Hash berechnet wird.
zh_cn: 这是用于哈希的标准图像。

# OutputImageCaption
source: OutputImage
de: Ausgabebild

# NoImageError
source: Please select a valid image, using the file input component
de: Bitte ein valides Bild mit dem Dateieingabe-Komponent auswählen
zh_cn: 请使用文件输入组件选择有效的图像

# InputImageCaption
source: InputImage
de: Eingabebild

# OutputHashTooltip
source: The calculated Hash as byte array
de: Der errechnete Hash als byte Array
zh_cn: 计算得出的哈希为字节数组

# OutputImageTooltip
source: This is the OutputImage after processing.
de: Dies ist das Ausgabebild nach der Verarbeitung
zh_cn: 这是经过处理的OutputImage。

# ToSmallWarning
source: The chosen size is too small. Changed size to 4x4.
de: Die ausgewählte Größe ist zu klein. Größe zu 4x4 geändert.
zh_cn: 选择的尺寸太小。将大小更改为4x4。

# PowerOfTwoWarning
source: Please select a power of two. Changed size to
de: Bitte eine Zweierpotenz auswählen. Größe geändert zu
zh_cn: 请选择2的幂。大小更改为

# ToBigWarning
source: The chosen size is too big. Changed size to 128x128.
de: Die ausgewählte Größe ist zu groß. Größe zu 128x128 geändert.
zh_cn: 选择的尺寸太大。将大小更改为128x128。

# PresentationStepTooltip
source: Choose the step to display
de: Anzuzeigenden Schritt wählen
zh_cn: 选择要显示的步骤

# Step0Caption
source: Original Image
de: Originalbild
zh_cn: 原始图片

# Step1Caption
source: Step 1: Gray scale
de: Schritt 1: Grau zeichnen
zh_cn: 步骤1：灰度

# Step2Caption
source: Step 2: Resize
de: Schritt 2: Größenänderung
zh_cn: 步骤2：调整大小

# Step3Caption
source: Step 3: Flip
de: Schritt 3: Drehen
zh_cn: 步骤3：翻转

# Step4Caption
source: Step 4: Black and White
de: Schritt 4: Schwarz und Weiß
zh_cn: 步骤4：黑白

# OutputFileFormatCaption
source: OutputFileFormat
de: Ausgabedateiformat

# OutputFileFormatTooltip
source: Choose the desired output format
de: Das Gewünschte Ausgabeformat auswählen
zh_cn: 选择所需的输出格式

# SizeCaption
source: Size (standard: 16x16)
de: Größe (standard: 16x16)
zh_cn: 尺寸（标准：16x16）

# SizeTooltip
source: Enter a value of horizontal and vertical pixels, from 4 to 128, only powers of two
de: Erwartet einen Wert von 4 bis 128 für die vertikalen und horizontalen Pixel (nur Zweierpotenzen)
zh_cn: 输入4到128的水平和垂直像素值，只能是2的幂

# SliderGroup
source: Slider
de: Schieberegler
zh_cn: 滑杆

# StepsCaption
source: Show each step
de: Jeden Schritt anzeigen
zh_cn: 显示每一步

# StepsTooltip
source: Show each step already during the process
de: Jeden Schritt bereits während des Prozesses anzeigen
zh_cn: 显示过程中已经显示的每个步骤
