Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Speck/Properties/Resources.*.resx
Languages: de, zh_cn

# ChoiceOfModeOfOperation
source: Block chaining mode:
de: Blockverkettungsmodus:
zh_cn: 区块链模式：

# ChoiceOfModeOfOperationGroup
source: Mode of operation
de: Betriebsmodus
zh_cn: 操作模式

# ChoiceOfModeOfOperationToolTip
source: Defines the mode of operation of the cipher
de: Legt den Betriebsmodus der Chiffre fest
zh_cn: 定义密码的操作模式

# ChoiceOfOperatingMode
source: Action:
de: Aktion:
zh_cn: 行动：

# ChoiceOfOperatingModeGroup
source: Encrypt / Decrypt
de: Ver- / Entschlüsseln
zh_cn: 加密/解密

# ChoiceOfOperatingModeToolTip
source: Determines whether the component encrypts or decrypts the input
de: Legt fest, ob die Komponente die Eingabe ver- oder entschlüsselt
zh_cn: 确定组件是否对输入进行加密或解密

# ChoiceOfPaddingMode
source: Padding mode:
de: Padding-Modus:
zh_cn: 填充模式：

# ChoiceOfPaddingModeGroup
source: Padding
zh_cn: 填充

# ChoiceOfPaddingModeToolTip
source: Sets the mode for padding data blocks.
de: Stellt den Modus zum Füllen von Datenblöcken ein.
zh_cn: 设置填充数据块的模式。

# ChoiceOfVariant
source: Parameterization:
de: Parametrisierung:
zh_cn: 参数化：

# ChoiceOfVariantGroup
source: Block size/key length
de: Blockgröße/Schlüssellänge
zh_cn: 块大小/密钥长度

# ChoiceOfVariantToolTip
source: Block size and key length of Speck can be selected here
de: Hier können Blockgröße und Schlüssellänge von Speck ausgewählt werden
zh_cn: 可以在此处选择Speck的块大小和密钥长度

source: Decrypt
de: Entschlüsseln
zh_cn: 解密

# BlockModeList1
source: Electronic Code Book (ECB)
zh_cn: 电子密码书（ECB）

source: Encrypt
de: Verschlüsseln
zh_cn: 加密

# InputKeyCaption
source: Key
de: Schlüssel
zh_cn: 键

# InputKeyTooltip
source: The key provided must have the necessary length required by the selected parameterization of Speck. If the key is too short, processing is terminated. If the key is too long, the key is shortened.
de: Der bereitgestellte Schlüssel muss die notwendige Länge haben, die die gewählte Parametrisierung von Speck benötigt. Falls der Schlüssel zu kurz ist, bricht die Verarbeitung ab. Bei zu langen Schlüsseln wird der Schlüssel gekürzt.
zh_cn: 提供的密钥必须具有所选的Speck参数化所需的必要长度。如果密钥太短，则处理终止。如果键太长，则缩短键。

# InputStreamCaption
source: Input stream
de: Eingabestrom
zh_cn: 输入流

# InputStreamTooltip
source: Data to be encrypted or decrypted.
de: Daten die ver- oder entschlüsselt werden sollen
zh_cn: 要加密或解密的数据。

# OutputStreamCaption
source: Output stream
de: Ausgabestrom
zh_cn: 输出流

# OutputStreamTooltip
source: This connector outputs encrypted or decrypted data.
de: Ver- oder entschlüsselte Ausgabedaten
zh_cn: 该连接器输出加密或解密的数据。

# PaddingList2
source: Zeros
de: Nullen
zh_cn: 零点

# PluginCaption
source: Speck
zh_cn: 斑点

# PluginTooltip
source: Speck
zh_cn: 斑点

source: Speck128/128
zh_cn: 斑点128/128

source: Speck128/192
zh_cn: 斑点128/192

source: Speck128/256
zh_cn: 斑点128/256

source: Speck32/64
zh_cn: 斑点32/64

source: Speck48/72
zh_cn: 斑点48/72

source: Speck48/96
zh_cn: 斑点48/96

source: Speck64/128
zh_cn: 斑点64/128

source: Speck64/96
zh_cn: 斑点64/96

source: Speck96/144
zh_cn: 斑点96/144

source: Speck96/96
zh_cn: 斑点96/96

# Speck_blockmode_not_implemented
source: The mode {0} has not been implemented.
de: Der Betriebsmodus {0} ist nicht implementiert.
zh_cn: 尚未实现模式{0}。

# Speck_Execute_Key_too_long
source: The key length = {0} is too long. Cutting the key to length {1}.
de: Die Schlüssellänge = {0} ist zu lang. Der Schlüssel wird auf die Länge {1} gekürzt.
zh_cn: 密钥长度= {0}太长。将密钥剪切到长度{1}。

# Speck_Execute_Key_too_short
source: The key length = {0} is too short. Necessary key length is {1} byte.
de: Die Schlüssellänge = {0} ist zu kurz. Notwendige Schlüssellänge beträgt {1} Byte.
zh_cn: 密钥长度= {0}太短。必要的密钥长度为{1}字节。

# Speck_no_cryptofunction
source: No crypto function could be selected based on the settings.
de: Aufgrund der Einstellungen konnte keine Kryptofunktion ausgewählt werden.
zh_cn: 无法根据设置选择加密功能。

# BlockModeList2
source: Cipher Block Chaining (CBC)
zh_cn: 密码块链接（CBC）

# InputIVCaption
source: Initialization vector
de: Initialisierungsvektor
zh_cn: 初始化向量

# InputIVTooltip
source: The initialization vector (IV) which is used in chaining modes. It must have the same size as the blocks.
de: Der Initialisierungsvektor (IV), der in den Blockmodi verwendet wird. Er muss genauso groß sein wie die Blöcke.
zh_cn: 链接模式中使用的初始化向量（IV）。它必须具有与块相同的大小。

# PaddingList1
source: None
de: Kein
zh_cn: 没有

# PaddingList6
source: 1-0 Padding
zh_cn: 1-0填充

# Speck_Input_padded
source: The input stream was padded with {0}
de: Der Eingabestrom wurde mittels {0} gepadded
zh_cn: 输入流用{0}填充

# Speck_Input_too_short
source: The plaintext/ciphertext input stream is too short. Check blocklength of your input (see blocklength of selected Speck variant) or a padding mode must be selected.
de: Der Klartext/Geheimtext-Eingangsstrom ist zu kurz. Prüfen Sie die Blocklänge Ihrer Eingabe (siehe Blocklänge der gewählten Speck-Variante) oder es muss ein Padding-Modus ausgewählt werden.
zh_cn: 明文/密文输入流太短。检查输入的块长（请参阅所选Speck变体的块长）或必须选择填充模式。

# Speck_IV_too_long
source: The given initialization vector is too long. It will be truncated.
de: Der gegebene Initialisierungsvektor ist zu lang. Dieser wird abgeschnitten.
zh_cn: 给定的初始化向量太长。它将被截断。

# Speck_IV_too_short
source: The given initialization vector is too short. It will be padded with zeros.
de: Der gegebene Initialisierungsvektor ist zu kurz. Dieser wird mit Nullen aufgefüllt.
zh_cn: 给定的初始化向量太短。它将用零填充。

# Speck_No_IV_was_given
source: No initialization vector was specified. This is initialized with the value 0.
de: Es wurde kein Initialisierungsvektor spezifiziert. Dieser wird mit dem Wert 0 initialisiert.
zh_cn: 没有指定初始化向量。初始化为值0。

# BlockModeList3
source: Cipher Feedback (CFB)
zh_cn: 密码反馈（CFB）

# BlockModeList4
source: Output Feedback (OFB)
zh_cn: 输出反馈（OFB）
