Repository: CrypToolProject/CrypTool-2
Catalog: CrypToolStore/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: CrypTool Store
zh_cn: CrypTool商店

source: Plugins Overview
de: Plugins-Übersicht
ru: Обзор плагинов
zh_cn: 插件概述

# PluginTooltip
source: CrypTool Store allows the download of additional CrypTool 2 components
de: CrypTool-Store ermöglicht das Herunterladen zusätzlicher CrypTool 2-Komponenten
ru: CrypTool Store позволяет загружать дополнительные компоненты CrypTool 2
zh_cn: CrypTool Store允许下载其他CrypTool 2组件

# Welcome_To_CrypToolStore
source: Welcome to the CrypTool Store
de: Willkommen im CrypTool-Store
ru: Добро пожаловать в магазин CrypTool
zh_cn: 欢迎来到CrypTool商店

source: Search:
de: Suche:
ru: Поиск:
zh_cn: 搜索：

source: Authors:
de: Autoren:
ru: Авторы:
zh_cn: 作者：

source: Authors' emails:
de: Autoren-Emails
ru: Письма авторов:
zh_cn: 作者的电子邮件：

source: Authors' institutes:
de: Autoren-Institute:
ru: Авторские институты:
zh_cn: 作者机构：

# PendingChanges
source: You have recently installed or uninstalled components from the CrypTool Store. For the changes to take effect you have to restart CrypTool 2.
de: Sie haben kürzlich Komponenten aus dem CrypTool-Store installiert oder deinstalliert. Damit die Änderungen wirksam werden, müssen Sie CrypTool 2 neu starten.
ru: Недавно вы установили или удалили компоненты из CrypTool Store. Вы должны перезапустить CrypTool 2, чтобы изменения вступили в силу.
zh_cn: 您最近从CrypTool商店安装或卸载了组件。为了使更改生效，您必须重新启动CrypTool 2。

# RestartCrypTool2
source: Restart CrypTool 2 now
de: CrypTool 2 jetzt neu starten
ru: Перезапустить CrypTool 2 сейчас
zh_cn: 立即重新启动CrypTool 2

source: Install
de: Installieren
ru: устанавливать
zh_cn: 安装

source: Uninstall
de: Deinstallieren
ru: деинсталляция
zh_cn: 卸载

source: Exception occured during adding of current list of plugins to the user interface: {0}
de: Ausnahme beim Hinzufügen der aktuellen Liste der Plugins zur Benutzeroberfläche aufgetreten: {0}
ru: Исключение произошло при добавлении текущего списка плагинов пользовательского интерфейса: {0}
zh_cn: 当前插件列表添加到用户界面期间发生异常：{0}

source: Error occured during retrieval of current list of plugins from CrypToolStore: {0}
de: Fehler beim Abrufen der aktuellen Liste der Plugins aus CrypTool-Store aufgetreten: {0}
ru: Произошла ошибка при получении текущего списка плагинов из CrypToolStore: {0}
zh_cn: 从CrypToolStore检索当前插件列表期间发生错误：{0}

source: Exception occured during retrieval of current list of plugins from CrypToolStore: {0}
de: Ausnahme beim Abrufen der aktuellen Liste der Plugins aus CrypTool-Store aufgetreten: {0}
ru: Исключение произошло при извлечении текущего списка плагинов из CrypToolStore: {0}
zh_cn: 从CrypToolStore检索当前插件列表期间发生异常：{0}

source: Exception occured during showing of selected plugin in the right box of the CrypTool Store UI: {0}
de: Ausnahme beim Anzeigen des ausgewählten Plugins im rechten Feld der CrypTool-Store-Benutzeroberfläche aufgetreten: {0}
ru: Исключение произошло при просмотре выбранного плагина на правой панели интерфейса CrypToolStore: {0}
zh_cn: 在CrypTool Store UI的右框中显示所选插件期间发生异常：{0}

source: Do you really want to download and install "{0}" from CrypTool Store?
de: Möchten Sie "{0}" wirklich vom CrypTool-Store herunterladen und installieren?
ru: Вы действительно хотите загрузить и установить «{0}» из CrypTool Store?
zh_cn: 您真的要从CrypTool Store下载并安装“ {0}”吗？

source: Exception occured while deleting old installation files: {0}
de: Beim Löschen alter Installationsdateien ist eine Ausnahme aufgetreten: {0}
ru: Исключение произошло при удалении старых файлов установки: {0}
zh_cn: 删除旧的安装文件时发生异常：{0}

source: Exception occured while locking of everything: {0}
de: Ausnahme beim Sperren von allem aufgetreten: {0}
ru: Исключение произошло при блокировке всего: {0}
zh_cn: 锁定所有内容时发生异常：{0}

source: Could not download from CrypToolStore Server. Message was: {0}
de: Herunterladen von CrypTool-Store Server nicht möglich. Nachricht lautete: {0}
ru: Не удается загрузить сервер CrypToolStore. Сообщение было: {0}
zh_cn: 无法从CrypToolStore服务器下载。消息为：{0}

# CrypToolStorePresentation_InstallPlugin_Error_during_download_
source: Error during download.
de: Fehler während des Downloads.
ru: Ошибка при загрузке.
zh_cn: 下载期间出错。

source: "{0}" has been successfully downloaded. You need to restart CrypTool 2 to complete installation.
de: "{0}" wurde erfolgreich heruntergeladen. Sie müssen CrypTool 2 neu starten, um die Installation abzuschließen.
ru: «{0}» загружен успешно. Для завершения установки необходимо перезапустить CrypTool 2.
zh_cn: “ {0}”已成功下载。您需要重新启动CrypTool 2才能完成安装。

source: Exception occured while downloading and installing: {0}
de: Beim Herunterladen und Installieren ist eine Ausnahme aufgetreten: {0}
ru: Исключение произошло при загрузке и установке: {0}
zh_cn: 下载和安装期间发生异常：{0}

# CrypToolStorePresentation_InstallPlugin_Exception_occured_
source: Exception occured.
de: Ausnahme aufgetreten.
ru: Исключение произошло.
zh_cn: 发生异常。

source: Exception occured while unlocking of everything: {0}
de: Ausnahme beim Entsperren von allem aufgetreten: {0}
ru: Исключение произошло при разблокировке всего: {0}
zh_cn: 解锁所有内容时发生异常：{0}

source: Do you really want to uninstall "{0}"?
de: Möchten Sie "{0}" wirklich deinstallieren?
ru: Вы действительно хотите удалить «{0}»?
zh_cn: 您真的要卸载“ {0}”吗？

source: "{0}" has been marked for uninstallation. You need to restart CrypTool 2 to complete uninstallation.
de: "{0}" wurde zur Deinstallation markiert. Sie müssen CrypTool 2 neu starten, um die Deinstallation abzuschließen.
ru: «{0}» отмечен для удаления. Для завершения удаления необходимо перезапустить CrypTool 2.
zh_cn: “ {0}”已标记为要卸载。您需要重新启动CrypTool 2才能完成卸载。

source: Could not uninstall. Exception was: {0}
de: Deinstallation nicht möglich. Fehlermeldung: {0}
ru: Деинсталляция невозможна. Сообщение об ошибке: {0}
zh_cn: 无法卸载。例外是：{0}

# CrypToolStorePresentation_DeleteButton_Click_Exception_during_uninstallation_
source: Exception during uninstallation.
de: Ausnahme bei der Deinstallation.
ru: Исключение при удалении.
zh_cn: 卸载期间发生异常。

source: Exception occured while trying to restart CrypTool 2: {0}
de: Beim Neustart von CrypTool 2 ist eine Ausnahme aufgetreten: {0}
ru: Исключение произошло при перезапуске CrypTool 2: {0}
zh_cn: 尝试重新启动CrypTool 2时发生异常：{0}

# CrypToolStorePresentation_RestartButton_Click_Exception_during_restart_
source: Exception during restart.
de: Ausnahme beim Neustart aufgetreten.
ru: Исключение произошло во время перезагрузки.
zh_cn: 重新启动期间发生异常。

# CrypToolStorePresentation_DeleteButton_Click_Unistallation_
source: Unistallation?
de: Deinstallation?
ru: Пробные?
zh_cn: 落伍？

# CrypToolStorePresentation_InstallPlugin_Download_succeeded_
source: Download succeeded.
de: Download erfolgreich.
ru: Скачать преемник.
zh_cn: 下载成功。

source: Version:
ru: версия:
zh_cn: 版：

source: Update
de: Updaten
ru: Обновить
zh_cn: 更新资料

source: Start download and installation of "{0}"?
zh_cn: 开始下载和安装“ {0}”吗？

source: Exception occured during check of "{0}" for updates: {1}
de: Ausnahme bei der Überprüfung von "{0}" auf Updates: {1}
ru: Исключение произошло во время проверки «{0}» для обновлений: {1}
zh_cn: 检查“ {0}”以进行更新时发生异常：{1}

source: File size:
de: Dateigröße:
ru: Размер файла:
zh_cn: 文件大小：

# CrypToolStorePresentation_ResourceSuccessfullyInstalled
source: Resource "{0}" successfully installed.
de: Ressource "{0}" erfolgreich installiert.
ru: Ресурс "{0}" успешно установлен.
zh_cn: 资源“ {0}”已成功安装。

source: Show resources
de: Zeige Ressourcen
ru: Показать ресурсы
zh_cn: 显示资源

# CopyInfo
source: Copy infos
de: Kopiere Informationen
ru: Копировать информацию
zh_cn: 复制信息
