Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Primes/Primes/Resources/lang/WpfControls/Factorization/Factorization.*.resx
Languages: de

# bf_actualdiv
source: actual divisor:
de: aktueller Teiler:

# bf_scale
source: Scale of the factor tree
de: Skalisierung des Faktorbaums

# fac_bruteforce
source: Brute-force
de: Probedivision

# fac_copytoclipboard
source: Copy to clipboard
de: In die Zwischenablage kopieren

# fac_generaternd
source: Generate random number for factorization
de: Zufällige Zahl zur Faktorisierung generieren

# fac_groupboxheader
source: Number to factorize
de: Zu faktorisierende Zahl

# fac_qs
source: Quadratic sieve
de: Quadratisches Sieb

# fac_result
source: Factorization result
de: Faktorisierungsergebnis

# fac_resultaborted
source: Factorization result (aborted)
de: Faktorisierungsergebnis (abgebrochen)

# fac_resultabortedtime
source: Factorization result (The brute-force division was canceled after {0}.)
de: Faktorisierungsergebnis (Die Probedivision wurde nach {0} abgebrochen.)

# fac_resultfinished
source: Factorization result (finished)
de: Faktorisierungsergebnis (beendet)

# fac_resultfinishedtime
source: Factorization result (The brute-force division finished in {0}.)
de: Faktorisierungsergebnis (Die Probedivision wurde beendet. Die benötigte Zeit beträgt {0}.)

# fac_resultrunning
source: Factorization result (running)
de: Faktorisierungsergebnis (aktuell in Arbeit)

# fac_timehour
source: hour
de: Stunde

# fac_timehours
source: hours
de: Stunden

# fac_timeminutes
source: minutes
de: Minuten

# fac_timeseconds
source: seconds
de: Sekunden

# qs_btnrestart
source: Restart
de: Neustart

# qs_copytoclipboard
source: Copy to clipboard
de: In die Zwischenablage kopieren

# qs_step1
source: Step 1 (Determine suitable values)
de: Schritt 1 (Ermittlung geeigneter Werte)

# qs_step1_squareroot
source: The square root of n={0} is {1} ≈ {2}. The sieving interval is [{3}, {4}].
de: Die Quadratwurzel aus n={0} ist {1} ≈ {2}. Das Siebintervall ist [{3}, {4}].

# qs_step2
source: Step 2 (Determine smooth values)
de: Schritt 2 (Ermittlung der glatten Werte)

# qs_step2_B
source: The upper bound is {0}. The factor base is {{{1}}}. Start sieving step.
de: Der Wert der oberen Schranke beträgt {0}. Die Faktorbasis ist {{{1}}}. Siebschritt wird gestartet.

# qs_step2_bsmooth
source: Is b-smooth?
de: Ist B-Glatt?

# qs_step2_factorization
source: Smooth factors
de: Glatte Faktoren

# qs_step2_no
source: no
de: nein

# qs_step2_yes
source: yes
de: ja

# qs_step3
source: Step 3 (Search for squares)
de: Schritt 3 (Suchen von Quadratzahlen)

# qs_step3_ignored
source: {0} is ignored.
de: {0} wird ignoriert.

# qs_step3_isnotsquare
source: {0} is not a square number.
de: {0} ist keine Quadratzahl.

# qs_step3_issquare
source: {0} is a square number. The square root of {1} is {2}.
de: {0} ist eine Quadratzahl. Die Wurzel aus {1} ist {2}.

# qs_step3_smooth
source: {0} smooth value(s) found.
de: {0} glatte Werte gefunden.

# qs_step3_smoothvalues
source: {0} smooth value(s) found.
de: {0} glatte Werte gefunden.

# qs_step3_testcombi
source: Test combinations
de: Test der Kombination

# qs_step3_testcombiignore
source: The combination {0} = {1} is ignored.
de: Die Kombination {0} = {1} wird ignoriert.

# qs_step3_testcombiisnotsquare
source: The combination {0} = {1} is not a square.
de: Die Kombination {0} = {1} ist keine Quadratzahl.

# qs_step3_testcombiisquare
source: The combination {0} = {1} is a square. The square root of {2} is {3}.
de: Die Kombination {0} = {1} ist eine Quadratzahl. Die Wurzel aus {2} ist {3}.

# qs_step4
source: Step 4 (Calculate congruences and factorization)
de: Schritt 4 (Berechnung der Kongruenzen und Faktorisierung)

# qs_step4_abcalculated
source: a and b were calculated with a = {0}, b = {1}.
de: a und b wurden ermittelt mit a = {0}, b = {1}.

# qs_step4_checkcong
source: Check the congruences a² ≡ b² (mod n), a ≢ b (mod n):
de: Überprüfe die Kongruenzen a² ≡ b² (mod n), a ≢ b (mod n):

# qs_step4_end
source: No more congruences found. Could not factorize n={0} with the quadratic sieve.
de: Keine weiteren Kongruenzen gefunden. n={0} konnte mit dem quadratischen Sieb nicht faktorisiert werden.

# qs_step4_factor1
source: gcd({0} + {1}, {2}) = {3}
de: ggT({0} + {1}, {2}) = {3}

# qs_step4_factor2
source: gcd({0} - {1}, {2}) = {3}
de: ggT({0} - {1}, {2}) = {3}

# qs_step4_no
source: no
de: nein

# qs_step4_notproofed
source: The conditions are not fulfilled. Click 'Restart' to search for a new combination.
de: Die Bedingungen sind nicht erfüllt. Klicken Sie auf "Neustart", um eine neue Kombination zu suchen.

# qs_step4_proofed
source: Both conditions are fulfilled. We get the following factors of n={0}:
de: Beide Bedingungen sind erfüllt und wir erhalten folgende Faktoren von n={0}:

# qs_step4_refactorize
source: {0} is not a prime. Click 'Restart' to factorize {1}.
de: {0} ist keine Primzahl. Mit Klick auf "Neustart" wird {1} faktorisiert.

# qs_step4_reset
source: The factorization with a = {0} and b = {1} provided only trivial factors. Click 'Restart' for a new factorization round. The unsuccessful values will be ignored.
de: Die Faktorisierung mit den Werten a = {0} und b = {1} ergab nur triviale Faktoren. Mit Klick auf "Neustart" starten Sie Faktorisierung neu. Die bereits getesteten Werte werden ab dann ignoriert.

# qs_step4_yes
source: yes
de: ja
