Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/TextOutput/Properties/Resources.*.resx
Languages: de, zh_cn

# PluginCaption
source: Text Output
de: Textausgabe
zh_cn: 文字输出

# PluginTooltip
source: Simple text output
de: Textdarstellung
zh_cn: 简单文本输出

# AppendCaption
source: Append text input
de: Eingabetext anfügen
zh_cn: 追加文字输入

# AppendTooltip
source: With this checkbox enabled, incoming text will be appended to the current text.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird die Texteingabe an den aktuellen Text angehängt.
zh_cn: 启用此复选框后，传入的文本将被追加到当前文本之后。

# AppendBreaksCaption
source: Append n-breaks
de: Zeilenumbrüche anfügen
zh_cn: 追加n中断

# AppendBreaksTooltip
source: Defines how many new lines are added after new input. (Applies only if "Append text input" is active.)
de: Wie viele Zeilenumbrüche sollen bei neuem Eingabetext angefügt werden (gilt nur, wenn "Eingabetext anfügen" aktiviert ist).
zh_cn: 定义在新输入之后添加多少行。 （仅在“附加文本输入”处于活动状态时适用。）

# MaxLengthCaption
source: Maximum length
de: Maximale Länge
zh_cn: 最大长度

# MaxLengthTooltip
source: Provide the maximum number of characters to display.
de: Wie viele Zeichen sollen maximal eingelesen werden?
zh_cn: 提供要显示的最大字符数。

# InputCaption
source: Input data
de: Eingabedaten
zh_cn: 输入数据

# InputTooltip
source: Input data of any type
de: Eingabedaten als beliebiger Datentyp
zh_cn: 任何类型的输入数据

# PresentationFmt
source: {0:#,0} characters ({1:#,0} bytes)
zh_cn: {0：＃，0}个字符（{1：＃，0}个字节）

source: byte
zh_cn: 字节

# Bytes
source: byte
zh_cn: 个字节

# Char
source: character
de: Zeichen
zh_cn: 字符

# Chars
source: characters
de: Zeichen
zh_cn: 人物

source: line
de: Zeile
zh_cn: 线

source: lines
de: Zeilen
zh_cn: 线

# ShowCharsCaption
source: Number of characters
de: Anzahl der Zeichen
zh_cn: 字符数

# ShowCharsTooltip
source: With this checkbox enabled, the number of characters in the text is displayed in the status line of the component.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird die Anzahl der Zeichen des Textes in der Statuszeile der Komponente angezeigt.
zh_cn: 启用此复选框后，文本中的字符数将显示在组件的状态行中。

# ShowLinesCaption
source: Number of lines
de: Anzahl der Zeilen
zh_cn: 行数

# ShowLinesTooltip
source: With this checkbox enabled, the number of lines in the text is displayed in the status line of the component.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird die Anzahl der Zeilen des Textes in der Statuszeile der Komponente angezeigt.
zh_cn: 启用此复选框后，文本的行数将显示在组件的状态行中。

# ShowCharsGroup
source: Status bar
de: Statuszeile
zh_cn: 状态栏

source: bit
zh_cn: 一点

# Bits
source: bit
zh_cn: 位

# Digit
source: decimal digit
de: Dezimalziffer
zh_cn: 十进制数字

# Digits
source: decimal digits
de: Dezimalziffern
zh_cn: 十进制数字

# ShowDigitsCaption
source: Number of digits and bits
de: Anzahl der Ziffern und Bits
zh_cn: 位数和位数

# ShowDigitsTooltip
source: With this checkbox enabled, the number of decimal digits and bits of the input is displayed in the status line of the component, provided the input consists only of digits.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird die Anzahl der Ziffern und Bits der Eingabe in der Statuszeile der Komponente angezeigt, falls die Eingabe nur aus Ziffern besteht.
zh_cn: 启用此复选框后，如果输入仅包含数字，则输入的十进制数字和位数将显示在组件的状态行中。

# ChangesGroup
source: Changes
de: Änderungen
zh_cn: 变化

source: Don't show
de: Nicht anzeigen
zh_cn: 不显示

# ShowChangesCaption
source: Show changes
de: Zeige Änderungen
zh_cn: 显示变更

# ShowChangesTooltip
source: Show the changes of the Textoutput between two executions.
de: Zeigt die Änderungen der Textausgabe zwischen zwei Ausführungen.
zh_cn: 显示两次执行之间Textoutput的更改。

source: Show inserts and deletions
de: Zeige Einfügungen und Löschungen
zh_cn: 显示插入和删除

source: Show only differences
de: Zeige nur Unterschiede
zh_cn: 只显示差异

# ShowChangedSymbols
source: Show different symbols
de: Zeige unterschiedliche Symbole
zh_cn: 显示不同的符号

# FontCaption
source: Font
de: Schriftart
zh_cn: 字形

# FontGroup
source: Font
de: Schriftart
zh_cn: 字形

# FontSizeCaption
source: Font Size
de: Schriftgröße
zh_cn: 字体大小

# FontSizeTooltip
source: Sets the font size of this TextOutput.
de: Stellt die Schriftgröße dieser Textausgabe ein.
zh_cn: 设置此TextOutput的字体大小。

# FontTooltip
source: Sets the font of this TextOutput.
de: Stellt die Schriftart dieser Textausgabe ein.
zh_cn: 设置此TextOutput的字体。

# ManualFontSettingsCaption
source: Manual font settings
de: Manuelle Schrift-Einstellung
zh_cn: 手动字体设置

# ManualFontSettingsTooltip
source: Set the font manually.
de: Stellt die Schrift manuell ein.
zh_cn: 手动设置字体。

# LineBreaksCaption
source: Line breaks handling
de: Behandlung von Zeilenumbrüchen
zh_cn: 换行处理

# LineBreaksTooltip
source: Sets if Windows (LF +CR) or Unix (LF) line breaks are used.
de: Legt fest, ob Zeilenumbrüche von Windows (LF + CR) oder von Unix (LF) verwendet werden.
zh_cn: 设置是否使用Windows（LF + CR）或Unix（LF）换行符。

source: Don't change
de: Nicht ändern
