Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/MD5/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginTooltip
source: MD5 hash function
de: MD5-Hashfunktion
ru: MD5 хэш-функция
zh_cn: MD5哈希函数

# InputDataCaption
source: Input stream
de: Eingabedatenstrom
ru: Входной поток
zh_cn: 输入流

# InputDataTooltip
source: Input data to be hashed
de: Eingabedaten, deren Hashwert berechnet wird
ru: Входные данные должны быть хэшированы
zh_cn: 输入要散列的数据

# OutputDataStreamCaption
source: Hashed value
de: Hashwert
ru: Значение хеширования
zh_cn: 散列值

# OutputDataStreamTooltip
source: Output data of the hashed value as Stream
de: Hashwert als Ausgabedatenstrom
ru: Выходные данные хешированного значения в виде потока
zh_cn: 将哈希值的数据输出为Stream

# OutputDataCaption
source: Hashed value
de: Hashwert
ru: Значение хеширования
zh_cn: 散列值

# OutputDataTooltip
source: Output data of the hashed value as byte array
de: Hashwert als Byte-Array
ru: Выходные данные хешированного значения в виде байтового массива
zh_cn: 将散列值的数据输出为字节数组

source: End of Block >>>>
de: Blockende >>>>
ru: Конец блока >>>>
zh_cn: 块尾&gt;&gt;&gt;&gt;

source: End of Round >>>
de: Rundenende >>>
ru: Конец тура >>>
zh_cn: 回合结束&gt;&gt;&gt;

source: Next >>
de: Weiter >>
ru: Следующая >>
zh_cn: 下一个&gt;&gt;

source: Round:
de: Runde:
ru: Круглый:
zh_cn: 回合：

source: Step:
de: Schritt:
ru: Шаг:
zh_cn: 步：

source: We have added the length at the end of our data buffer
de: Die Länge wurde an das Ende des Datenblockes angehängt
ru: Мы добавили длину в конце нашего буфера данных
zh_cn: 我们在数据缓冲区的末尾添加了长度

source: We have added the padding bytes and our data now looks like this:
de: Die Auffüll-Bytes wurden angehängt und unsere Daten sehen nun so aus:
ru: Мы добавили байты заполнения, и наши данные теперь выглядят так:
zh_cn: 我们添加了填充字节，现在我们的数据如下所示：

source: << Previous
de: << Zurück
ru: << Предыдущая
zh_cn: &lt;&lt;上一页

# We_now_calculate_the_length_of_our_data
source: We now calculate the length of our data (without the padding bytes from the previous step) in bits:
de: Nun berechnen wir die Länge unserer Daten (ohne die Auffüll-Bytes des vorherigen Schrittes) in Bits:
ru: Теперь мы вычисляем длину наших данных (без байтов заполнения от предыдущего шага) в битах:
zh_cn: 现在，我们以位为单位计算数据的长度（没有上一步的填充字节）：

# In_the_next_step
source: In the next step, we write the little-endian representation of this value into the next 8 bytes of our data buffer.
de: Im nächsten Schritt schreiben wir diesen Wert in Little-Endian-Darstellung in die nächsten 8 Bytes unseres Datenpuffers.
ru: На следующем шаге мы пишем малозначное представление этого значения в следующие 8 байтов нашего буфера данных.
zh_cn: 在下一步中，我们将此值的小尾数表示形式写入数据缓冲区的后8个字节中。

# The_algorithm_is_not_yet_initialized
source: The algorithm is not yet initialized. Please connect an input stream and start the workspace's process flow. Make sure that the presentation is visible when the MD5 plugin is activated.
de: Der Algorithmus ist noch nicht initialisiert. Bitte verbinden Sie das Plugin mit einem Eingabe-Datenstrom und starten die Ausführung. Stellen Sie sicher, dass die Präsentation sichtbar ist, wenn das MD5-Plugin aktiviert wird.
ru: Алгоритм еще не инициализирован. Подключите входной поток и запустите поток процесса рабочей области. Убедитесь, что презентация видна, когда подключен плагин MD5.
zh_cn: 该算法尚未初始化。请连接输入流并启动工作空间的流程。确保激活MD5插件时该演示文稿可见。

source: We are now starting round
de: Wir beginnen nun mit Runde
ru: Сейчас мы начинаем раунд
zh_cn: 我们现在开始

source: of 4.
de: von 4.
ru: из 4.
zh_cn: 的4。

# Each_round_has_16_steps
source: Each round has 16 steps which change our temporary variables A - D.
de: Jede Runde hat 16 Schritte, die unsere temporären Variablen A - D abändern.
ru: Каждый раунд имеет 16 шагов, которые меняют наши временные переменные A - D.
zh_cn: 每轮有16个步骤，可更改我们的临时变量A-D。

# There_are_4_non_linear_inner_round_functions
source: There are 4 non-linear inner round functions called F, G, H and I. They are a central part of the calculations performed in each round step. In this round, we use the function
de: Es gibt 4 nichtlineare Funktionen der inneren Runden, F, G, H und I. Sie sind ein zentraler Bestandteil der Berechnungen, die in jedem Rundenschritt durchgeführt werden. In dieser Runde verwenden wir die Funktion
ru: Существует 4 нелинейных внутренних круглых функции, называемых F, G, H и I. Они являются центральной частью расчетов, выполненных на каждом шаге. В этом раунде мы используем функцию
zh_cn: 有四个称为F，G，H和I的非线性内部舍入函数。它们是每个舍入步骤中执行的计算的核心部分。在本轮中，我们使用

source: Addition constant
de: Additions-Konstante
ru: Константа сложения
zh_cn: 加常数

# After_that__we_append_multiple_zero_bytes_to_our_data_
source: After that, we append multiple zero bytes to our data. We choose the amount of zero bytes in such a way that the length of the complete data block will be 8 bytes short of the next multiple of 64. This allows us to then append 8 more bytes to the data and reach an exact multiple of 64 as our data length.
de: Danach fügen wir mehrere Null-Bytes an die Daten an. Wir fügen so viele Null-Bytes an, dass die Länge des Datenblocks 8 Bytes weniger als das nächste Vielfache von 64 ist. Dadurch können wir noch 8 weitere Bytes an die Daten anhängen und ein Vielfaches von 64 als unsere Datenlänge erhalten.
ru: После этого мы добавляем несколько нулевых байтов к нашим данным. Мы выбираем количество нулевых байтов таким образом, чтобы длина полного блока данных была на 8 байт ниже следующего кратного 64. Это позволяет нам добавить еще 8 байтов в данные и достичь точного кратного числа 64 как наша длина данных.
zh_cn: 之后，我们将多个零字节附加到我们的数据中。我们选择零字节的数量，以使完整数据块的长度比下一个64的倍数短8个字节。这使我们可以再向数据追加8个字节，并达到64的精确倍数。作为我们的数据长度。

# and_start_the_padding_process_by_appending_one_single__1__bit
source: and start the padding process by appending one single '1' bit to the end of our data. Since we are working with octets, this amounts to adding a byte with the binary value 10000000, which equals the hex value 0x80, to the end of our data.
de: und beginnen mit dem Auffüllen, indem wir ein einzelnes '1'-Bit am Ende der Daten anfügen. Da wir mit Oktetten arbeiten, entspricht dies dem Anfügen eines Bytes mit dem binären Wert 10000000 bzw. dem Hexwert 0x80 ans Ende unserer Daten.
ru: и запустите процесс заполнения, добавив один единственный бит до конца наших данных. Поскольку мы работаем с октетами, это сводится к добавлению байта с двоичным значением 10000000, что равно шестнадцатеричному значению 0x80, до конца наших данных.
zh_cn: 并通过在数据末尾附加一个“ 1”位来开始填充过程。由于我们使用八位位组，因此等于在数据末尾添加了一个二进制值10000000的字节，该值等于十六进制值0x80。

# bytes_in_the_previous_step_
source: bytes in the previous step, we conclude that we reached the end of our data.
de: Bytes im letzten Schritt gelesen haben, nehmen wir an, dass wir das Ende der Daten erreicht haben.
ru: байт на предыдущем шаге, мы заключаем, что мы достигли конца наших данных.
zh_cn: 在上一步的字节数中，我们得出的结论是我们到达了数据末尾。

source: bytes of data.
de: Daten-Bytes eingelesen.
ru: байт данных.
zh_cn: 数据字节。

source: bytes of data.
de: Daten-Bytes verarbeitet.
ru: байт данных.
zh_cn: 数据字节。

source: bytes of data left in our buffer
de: Daten-Bytes in unserem Puffer
ru: байт данных, оставшихся в нашем буфере
zh_cn: 缓冲区中剩余的数据字节数

source: Rotating left shift
de: rotierende Linksverschiebung
ru: Вращающийся сдвиг влево
zh_cn: 旋转左移

source: Selected part from input data block
de: Ausgewählter Teil des Eingabe-Datenblocks
ru: Выбранная часть из блока входных данных
zh_cn: 从输入数据块中选择的零件

source: shifted by
de: verschieben um
ru: сдвинутый на
zh_cn: 转移了

source: shifted value
de: verschobener Wert
ru: сдвинутое значение
zh_cn: 转移值

source: Shift constant
de: Shift-Konstante
ru: Постоянная сдвига
zh_cn: 移位常数

source: Since we read only
de: Da wir nur
ru: Поскольку мы читаем только
zh_cn: 由于我们只读

source: So far, we have processed
de: Bisher haben wir
ru: До сих пор мы обработали
zh_cn: 到目前为止，我们已经处理了

# MD5State_Algorithm_uninitialized
source: Algorithm uninitialized
de: Algorithmus ist nicht initialisiert
ru: Алгоритм неинициализирован
zh_cn: 算法未初始化

# MD5State_Finished_padding
source: Finished padding
de: Auffüllen beendet
ru: Готовое дополнение
zh_cn: 填充完成

# MD5State_Starting_the_compression
source: Starting the compression
de: Beginn der Kompression
ru: Запуск сжатия
zh_cn: 开始压缩

# MD5State_Starting_a_compression_round
source: Starting a compression round
de: Beginn einer Kompressionsrunde
ru: Начало раунда сжатия
zh_cn: 开始压缩回合

# MD5State_Before_compression_step
source: Before compression step
de: Vor dem Kompressionsschritt
ru: До этапа сжатия
zh_cn: 压缩步骤之前

# MD5State_Performing_compression_step
source: Performing compression step
de: Durchführung des Kompressionsschrittes
ru: Выполнение этапа сжатия
zh_cn: 执行压缩步骤

# MD5State_Finished_compression_round
source: Finished compression round
de: Kompressionsrunde beendet
ru: Готовое сжатие
zh_cn: 成品压缩弹

# MD5State_Finalizing_compression
source: Finalizing compression
ru: Завершение сжатия
zh_cn: 完成压缩

# MD5State_Finished_compression
source: Finished compression
de: Kompression beendet
ru: Готовое сжатие
zh_cn: 压缩完成

# MD5State_Finished
source: Finished
de: Beendet
ru: Законченный
zh_cn: 已完成

# MD5State_Unknown_state
source: Unknown state
de: Unbekannter Zustand
ru: Неизвестное состояние
zh_cn: 未知状态

# MD5State_Initialization
source: Initialization
de: Initialisierung
ru: инициализация
zh_cn: 初始化

# MD5State_Reading_data
source: Reading data
de: Lese Daten
ru: Чтение данных
zh_cn: 读取数据

# MD5State_Read_data
source: Read data
de: Daten wurden gelesen
ru: Чтение данных
zh_cn: 读取数据

# MD5State_Beginning_padding_process
source: Beginning padding process
de: Beginn des Auffüllens
ru: Начало процесса заполнения
zh_cn: 开始填充过程

# MD5State_Adding_the_padding_bytes
source: Adding the padding bytes
de: Auffüll-Bytes werden hinzugefügt
ru: Добавление байтов заполнения
zh_cn: 添加填充字节

# MD5State_Added_the_padding_bytes
source: Added the padding bytes
de: Auffüll-Bytes wurden hinzugefügt
ru: Добавлены байты заполнения
zh_cn: 添加了填充字节

# MD5State_Adding_the_data_length
source: Adding the data length
de: Datenlänge wird angefügt
ru: Добавление длины данных
zh_cn: 添加数据长度

# MD5State_Added_the_data_length
source: Added the data length
de: Datenlänge wurde angefügt
ru: Добавлена ​​длина данных
zh_cn: 增加了数据长度

# The_compression_function_of_MD5_processes_data_in_blocks_of_64_bytes_
source: The compression function of MD5 processes data in blocks of 64 bytes. Our goal is to read enough data that we can immediately call the compression function afterwards. Thus, we continue reading as many bytes as possible until we have 64.
de: Die Kompressions-Funktion von MD5 verarbeitet Daten in Blöcken von 64 Bytes. Wir wollen genügend Daten einlesen, um die Kompressions-Funktion aufrufen zu können und lesen daher Daten ein, bis wir 64 Bytes erhalten haben.
ru: Функция сжатия MD5 обрабатывает данные в блоках по 64 байта. Наша цель - прочитать достаточно данных, которые мы можем сразу вызвать функцию сжатия. Таким образом, мы продолжаем читать как можно больше байтов, пока не получим 64.
zh_cn: MD5的压缩功能以64字节的块处理数据。我们的目标是读取足够的数据，以便我们随后可以立即调用压缩函数。因此，我们将继续读取尽可能多的字节，直到有64个字节为止。

# The_compression_function_operates_on_32_bit_integers_
source: The compression function operates on 32 bit integers. There are 4 temporary variables A, B, C and D, which are used during the compression. We initialize them with the values from H1 - H4:
de: Die Kompressions-Funktion arbeitet mit 32-Bit-Integerzahlen. Sie verwendet 4 temporäre Variablen A, B, C und D, die wir mit den Werten von H1 - H4 initialisieren:
ru: Функция сжатия работает с 32-битными целыми числами. Существует 4 временных переменных A, B, C и D, которые используются во время сжатия. Мы инициализируем их значениями из H1 - H4:
zh_cn: 压缩功能对32位整数进行操作。压缩期间使用4个临时变量A，B，C和D。我们使用H1-H4中的值初始化它们：

source: The data block we have read looks like this:
de: Der eingelesene Datenblock sieht so aus:
ru: Блок данных, который мы читаем, выглядит следующим образом:
zh_cn: 我们已读取的数据块如下所示：

# The_first_thing_we_do_is_initialize_our_accumulators
source: The first thing we do is initialize our accumulators to their starting values, which are the fixed constants that you can see above.
de: Zuerst initialisieren wir unseren Akkumulator mit seinen Startwerten, den oben dargestellten Konstanten.
ru: Первое, что мы делаем, это инициализировать наши аккумуляторы до их начальных значений, которые являются фиксированными константами, которые вы можете видеть выше.
zh_cn: 我们要做的第一件事是将累加器初始化为它们的初始值，这些初始值是您可以在上面看到的固定常数。

# The_variables_H1_H4_are_our_accumulator_variables
source: The variables H1 - H4 are our accumulator variables. While we perform the hash, we will change them after each execution of the compression function. When we are done, they contain the final MD5 hash value.
de: Die Variablen H1 - H4 sind unsere Akkumulator-Variablen. Während der Hashwert-Berechnung aktualisieren wir sie nach jeder Ausführung der Kompressions-Funktion. Wenn wir damit fertig sind, enthalten sie den endgültigen MD5-Hashwert.
ru: Переменные H1 - H4 являются нашими переменными аккумулятора. Пока мы выполняем хеш, мы будем менять их после каждого выполнения функции сжатия. Когда мы закончим, они содержат окончательное значение хеша MD5.
zh_cn: 变量H1-H4是我们的累加器变量。在执行散列时，我们将在每次执行压缩函数后更改它们。完成后，它们将包含最终的MD5哈希值。

source: Unsigned integer addition discarding carry bit
de: vorzeichenlose Ganzzahl-Addition ohne Carry-Bit
ru: Беззнаковое целочисленное добавление, отбрасывающее бит переноса
zh_cn: 无符号整数加法丢弃进位位

# We_also_split_our_512_bit_data_block_into_16_
source: We also split our 512 bit data block into 16 little-endian integers, each 32 bit:
de: Wir teilen unseren 512-Bit-Datenblock auf in 16 Little-Endian-Integer mit je 32 Bit:
ru: Мы также разделили наш 512-битный блок данных на 16 чисел с маленькими концами, каждый 32 бит:
zh_cn: 我们还将512位数据块拆分为16个低位字节整数，每个32位：

# We_can_now_begin_the_padding_process_
source: We can now begin the padding process, which has two purposes: • It gives us the opportunity to increase the length of our data until we again have blocks with length of a multiple of 64 bytes. • It allows us to work the total length of the data into the final hash value.
de: Nun können wir mit dem Auffüll-Vorgang beginnen, der zwei Funktionen erfüllt: • Wir können die Länge der Daten erhöhen, bis wir wieder ein Vielfaches der Blockgrösse von 64 Bytes erreicht haben • Wir können die Gesamtlänge der Daten in die Hashwert-Berechnung miteinbeziehen.
ru: Теперь мы можем начать процесс заполнения, который имеет две цели: • Он дает нам возможность увеличить длину наших данных до тех пор, пока мы снова не будем иметь блоки с длиной в 64 байта. • Он позволяет нам работать с общей длиной данных в конечное значение хэш-функции.
zh_cn: 现在，我们可以开始填充过程，它有两个目的：•它使我们有机会增加数据的长度，直到再次遇到长度为64字节的倍数的块为止。 •它使我们能够将数据的总长度计入最终的哈希值。

source: We continue by calling the compression function for this input.
de: Wir fahren fort mit dem Aufruf der Kompressions-Funktion für diese Eingabe.
ru: Мы продолжаем вызывать функцию сжатия для этого ввода.
zh_cn: 我们继续为此输入调用压缩函数。

source: We continue by reading the next block of data.
de: Wir fahren fort, indem wir den nächsten Datenblock einlesen.
ru: Продолжаем чтение следующего блока данных.
zh_cn: 我们继续读取下一个数据块。

source: We have finished all 16 steps of this round.
de: Alle 16 Schritte dieser Runde sind nun beendet.
ru: Мы закончили все 16 шагов этого раунда.
zh_cn: 我们已经完成了本轮的所有16个步骤。

source: We have finished padding and have
de: Das Auffüllen wurde beendet und wir haben noch
ru: Мы закончили заполнение и
zh_cn: 我们已经完成填充并有

# We_have_finished_with_the_last_round_of_the_compression_
source: We have finished with the last round of the compression. Now it's time to update our accumulators. We do this by simply adding the variables A - D to them.
de: Wir haben die letzte Kompressions-Runde beendet. Nun müssen wir unsere Akkumulatoren aktualisieren, indem wir einfach die Variablen A - D addieren.
ru: Мы закончили последний раунд сжатия. Теперь пришло время обновить наши аккумуляторы. Мы делаем это, просто добавляя к ним переменные A - D.
zh_cn: 我们完成了最后一轮压缩。现在是时候更新我们的累加器了。我们只需将变量A-D添加到变量中即可。

# We_have_finished_with_the_last_round_of_the_compression_function
source: We have finished with the last round of the compression function. To finish up, we take the result of the compression function's steps, our temporary variables A - D, and add them to our accumulators H1 - H4.
de: Wir haben die letzte Runde der Kompressions-Funktion beendet. Wir nehmen die Resultate der Kompressions-Funktion, die temporären Variablen A - D, und addieren sie zu den Akkumulatoren H1 - H4.
ru: Мы закончили последний раунд функции сжатия. Чтобы закончить, мы берем результат шагов функции сжатия, наших временных переменных A - D и добавляем их к нашим аккумуляторам H1 - H4.
zh_cn: 我们已经完成了最后一轮的压缩功能。最后，我们采用压缩函数步骤的结果，我们的临时变量A-D，并将它们添加到累加器H1-H4中。

# We_have_now_finished_compression_of_the_last_block_of_data
source: We have now finished compression of the last block of data. Our hash accumulators look like this:
de: Wir haben nun die Kompression des letzten Datenblockes beendet. Unser Hash-Akkumulator sieht nun so aus:
ru: Теперь мы закончили сжатие последнего блока данных. Наши хэш-накопители выглядят так:
zh_cn: 现在，我们已经完成了对最后一个数据块的压缩。我们的哈希累加器如下所示：

source: We have read a total of
de: Wir haben insgesamt
ru: Мы прочитали в общей сложности
zh_cn: 我们总共阅读了

source: We now start the compression function for our next data block,
de: Nun beginnen wir mit der Kompressions-Funktion für den nächsten Datenblock,
ru: Теперь мы начинаем функцию сжатия для нашего следующего блока данных,
zh_cn: 现在，我们为下一个数据块启动压缩功能，

# We_obtain_our_final_result_the_actual_MD5_hash_value
source: We obtain our final result, the actual MD5 hash value, by simply concatenating the lower-endian representation of our accumulators:
de: Wir erhalten unser Endergebnis, den eigentlichen MD5-Hashwert, durch einfaches Hintereinanderschreiben des Akkumulators in Lower-Endian-Darstellung:
ru: Мы получаем наш конечный результат, фактическое значение хеш-файла MD5, просто конкатенируя нижестоящее представление наших аккумуляторов:
zh_cn: 通过简单地累加累加器的低端表示，可以得出最终结果，即实际的MD5哈希值：

source: We take the incomplete block of data that we've read,
de: Wir nehmen den unvollständigen Datenblock, den wir eingelesen haben,
ru: Мы берем неполный блок данных, который мы читаем,
zh_cn: 我们将读取的数据不完整，
