Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/RSA/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginTooltip
source: RSA En/Decryption
de: RSA Ver-/Entschlüsselung
ru: RSA En / Расшифровка
zh_cn: RSA加密/解密

# PluginKeyCaption
source: RSA Key Generator
de: RSA-Schlüsselgenerator
ru: Генератор ключей RSA
zh_cn: RSA密钥生成器

# PluginKeyTooltip
source: RSA Key Generator
de: RSA-Schlüsselgenerator
ru: Генератор ключей RSA
zh_cn: RSA密钥生成器

# InputNCaption
source: Public key N input
de: Öffentlicher Schlüssel N
ru: Вход открытого ключа N
zh_cn: 公钥N输入

# InputNTooltip
source: Enter your public key N here.
de: Geben Sie hier den öffentlichen Schlüssel N ein.
ru: Введите свой открытый ключ N здесь.
zh_cn: 在此处输入您的公共密钥N。

# InputMCCaption
source: Message m / Ciphertext c input (as number)
de: Nachricht m / Geheimtext c (als Zahl)
ru: Сообщение m / Ciphertext c input (как номер)
zh_cn: 消息m /密文c输入（作为数字）

# InputMCTooltip
source: Enter the number to encrypt or decrypt here.
de: Geben Sie hier die zu ver-/entschlüsselnde Zahl ein.
ru: Введите номер для шифрования или расшифровки здесь.
zh_cn: 在此处输入要加密或解密的号码。

# InputEDCaption
source: Public exponent e / Private key d input
de: Öffentlicher Exponent e / Privater Schlüssel d
ru: Публичный экспонент e / Закрытый ключ d input
zh_cn: 公共指数e /私钥d输入

# InputEDTooltip
source: Enter your public exponent e / private key d here.
de: Geben Sie hier den öffentlichen Exponenten e / privaten Schlüssel d ein.
ru: Введите свой общедоступный e-private ключ d здесь.
zh_cn: 在此处输入您的公共指数e /私钥d。

# OutputMCCaption
source: Ciphertext c / Message m output (as number)
de: Ausgabe Geheimtext c / Klartext m (als Zahl)
ru: Вывод Ciphertext c / Message m (как число)
zh_cn: 密文c /消息m输出（以数字表示）

# OutputMCTooltip
source: The encrypted or decrypted number will be sent here.
de: Ausgabe der ver-/entschlüsselten Nachricht (als Zahl)
ru: Зашифрованный или расшифрованный номер будет отправлен здесь.
zh_cn: 加密或解密的号码将在此处发送。

# InputTextCaption
source: Message m / Ciphertext c input
de: Nachricht m / Geheimtext c
ru: Сообщение m / Ciphertext c input
zh_cn: 消息m /密文c输入

# InputTextTooltip
source: Enter the text to encrypt or decrypt here.
de: Geben Sie hier den zu ver-/entschlüsselnden Text ein.
ru: Введите текст для шифрования или расшифровки здесь.
zh_cn: 在此处输入要加密或解密的文本。

# OutputTextCaption
source: Ciphertext c / Message m output
de: Ausgabe Geheimtext c / Klartext m
ru: Вывод Ciphertext c / Message m
zh_cn: 密文c /消息m输出

# OutputTextTooltip
source: The encrypted or decrypted text will be sent here.
de: Ausgabe des ver-/entschlüsselten Textes
ru: Зашифрованный или расшифрованный текст будет отправлен здесь.
zh_cn: 加密或解密的文本将在此处发送。

# NCaption
source: Public modulus N
de: Öffentlicher Modulus N
ru: Открытый модуль N
zh_cn: 公共模数N

# NTooltip
source: Public modulus N
de: Öffentlicher Modulus N
ru: Открытый модуль N
zh_cn: 公共模数N

# ECaption
source: Public exponent e
de: Öffentlicher Exponent e
ru: Публичный показатель e
zh_cn: 公共指数

# ETooltip
source: Public exponent e
de: Öffentlicher Exponent e
ru: Публичный показатель e
zh_cn: 公共指数

# DCaption
source: Private key d
de: Privater Schlüssel d
ru: Частный ключ d
zh_cn: 私钥d

# DTooltip
source: Private key d
de: Privater Schlüssel d
ru: Частный ключ d
zh_cn: 私钥d

# CertificateFileCaption
source: Open X.509 Certificate
de: Öffne X.509-Zertifikat
ru: Открытый сертификат X.509
zh_cn: 打开X.509证书

# CertificateFileTooltip
source: Select the X.509 certificate you want to open.
de: Wählen Sie das zu öffnende X.509-Zertifikat.
ru: Выберите сертификат X.509, который вы хотите открыть.
zh_cn: 选择要打开的X.509证书。

# CloseFileCaption
source: Close file
de: Datei schließen
ru: Закрыть файл
zh_cn: 关闭档案

# CloseFileTooltip
source: Close file
de: Datei schließen
ru: Закрыть файл
zh_cn: 关闭档案

# PCaption
source: Prime number p
de: Primzahl p
ru: Основной номер p
zh_cn: 质数p

# PTooltip
source: Prime number p
de: Primzahl p
ru: Основной номер p
zh_cn: 质数p

# PasswordCaption
source: Password
de: Passwort
ru: пароль
zh_cn: 密码

# PasswordTooltip
source: Password
de: Passwort
ru: пароль
zh_cn: 密码

# QCaption
source: Prime number q
de: Primzahl q
ru: Основной номер q
zh_cn: 质数q

# QTooltip
source: Prime number q
de: Primzahl q
ru: Основной номер q
zh_cn: 质数q

# SourceCaption
source: Source
de: Herkunft des Schlüssels
ru: Источник
zh_cn: 资源

# SourceTooltip
source: Select the source of the key data.
de: Herkunft des Schlüssels
ru: Выберите источник данных ключа.
zh_cn: 选择关键数据的来源。

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionTooltip
source: Do you want the input data to be encrypted or decrypted?
de: Wählen Sie die Betriebsart des Plugins.
ru: Вы хотите, чтобы входные данные были зашифрованы или дешифрованы?
zh_cn: 是否要对输入数据进行加密或解密？

# CoresUsedCaption
source: Cores used
de: verwendete CPU-Kerne
ru: Используемые сердечники
zh_cn: 使用的铁芯

# CoresUsedTooltip
source: Choose how many cores should be used.
de: Wie viele CPU-Kerne sollen verwendet werden?
ru: Выберите, сколько ядер необходимо использовать.
zh_cn: 选择应使用多少个内核。

# ActionList1
source: Encryption
de: Verschlüsselung
ru: шифрование
zh_cn: 加密

# ActionList2
source: Decryption
de: Entschlüsselung
ru: Дешифрирование
zh_cn: 解密

# SourceList1
source: Enter primes manually
de: manuelle Eingabe der Primzahlen
ru: Введите пробелы вручную
zh_cn: 手动输入素数

# SourceList2
source: Enter keys manually
de: manuelle Eingabe des Schlüssels
ru: Введите ключи вручную
zh_cn: 手动输入键

# SourceList3
source: Generate random primes
de: Primzahlen zufällig erzeugen
ru: Генерировать случайные числа
zh_cn: 产生随机素数

# SourceList4
source: X.509 Certificate
de: X.509-Zertifikat
ru: Сертификат X.509
zh_cn: X.509证书

# InputBlocksizeCaption
source: Input block size
de: Eingabeblock
ru: Размер входного блока
zh_cn: 输入块大小

# InputBlocksizeTooltip
source: Enter the number of bytes for an input block.
de: Geben Sie die Größe eines Eingabeblocks in Bytes an.
ru: Введите количество байтов для входного блока.
zh_cn: 输入输入块的字节数。

# OutputBlocksizeCaption
source: Output block size
de: Ausgabeblock
ru: Размер выходного блока
zh_cn: 输出块大小

# OutputBlocksizeTooltip
source: Enter the number of bytes for an output block.
de: Geben Sie die Größe eines Ausgabeblocks in Bytes an.
ru: Введите количество байтов для выходного блока.
zh_cn: 输入输出块的字节数。

# OverrideBlocksizesCaption
source: Override implicit block sizes
de: Blockgrößen festlegen
ru: Переопределить неявные размеры блоков
zh_cn: 覆盖隐式块大小

# OverrideBlocksizesGroup
source: Block sizes
de: Blockgrößen
ru: Размеры блоков
zh_cn: 块大小

# OverrideBlocksizesTooltip
source: Override the implicit block sizes and enter the values manually.
de: Aktivieren Sie diese Checkbox, um die zu verwendenden Blockgrößen selbst zu bestimmen. Diese werden dann anstatt der automatisch ermittelten Blockgrößen verwendet.
ru: Измените неявные размеры блоков и введите значения вручную.
zh_cn: 覆盖隐式块大小，然后手动输入值。

# RangeCaption
source: Range (in bit)
de: Primzahlgröße (in bit)
ru: Ассортимент
zh_cn: 范围

# RangeTooltip
source: Range parameter that indicates the size of the random prime numbers to be generated.
de: Parameter, der die Anzahl der Bits oder eine obere Schranke für die zu erzeugenden Primzahlen angibt.
ru: Параметр Range, который указывает размер генерируемых случайных простых чисел.
zh_cn: 范围参数，指示要生成的随机素数的大小。

# RangeTypeCaption
source: Range Type
de: Größenparameter
ru: Тип диапазона
zh_cn: 范围类型

# RangeTypeList1
source: Number of bits
de: Anzahl der Bits
ru: Количество бит
zh_cn: 位数

# RangeTypeList2
source: Upper limit
de: Obere Schranke
ru: Верхний предел
zh_cn: 上限

# RangeTypeTooltip
source: Shall the range parameter be interpreted as 'number of bits' or as 'upper limit'?
de: Soll der Größenparameter die Anzahl der Bits oder eine obere Schranke für die zu erzeugenden Primzahlen angeben?
ru: Должен ли параметр диапазона интерпретироваться как «количество бит» или «верхний предел»?
zh_cn: 范围参数应解释为“位数”还是“上限”？

source: Enter d
de: d eingeben
ru: Введите d
zh_cn: 输入d

source: Enter e
de: e eingeben
ru: Введите e
zh_cn: 输入和

# E_or_D
source: Enter e or d
de: e oder d eingeben
ru: Введите e или d
zh_cn: 输入e或d

# GenerateSafePrimesCaption
source: Generate safe primes
de: Sichere Primzahlen generieren

# GenerateSafePrimesTooltip
source: If enabled, the generated primes will be safe primes. This will take a lot of more time.
de: Wenn diese Option aktiviert ist, werden die erzeugten Primzahlen sichere Primzahlen sein. Dies wird sehr viel mehr Zeit in Anspruch nehmen.
