Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/VigenereAnalyzer/Properties/Resources.*.resx
Languages: ru, zh_cn

# PluginCaption
source: Vigenère Analyzer
ru: Анализатор Vigenère
zh_cn: Vigenère分析仪

# PluginTooltip
source: Cryptanalysis of the Vigenère cipher using hill climbing.
ru: Криптоанализ шифрования Vigenère с использованием холминга.
zh_cn: 使用爬山对Vigenère密码进行密码分析。

# Copy_all
source: Copy all lines
ru: Скопировать все строки
zh_cn: 复制所有行

source: Copy key
ru: Копировать ключ
zh_cn: 复制键

# Copy_line
source: Copy selected line
ru: Копировать выбранную строку
zh_cn: 复制所选行

source: Copy text
ru: Копировать текст
zh_cn: 复制文字

source: Copy value
ru: Копировать значение
zh_cn: 复制值

# FromKeylengthCaption
source: Lower bound of keylength
ru: Нижняя граница длины ключа
zh_cn: 键长下限

# FromKeylengthTooltip
source: Start from this keylength when analyzing the given ciphertext.
ru: Начните с этой длины ключа при анализе данного зашифрованного текста.
zh_cn: 分析给定密文时，从此密钥长度开始。

# KeyStyleCaption
source: Keystyle
zh_cn: 按键样式

# KeyStyleTooltip
source: Is the key a natural passphrase or not?
ru: Является ли ключ естественной фразой или нет?
zh_cn: 密钥是自然密码吗？

# LanguageCaption
source: Language
ru: язык
zh_cn: 语言

# LanguageTooltip
source: Use this language for the costfunction.
ru: Используйте этот язык для функции затрат.
zh_cn: 使用此语言表示成本函数。

# ModeCaption
source: Mode
ru: Режим
zh_cn: 模式

# ModeTooltip
source: Use this mode for the analysis.
ru: Используйте этот режим для анализа.
zh_cn: 使用此模式进行分析。

source: Natural Language
ru: Естественный язык
zh_cn: 自然语言

source: Random
ru: случайный
zh_cn: 随机

# RestartsCaption
source: Restarts
ru: Перезапуск
zh_cn: 重新启动

# RestartsTooltip
source: Amount of restarts of the hill climbing algorithm.
ru: Количество перезапуска алгоритма холмирования.
zh_cn: 爬山算法的重新启动次数。

# ToKeylengthCaption
source: Upper bound of keylength
ru: Верхняя граница длины ключа
zh_cn: 键长上限

# ToKeylengthTooltip
source: Stop the analysis after evaluating this keylength.
ru: Остановите анализ после оценки этой длины ключа.
zh_cn: 评估此密钥长度后，停止分析。

# Vigenere
source: Classic Vigenère
ru: Классический Vigenère
zh_cn: 经典Vigenère

# CiphertextCaption
source: Ciphertext
ru: зашифрованный
zh_cn: 密文

# CiphertextTooltip
source: The ciphertext that should be analyzed.
ru: Зашифрованный текст, который необходимо проанализировать.
zh_cn: 应该分析的密文。

# ElapsedLabel
source: Elapsed Time:
ru: Пройденное время:
zh_cn: 经过时间：

# EndLabel
source: End Time:
ru: Время окончания:
zh_cn: 时间结束：

# KeyCaption
source: Best Key
ru: Лучший ключ
zh_cn: 最佳钥匙

# KeyHeader
source: Key
ru: ключ
zh_cn: 键

# KeyLengthHeader
source: Key Length
ru: Длина ключа
zh_cn: 键长

# KeyTooltip
source: The best key found during the analysis.
ru: Лучший ключ, найденный во время анализа.
zh_cn: 分析过程中找到的最佳密钥。

# PlaintextCaption
source: Best Plaintext
ru: Лучший простой текст
zh_cn: 最佳纯文本

# PlaintextTooltip
source: The best plaintext which was found during the analysis.
ru: Лучший открытый текст, который был найден во время анализа.
zh_cn: 分析过程中发现的最佳明文。

# StartLabel
source: Start Time:
ru: Время начала:
zh_cn: 开始时间：

# TextHeader
source: Text
ru: Текст
zh_cn: 文本

# ValueHeader
source: Value
ru: Стоимость
zh_cn: 值

# VigenereAlphabetCaption
source: Vigenère Alphabet
ru: Алфавит Вигнера
zh_cn: 维吉涅尔字母

# VigenereAlphabetTooltip
source: Use this Vigenère alphabet for the analyis.
ru: Используйте этот алфавит Vigenère для анализа.
zh_cn: 使用Vigenère字母表进行分析。

# CurrentAnalysedKeylengthLabel
source: Current analyzed keylength:
ru: Текущая анализируемая длина ключа:
zh_cn: 当前分析的密钥长度：

# FastConvergeCaption
source: Fast converge
ru: Быстрая сходимость
zh_cn: 快速收敛

# FastConvergeTooltip
source: If selected, the hill climbing algorithm jumps to every improvement. Otherwise it jumps to the best possible improvement.
ru: Если выбрано, алгоритм холмирования переходит к каждому усовершенствованию. В противном случае он скачет к лучшему возможному улучшению.
zh_cn: 如果选择，爬坡算法将跳至每项改进。否则，它将跳到可能的最佳改进。

# LocalLabel
source: Analysis
ru: Анализ
zh_cn: 分析

# TopTenLabel
source: Bestlist
zh_cn: 最佳名单

# SpeedLabel
source: Keys/second:
ru: Ключи / второй:
zh_cn: 按键/秒：

# Both
source: Trigrams + 4-grams
ru: Триграммы + 4 грамма
zh_cn: 字母+ 4克

source: Cost function
ru: Функция стоимости
zh_cn: 成本函数

source: English
ru: английский
zh_cn: 英语

source: German
ru: Немецкий
zh_cn: 德语

source: Trigrams
ru: Триграммы
zh_cn: 卦

# CostFunctionTooltip
source: The costfunction for rating the putative cleartext.
ru: Функция стоимости для оценки предполагаемого открытого текста.
zh_cn: 评估假定明文的成本函数。

source: Spanish
ru: испанский
zh_cn: 西班牙文

# ComparisonFrequencyCaption
source: Stop percentage
ru: Остановить процент
zh_cn: 止损百分比

# ComparisonFrequencyTooltip
source: Stop the current analysis in the cryptanalytic component if the given percentage is reached.
ru: Остановите текущий анализ в криптоаналитическом компоненте, если данный процент будет достигнут.
zh_cn: 如果达到给定的百分比，则在密码分析组件中停止当前分析。

# StopIfPercentReachedCaption
source: Stop current analysis if percentage reached
ru: Остановить текущий анализ, если достигнутый процент
zh_cn: 如果达到百分比，则停止当前分析

# StopIfPercentReachedTooltip
source: Stop the current analysis in the cryptanalytic component if the given percentage is reached.
ru: Остановите текущий анализ в криптоаналитическом компоненте, если данный процент будет достигнут.
zh_cn: 如果达到给定的百分比，则在密码分析组件中停止当前分析。

source: Bigrams
ru: Биграммы
zh_cn: 比格勒姆

# GramsTypeCaption
source: Type of n-grams
ru: Тип грамма:
zh_cn: 克类型：

# GramsTypeTooltip
source: Defines the n-gram size, which should be used in the cost function during the cryptanalysis.
ru: Определяет размер n-граммов, который будет использоваться в функции стоимости во время криптоанализа.
zh_cn: 定义在密码分析过程中在成本函数中使用的n-gram大小。

source: Pentagrams
ru: Pentagramme
zh_cn: 五角星

source: Unigrams
ru: Униграммы
zh_cn: 克类型：
