Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Fialka/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# SettingsInputhandlerCaption
source: Input handling
de: Eingabebehandlung
ru: Обработка ввода
zh_cn: 输入处理

# SettingsInputhandlerTooltip
source: How will invalid input be handled?
de: Wie werden ungültige Eingabezeichen behandelt?
ru: Как будет обрабатываться недопустимый ввод?
zh_cn: 无效输入将如何处理？

# SettingsOutputUpdateCaption
source: Output update
de: Update der Ausgabe
ru: Обновление вывода
zh_cn: 输出更新

# SettingsOutputUpdateTooltip
source: Select when the output will be updated.
de: Wählen Sie, wann die Ausgabe erneuert werden soll.
ru: Выберите, когда выход будет обновлен.
zh_cn: 选择何时更新输出。

# VisibilityCaption
source: Hide settings
de: Einstellungen ausblenden
ru: Скрыть настройки
zh_cn: 隐藏设定

# VisibilityTooltip
source: Show / hide the elements in this group.
de: Zeige/verstecke die Elemente dieser Gruppe.
ru: Показать / скрыть элементы в этой группе.
zh_cn: 显示/隐藏该组中的元素。

# OutputKeyCaption
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# OutputKeyDescription
source: Key settings before end after the encryption.
de: Schlüssel-Einstellungen vor und nach der Verschlüsselung.
ru: Настройки ключа перед завершением шифрования.
zh_cn: 密钥设置在加密后结束。

# CountryLayoutList1
source: Poland
de: Polen
ru: Польша
zh_cn: 波兰

# CountryLayoutList2
source: GDR
de: DDR
ru: ГДР
zh_cn: 东德

# CountryLayoutList3
source: Czechoslovakia
de: Tschechoslowakei
ru: Чехословакия
zh_cn: 捷克斯洛伐克

# OperationModeList1
source: Plain (O)
de: Klartext (O)
ru: Обычная (O)
zh_cn: 普通（O）

# OperationModeList2
source: Encrypt (3)
de: Verschlüsseln (3)
ru: Шифрование (3)
zh_cn: 加密（3）

# OperationModeList3
source: Decrypt (P)
de: Entschlüsseln (P)
ru: Расшифровать (P)
zh_cn: 解密（P）

# PrintHeadMappingList1
source: Cyrillic (PУC)
de: Kyrillisch (PУC)
ru: Кириллица (PУC)
zh_cn: 西里尔字母（PУC）

# PrintHeadMappingList2
source: Latin (ЛAT)
de: Lateinisch (ЛAT)
ru: Латинский (ЛАТ)
zh_cn: 拉丁（ЛAT）

# SettingsInputhandlerList1
source: Remove
de: entfernen
ru: Удалить
zh_cn: 去掉

# SettingsInputhandlerList2
source: Mark with @
de: ersetzen durch @
ru: Отметьте с помощью @
zh_cn: 用@标记

# SettingsInputhandlerList3
source: Keep unchanged
de: behalten
ru: Не менять
zh_cn: 保持不变

# SettingsRestoreList1
source: After execution
de: nach Ausführung
ru: После выполнения
zh_cn: 执行后

# SettingsRestoreList2
source: Stop pressed
de: nach Stop
ru: Стоп нажат
zh_cn: 停止按

# SettingsRestoreList3
source: Input changed
de: bei Änderung der Eingabe
ru: Вход изменен
zh_cn: 输入已更改

# SettingsRestoreList4
source: Never
de: nie
ru: Никогда
zh_cn: 决不

# TextOperationModeList1
source: Letters (Б)
de: Buchstaben (Б)
ru: Письма (Б)
zh_cn: 字母（Б）

# TextOperationModeList2
source: Mixed (C)
de: Gemischt (C)
ru: Смешанный (C)
zh_cn: 混合（C）

# TextOperationModeList3
source: Numbers (Ц)
de: Zahlen (Ц)
ru: Числа (Ц)
zh_cn: 数字（Ц）
