Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Fialka/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# InputTextCaption
source: Input text
de: Eingabetext
ru: Текст ввода
zh_cn: 输入文本

# InputTextDescription
source: Input a string to be processed by the Fialka machine.
de: Geben Sie den mit der Fialka zu verarbeitenden Text ein.
ru: Введите строку, обрабатываемую машиной Fialka.
zh_cn: 输入要由Fialka机器处理的字符串。

# OutputTextCaption
source: Output text
de: Ausgabetext
ru: Текст вывода
zh_cn: 输出文字

# OutputTextDescription
source: Output a string to be processed by the Fialka machine.
de: Ausgabe des von der Fialka verarbeiteten Textes.
ru: Выведите строку, обрабатываемую машиной Fialka.
zh_cn: 输出要由Fialka机器处理的字符串。

# PluginCaption
source: Fialka
zh_cn: 菲亚卡

# PluginTooltip
source: Polyalphabetic rotor-cipher machine
de: Polyalphabetische Rotor-Chiffriermaschine
ru: Полиалафитная роторно-шифровая машина
zh_cn: 多字母转子密码机

# RotorCoreOffsetSelection
source: Core offsets
de: Kernoffsets
ru: Корректные смещения
zh_cn: 核心偏移

# RotorCoreSelection
source: Core order
de: Kernanordnung
ru: Основной порядок
zh_cn: 核心订单

# RotorCoreSideSelection
source: Core sides
de: Kernorientierung
ru: Боковые стороны
zh_cn: 核心方面

# RotorOffsetSelection
source: Rotor offsets
ru: Смещение ротора
zh_cn: 转子偏移

# RotorOrderSelection
source: Rotor order
de: Rotoranordnung
ru: Порядок ротора
zh_cn: 转子订购

# SelectMachineCountryLayoutCaption
source: Country layout
de: Länderspezifisches Layout
ru: План страны
zh_cn: 国家布局

# SelectMachineCountryLayoutTooltip
source: Select the country layout.
de: Wählen Sie das länderspezifische Layout.
ru: Выберите макет страны.
zh_cn: 选择国家/地区布局。

# SelectMachineKeyboardMappingCaption
source: Keyboard mapping
de: Tastaturbelegung
ru: Отображение клавиатуры
zh_cn: 键盘对应

# SelectMachineKeyboardMappingTooltip
source: Select the keyboard mapping.
de: Wählen Sie die Tastaturbelegung.
ru: Выберите отображение клавиатуры.
zh_cn: 选择键盘映射。

# SelectMachineModelCaption
source: Fialka model
de: Fialka-Modell
zh_cn: Fialka模型

# SelectMachineModelTooltip
source: Select the machine model type.
de: Wählen Sie das Maschinenmodell.
ru: Выберите тип модели машины.
zh_cn: 选择机器型号类型。

# SelectMachineNumLockTypeCaption
source: NumLock
zh_cn: 数字键盘（的第一个键

# SelectMachineNumLockTypeTooltip
source: Select the NumLock type.
de: Wählen Sie den NumLock-Typ.
ru: Выберите тип NumLock.
zh_cn: 选择数字锁定类型。

# SelectMachineOperationModeCaption
source: Operation mode
de: Operationmodus
ru: Режим работы
zh_cn: 操作模式

# SelectMachineOperationModeTooltip
source: Select the operation mode.
de: Wählen Sie den Operationsmodus.
ru: Выберите режим работы.
zh_cn: 选择操作模式。

# SelectMachinePrintHeadMappingCaption
source: Print head mapping
de: Typenrad
ru: Отображение печатающей головки
zh_cn: 打印头映射

# SelectMachinePrintHeadMappingTooltip
source: Select the print head mapping.
de: Wählen Sie das Typenrad des Druckers.
ru: Выберите отображение печатающей головки.
zh_cn: 选择打印头映射。

# SelectRotorSeriesCaption
source: Rotor series
de: Rotorensatz
ru: Серия роторов
zh_cn: 转子系列

# SelectRotorSeriesTooltip
source: Select the country specific rotor series.
de: Wählen Sie den länderspezifischen Rotorensatz.
ru: Выберите серийный роторный ряд.
zh_cn: 选择国家特定的转子系列。

# SelectRotorTypesCaption
source: Rotor type
de: Rotortyp
ru: Тип ротора
zh_cn: 转子类型

# SelectRotorTypesTooltip
source: Select the rotor type.
de: Wählen Sie den Rotortyp.
ru: Выберите тип ротора.
zh_cn: 选择转子类型。

source: Punch card
de: Lochkarte
ru: Перфокарта
zh_cn: 打卡

# RotorRingOffsetSelection
source: Ring offsets
ru: Кольцевые смещения
zh_cn: 环偏移

# MachineSettings
source: Fialka machine settings
de: Fialka-Einstellungen
ru: Настройки машины Fialka
zh_cn: Fialka机器设置

# SelectMachineTxtOpModeCaption
source: Text operation mode
de: Text-Operationsmodus
ru: Режим работы текста
zh_cn: 文字操作模式

# SelectMachineTxtOpModeTooltip
source: Select the text operation mode for M-125-3 machine.
de: Wählen Sie den Text-Operationsmodus für die M-125-3-Maschine.
ru: Выберите режим работы текста для машины M-125-3.
zh_cn: 选择M-125-3机器的文本操作模式。

# SettingsRestoreCaption
source: Restore initial key
de: Schlüssel zurücksetzen
ru: Восстановить начальный ключ
zh_cn: 恢复初始密钥

# SettingsRestoreTooltip
source: When will the initial key (set before encryption) be restored in the workflow.
de: Wann soll die Maschine wieder auf den initialen, vor der Verschlüsselung gesetzen Schlüssel gestellt werden?
ru: Когда в рабочем процессе будет восстановлен исходный ключ (установленный до шифрования).
zh_cn: 初始密钥（在加密之前设置）何时恢复工作流程。

# SelectRotor1OrderTooltip
source: Select the order (position in drum from left) of rotor 1.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 1.
ru: Выберите порядок (положение в барабане слева) ротора 1.
zh_cn: 选择转子1的顺序（从左开始在鼓中的位置）。

# SelectRotor1OffsetTooltip
source: Select the offset of rotor in position 1.
de: Wählen Sie den Offset des Rotors in Position 1.
ru: Выберите смещение ротора в положение 1.
zh_cn: 选择转子在位置1的偏移量。

# SelectRotorCore1Tooltip
source: Select the position of core 1 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 1 auf der Trommel.
ru: Выберите положение сердечника 1 (положение в роторах в барабане).
zh_cn: 选择铁心1的位置（鼓中转子的位置）。

# SelectRotor1CoreSideTooltip
source: Select the side of core 1.
de: Wählen Sie die Orientierung von Kern 1.
ru: Выберите сторону ядра 1.
zh_cn: 选择核心1的一侧。

# SelectRotor1CoreOffsetTooltip
source: Select the offset of core 1.
de: Wählen Sie den Offset von Kern 1.
ru: Выберите смещение сердечника 1.
zh_cn: 选择核心1的偏移量。

# RotorRing1OffsetTooltip
source: Select the ring offset of rotor in position 1.
de: Setzen Sie den Ringoffset des Rotors in Position 1.
ru: Выберите смещение кольца ротора в положении 1.
zh_cn: 选择位置1处的转子环偏移。

# SelectRotor2OrderTooltip
source: Select the order (position in drum from left) of rotor 2.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 2.
ru: Выберите порядок (положение в барабане слева) ротора 2.
zh_cn: 选择转子2的顺序（滚筒中从左开始的位置）。

# SelectRotor2OffsetTooltip
source: Select the offset of rotor in position 2.
de: Wählen Sie den Offset des Rotors in Position 2.
ru: Выберите смещение ротора в положении 2.
zh_cn: 选择转子在位置2的偏移量。

# SelectRotorCore2Tooltip
source: Select the position of core 2 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 2 auf der Trommel.
ru: Выберите положение сердечника 2 (положение в роторах в барабане).
zh_cn: 选择铁心2的位置（鼓中转子的位置）。

# SelectRotor2CoreSideTooltip
source: Select the side of core 2.
de: Wählen Sie die Orientierung von Kern 2.
ru: Выберите сторону сердечника 2.
zh_cn: 选择核心2的一侧。

# SelectRotor2CoreOffsetTooltip
source: Select the offset of core 2.
de: Wählen Sie den Offset von Kern 2.
ru: Выберите смещение сердечника 2.
zh_cn: 选择核心2的偏移量。

# RotorRing2OffsetTooltip
source: Select the ring offset of rotor in position 2.
de: Setzen Sie den Ringoffset des Rotors in Position 2.
ru: Выберите смещение кольца ротора в положении 2.
zh_cn: 在位置2中选择转子的环偏移。

# SelectRotor3OrderTooltip
source: Select the order (position in drum from left) of rotor 3.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 3.
ru: Выберите порядок (положение в барабане слева) ротора 3.
zh_cn: 选择转子3的顺序（滚筒中从左开始的位置）。

# SelectRotor3OffsetTooltip
source: Select the offset of rotor in position 3.
de: Wählen Sie den Offset des Rotors in Position 3.
ru: Выберите смещение ротора в положении 3.
zh_cn: 选择转子在位置3的偏移量。

# SelectRotorCore3Tooltip
source: Select the position of core 3 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 3 auf der Trommel.
ru: Выберите положение сердечника 3 (положение в роторах в барабане).
zh_cn: 选择铁心3的位置（鼓中转子的位置）。

# SelectRotor3CoreSideTooltip
source: Select the side of core 3.
de: Wählen Sie die Orientierung von Kern 3.
ru: Выберите сторону сердечника 3.
zh_cn: 选择核心3的一侧。

# SelectRotor3CoreOffsetTooltip
source: Select the offset of core 3.
de: Wählen Sie den Offset von Kern 3.
ru: Выберите смещение сердечника 3.
zh_cn: 选择核心3的偏移量。

# RotorRing3OffsetTooltip
source: Select the ring offset of rotor in position 3.
de: Setzen Sie den Ringoffset des Rotors in Position 3.
ru: Выберите смещение кольца ротора в положении 3.
zh_cn: 在位置3中选择转子的环偏移。

# SelectRotor4OrderTooltip
source: Select the order (position in drum from left) of rotor 4.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 4.
ru: Выберите порядок (положение в барабане слева) ротора 4.
zh_cn: 选择转子4的顺序（滚筒中从左开始的位置）。

# SelectRotor4OffsetTooltip
source: Select the offset of rotor in position 4.
de: Wählen Sie den Offset des Rotors in Position 4.
ru: Выберите смещение ротора в положении 4.
zh_cn: 选择转子在位置4的偏移量。

# SelectRotorCore4Tooltip
source: Select the position of core 4 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 4 auf der Trommel.
ru: Выберите положение сердечника 4 (положение в роторах в барабане).
zh_cn: 选择芯4的位置（鼓中转子的位置）。

# SelectRotor4CoreSideTooltip
source: Select the side of core 4.
de: Wählen Sie die Orientierung von Kern 4.
ru: Выберите сторону ядра 4.
zh_cn: 选择核心4的一侧。

# SelectRotor4CoreOffsetTooltip
source: Select the offset of core 4.
de: Wählen Sie den Offset von Kern 4.
ru: Выберите смещение ядра 4.
zh_cn: 选择核心4的偏移量。

# RotorRing4OffsetTooltip
source: Select the ring offset of rotor in position 4.
de: Setzen Sie den Ringoffset des Rotors in Position 4.
ru: Выберите смещение кольца ротора в положении 4.
zh_cn: 在位置4中选择转子的环偏移。

# SelectRotor5OrderTooltip
source: Select the order (position in drum from left) of rotor 5.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 5.
ru: Выберите порядок (положение в барабане слева) ротора 5.
zh_cn: 选择转子5的顺序（滚筒中从左开始的位置）。

# SelectRotor5OffsetTooltip
source: Select the offset of rotor in position 5.
de: Wählen Sie den Offset des Rotors in Position 5.
ru: Выберите смещение ротора в положении 5.
zh_cn: 选择转子在位置5的偏移量。

# SelectRotorCore5Tooltip
source: Select the position of core 5 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 5 auf der Trommel.
ru: Выберите положение сердечника 5 (положение в роторах в барабане).
zh_cn: 选择铁心5的位置（鼓中转子的位置）。

# SelectRotor5CoreSideTooltip
source: Select the side of core 5.
de: Wählen Sie die Orientierung von Kern 5.
ru: Выберите сторону сердечника 5.
zh_cn: 选择核心5的一侧。

# SelectRotor5CoreOffsetTooltip
source: Select the offset of core 5.
de: Wählen Sie den Offset von Kern 5.
ru: Выберите смещение сердечника 5.
zh_cn: 选择核心5的偏移量。

# RotorRing5OffsetTooltip
source: Select the ring offset of rotor in position 5.
de: Setzen Sie den Ringoffset des Rotors in Position 5.
ru: Выберите смещение кольца ротора в положении 5.
zh_cn: 在位置5中选择转子的环偏移。

# SelectRotor6OrderTooltip
source: Select the order (position in drum from left) of rotor 6.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 6.
ru: Выберите порядок (положение в барабане слева) ротора 6.
zh_cn: 选择转子6的顺序（从左开始在鼓中的位置）。

# SelectRotor6OffsetTooltip
source: Select the offset of rotor in position 6.
de: Wählen Sie den Offset des Rotors in Position 6.
ru: Выберите смещение ротора в положении 6.
zh_cn: 选择转子在位置6的偏移量。

# SelectRotorCore6Tooltip
source: Select the position of core 6 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 6 auf der Trommel.
ru: Выберите положение сердечника 6 (положение в роторах в барабане).
zh_cn: 选择铁心6的位置（鼓中转子的位置）。

# SelectRotor6CoreSideTooltip
source: Select the side of core 6.
de: Wählen Sie die Orientierung von Kern 6.
ru: Выберите сторону ядра 6.
zh_cn: 选择核心6的一侧。

# SelectRotor6CoreOffsetTooltip
source: Select the offset of core 6.
de: Wählen Sie den Offset von Kern 6.
ru: Выберите смещение ядра 6.
zh_cn: 选择核心6的偏移量。

# RotorRing6OffsetTooltip
source: Select the ring offset of rotor in position 6.
de: Setzen Sie den Ringoffset des Rotors in Position 6.
ru: Выберите смещение кольца ротора в положении 6.
zh_cn: 在位置6中选择转子的环偏移。

# SelectRotor7OrderTooltip
source: Select the order (position in drum from left) of rotor 7.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 7.
ru: Выберите порядок (положение в барабане слева) ротора 7.
zh_cn: 选择转子7的顺序（在鼓中从左开始的位置）。

# SelectRotor7OffsetTooltip
source: Select the offset of rotor in position 7.
de: Wählen Sie den Offset des Rotors in Position 7.
ru: Выберите смещение ротора в положение 7.
zh_cn: 在位置7中选择转子的偏移量。

# SelectRotorCore7Tooltip
source: Select the position of core 7 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 7 auf der Trommel.
ru: Выберите положение сердечника 7 (положение в роторах в барабане).
zh_cn: 选择铁心7的位置（滚筒中转子的位置）。

# SelectRotor7CoreSideTooltip
source: Select the side of core 7.
de: Wählen Sie die Orientierung von Kern 7.
ru: Выберите сторону ядра 7.
zh_cn: 选择核心7的一侧。

# SelectRotor7CoreOffsetTooltip
source: Select the offset of core 7.
de: Wählen Sie den Offset von Kern 7.
ru: Выберите смещение ядра 7.
zh_cn: 选择核心7的偏移量。

# RotorRing7OffsetTooltip
source: Select the ring offset of rotor in position 7.
de: Setzen Sie den Ringoffset des Rotors in Position 7.
ru: Выберите смещение кольца ротора в положении 7.
zh_cn: 选择位置7处的转子环偏移。

# SelectRotor8OrderTooltip
source: Select the order (position in drum from left) of rotor 8.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 8.
ru: Выберите порядок (положение в барабане слева) ротора 8.
zh_cn: 选择转子8的顺序（滚筒中从左开始的位置）。

# SelectRotor8OffsetTooltip
source: Select the offset of rotor in position 8.
de: Wählen Sie den Offset des Rotors in Position 8.
ru: Выберите смещение ротора в положении 8.
zh_cn: 选择转子在位置8的偏移量。

# SelectRotorCore8Tooltip
source: Select the position of core 8 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 8 auf der Trommel.
ru: Выберите положение сердечника 8 (положение в роторах в барабане).
zh_cn: 选择铁心8的位置（鼓中转子的位置）。

# SelectRotor8CoreSideTooltip
source: Select the side of core 8.
de: Wählen Sie die Orientierung von Kern 8.
ru: Выберите сторону сердечника 8.
zh_cn: 选择核心8的一侧。

# SelectRotor8CoreOffsetTooltip
source: Select the offset of core 8.
de: Wählen Sie den Offset von Kern 8.
ru: Выберите смещение ядра 8.
zh_cn: 选择核心8的偏移量。

# RotorRing8OffsetTooltip
source: Select the ring offset of rotor in position 8.
de: Setzen Sie den Ringoffset des Rotors in Position 8.
ru: Выберите смещение кольца ротора в положении 8.
zh_cn: 在位置8中选择转子的环偏移。

# SelectRotor9OrderTooltip
source: Select the order (position in drum from left) of rotor 9.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 9.
ru: Выберите порядок (положение в барабане слева) ротора 9.
zh_cn: 选择转子9的顺序（滚筒中从左开始的位置）。

# SelectRotor9OffsetTooltip
source: Select the offset of rotor in position 9.
de: Wählen Sie den Offset des Rotors in Position 9.
ru: Выберите смещение ротора в положении 9.
zh_cn: 在位置9中选择转子的偏移量。

# SelectRotorCore9Tooltip
source: Select the position of core 9 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 9 auf der Trommel.
ru: Выберите положение сердечника 9 (положение в роторах в барабане).
zh_cn: 选择铁心9的位置（鼓中转子的位置）。

# SelectRotor9CoreSideTooltip
source: Select the side of core 9.
de: Wählen Sie die Orientierung von Kern 9.
ru: Выберите сторону ядра 9.
zh_cn: 选择核心9的一侧。

# SelectRotor9CoreOffsetTooltip
source: Select the offset of core 9.
de: Wählen Sie den Offset von Kern 9.
ru: Выберите смещение ядра 9.
zh_cn: 选择核心9的偏移量。

# RotorRing9OffsetTooltip
source: Select the ring offset of rotor in position 9.
de: Setzen Sie den Ringoffset des Rotors in Position 9.
ru: Выберите смещение кольца ротора в положении 9.
zh_cn: 在位置9选择转子的环偏移。

# SelectRotor10OrderTooltip
source: Select the order (position in drum from left) of rotor 10.
de: Wählen Sie die Position in der Trommel (links beginnend) von Rotor 10.
ru: Выберите порядок (положение в барабане слева) ротора 10.
zh_cn: 选择转子10的顺序（滚筒中从左开始的位置）。

# SelectRotor10OffsetTooltip
source: Select the offset of rotor in position 10.
de: Wählen Sie den Offset des Rotors in Position 10.
ru: Выберите смещение ротора в положении 10.
zh_cn: 在位置10中选择转子的偏移量。

# SelectRotorCore10Tooltip
source: Select the position of core 10 (position in rotors in the drum).
de: Wählen Sie die Position von Kern 10 auf der Trommel.
ru: Выберите положение сердечника 10 (положение в роторах в барабане).
zh_cn: 选择铁心10的位置（鼓中转子的位置）。

# SelectRotor10CoreSideTooltip
source: Select the side of core 10.
de: Wählen Sie die Orientierung von Kern 10.
ru: Выберите сторону ядра 10.
zh_cn: 选择核心10的一侧。

# SelectRotor10CoreOffsetTooltip
source: Select the offset of core 10.
de: Wählen Sie den Offset von Kern 10.
ru: Выберите смещение ядра 10.
zh_cn: 选择核心10的偏移量。

# RotorRing10OffsetTooltip
source: Select the ring offset of rotor in position 10.
de: Setzen Sie den Ringoffset des Rotors in Position 10.
ru: Выберите смещение кольца ротора в положении 10.
zh_cn: 选择位置10处的转子环偏移。

# PunchCard1Tooltip
source: Punch card mapping of contact 1.
de: Wert des Lochkarten-Kontaktes 1.
ru: Перфорирование карты контакта 1.
zh_cn: 联系人1.的打卡映射。

# PunchCard2Tooltip
source: Punch card mapping of contact 2.
de: Wert des Lochkarten-Kontaktes 2.
ru: Отображение карты перфорации контакта 2.
zh_cn: 联系人的打卡映射2。

# PunchCard3Tooltip
source: Punch card mapping of contact 3.
de: Wert des Lochkarten-Kontaktes 3.
ru: Отображение карты перфорации контакта 3.
zh_cn: 联系人的打卡映射3。

# PunchCard4Tooltip
source: Punch card mapping of contact 4.
de: Wert des Lochkarten-Kontaktes 4.
ru: Отображение карты перфорации контакта 4.
zh_cn: 联系人的打卡映射4。

# PunchCard5Tooltip
source: Punch card mapping of contact 5.
de: Wert des Lochkarten-Kontaktes 5.
ru: Отображение карты перфорации контакта 5.
zh_cn: 联系人的打卡映射5。

# PunchCard6Tooltip
source: Punch card mapping of contact 6.
de: Wert des Lochkarten-Kontaktes 6.
ru: Отображение карты перфорации контакта 6.
zh_cn: 联系人的打卡映射6。

# PunchCard7Tooltip
source: Punch card mapping of contact 7.
de: Wert des Lochkarten-Kontaktes 7.
ru: Перфорирование карты контакта 7.
zh_cn: 联系人的打卡映射7。

# PunchCard8Tooltip
source: Punch card mapping of contact 8.
de: Wert des Lochkarten-Kontaktes 8.
ru: Отображение карты перфорации контакта 8.
zh_cn: 联系人的打卡映射8。

# PunchCard9Tooltip
source: Punch card mapping of contact 9.
de: Wert des Lochkarten-Kontaktes 9.
ru: Отображение карты перфорации контакта 9.
zh_cn: 联系人的打卡映射9。

# PunchCard10Tooltip
source: Punch card mapping of contact 10.
de: Wert des Lochkarten-Kontaktes 10.
ru: Отображение карты перфорации контакта 10.
zh_cn: 联系人10的打孔卡映射。

# PunchCard11Tooltip
source: Punch card mapping of contact 11.
de: Wert des Lochkarten-Kontaktes 11.
ru: Отображение карты перфорации контакта 11.
zh_cn: 联系人的打卡映射11。

# PunchCard12Tooltip
source: Punch card mapping of contact 12.
de: Wert des Lochkarten-Kontaktes 12.
ru: Перфорирование карты контакта 12.
zh_cn: 联系人的打卡映射12。

# PunchCard13Tooltip
source: Punch card mapping of contact 13.
de: Wert des Lochkarten-Kontaktes 13.
ru: Отображение карты перфорации контакта 13.
zh_cn: 联系人的打卡映射13。

# PunchCard14Tooltip
source: Punch card mapping of contact 14.
de: Wert des Lochkarten-Kontaktes 14.
ru: Перфорирование карты контакта 14.
zh_cn: 联系人的打卡映射14。

# PunchCard15Tooltip
source: Punch card mapping of contact 15.
de: Wert des Lochkarten-Kontaktes 15.
ru: Отображение карты перфорации контакта 15.
zh_cn: 联系人的打孔卡映射15。

# PunchCard16Tooltip
source: Punch card mapping of contact 16.
de: Wert des Lochkarten-Kontaktes 16.
ru: Отображение карты перфорации контакта 16.
zh_cn: 联系人的打卡映射16。

# PunchCard17Tooltip
source: Punch card mapping of contact 17.
de: Wert des Lochkarten-Kontaktes 17.
ru: Перфорирование карты контакта 17.
zh_cn: 联系人的打孔卡映射17。

# PunchCard18Tooltip
source: Punch card mapping of contact 18.
de: Wert des Lochkarten-Kontaktes 18.
ru: Отображение карты перфорации контакта 18.
zh_cn: 联系人的打卡映射18。

# PunchCard19Tooltip
source: Punch card mapping of contact 19.
de: Wert des Lochkarten-Kontaktes 19.
ru: Отображение перфокарты контакта 19.
zh_cn: 联系人的打卡映射19。

# PunchCard20Tooltip
source: Punch card mapping of contact 20.
de: Wert des Lochkarten-Kontaktes 20.
ru: Отображение карты перфорации контакта 20.
zh_cn: 联系人的打卡映射20。

# PunchCard21Tooltip
source: Punch card mapping of contact 21.
de: Wert des Lochkarten-Kontaktes 21.
ru: Отображение перфокарты контакта 21.
zh_cn: 联系人21的打卡映射。

# PunchCard22Tooltip
source: Punch card mapping of contact 22.
de: Wert des Lochkarten-Kontaktes 22.
ru: Отображение карты перфорации контакта 22.
zh_cn: 联系人的打卡映射22。

# PunchCard23Tooltip
source: Punch card mapping of contact 23.
de: Wert des Lochkarten-Kontaktes 23.
ru: Перфорирование карты контакта 23.
zh_cn: 联系人的打卡映射23。

# PunchCard24Tooltip
source: Punch card mapping of contact 24.
de: Wert des Lochkarten-Kontaktes 24.
ru: Отображение карты перфорации контакта 24.
zh_cn: 联系人24的打卡映射。

# PunchCard25Tooltip
source: Punch card mapping of contact 25.
de: Wert des Lochkarten-Kontaktes 25.
ru: Отображение карты перфорации контакта 25.
zh_cn: 联系人25的打卡映射。

# PunchCard26Tooltip
source: Punch card mapping of contact 26.
de: Wert des Lochkarten-Kontaktes 26.
ru: Отображение карты перфорации контакта 26.
zh_cn: 联系人26的打卡映射。

# PunchCard27Tooltip
source: Punch card mapping of contact 27.
de: Wert des Lochkarten-Kontaktes 27.
ru: Отображение карты перфорации контакта 27.
zh_cn: 联系人27的打卡映射。

# PunchCard28Tooltip
source: Punch card mapping of contact 28.
de: Wert des Lochkarten-Kontaktes 28.
ru: Отображение карты перфорации контакта 28.
zh_cn: 触点28的打孔卡映射。

# PunchCard29Tooltip
source: Punch card mapping of contact 29.
de: Wert des Lochkarten-Kontaktes 29.
ru: Отображение карты перфорации контакта 29.
zh_cn: 联系人29的打卡映射。

# PunchCard30Tooltip
source: Punch card mapping of contact 30.
de: Wert des Lochkarten-Kontaktes 30.
ru: Перфорирование карты контакта 30.
zh_cn: 联系人30的打卡映射。

# ResetPunchCardCaption
source: Set identity
de: Identität
ru: Установить личность
zh_cn: 设定身分

# ResetPunchCardTooltip
source: Reset the punch card substitution to identity (set the triangle).
de: Setze die Lochkarten-Substitution zurück (identische Abbildung).
ru: Сбросьте замену перфокарты на личность (установите треугольник).
zh_cn: 将打孔卡替换重置为标识（设置三角形）。

# ResetRotorCoreOffsetCaption
source: Null offsets
ru: Нулевые смещения
zh_cn: 空偏移

# ResetRotorCoreOffsetTooltip
source: Set the rotor core offsets to 0.
de: Setze die Rotorkernoffsets auf 0.
ru: Установите смещения сердечника ротора на 0.
zh_cn: 将转子芯偏移设置为0。

# ResetRotorCoreOrderCaption
source: Base positions
de: Grundpositionen
ru: Базовые позиции
zh_cn: 基本职位

# ResetRotorCoreOrderTooltip
source: Order the cores into base positions.
de: Setze die Kerne in ihre Grundpositionen.
ru: Закажите сердечники в базовые положения.
zh_cn: 将型芯订购到基本位置。

# ResetRotorCoreSidesCaption
source: Deafult core sides
de: Kernorientierungen zurücksetzen
ru: Глубокие боковые стороны
zh_cn: 核心侧聋

# ResetRotorCoreSidesTooltip
source: Set the core sides to default values (side 1).
de: Setze die Kernorientierungen auf den Grundwert (Seite 1).
ru: Установите для сторон ядра значения по умолчанию (сторона 1).
zh_cn: 将核心面设置为默认值（面1）。

# ResetRotorOffsetBaseCaption
source: Base positions
de: Grundpositionen
ru: Базовые позиции
zh_cn: 基本职位

# ResetRotorOffsetBaseTooltip
source: Set the rotor offsets to base position.
de: Setze die Rotoroffsets auf die Grundposition.
ru: Установите смещения ротора в базовое положение.
zh_cn: 将转子偏移量设置为基本位置。

# ResetRotorOffsetNullCaption
source: Null offsets
ru: Нулевые смещения
zh_cn: 空偏移

# ResetRotorOffsetNullTooltip
source: Set the rotor offsets to 0.
de: Setze die Rotoroffsets auf 0.
ru: Установите смещения ротора на 0.
zh_cn: 将转子偏移设置为0。

# ResetRotorOrderCaption
source: Base positions
de: Grundpositionen
ru: Базовые позиции
zh_cn: 基本职位

# ResetRotorOrderTooltip
source: Order the rotors into base positions.
de: Setze die Rotoren in ihre Grundpositionen.
ru: Закажите роторы в базовые положения.
zh_cn: 将转子订购到基本位置。
