Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/BlindSignatureGenerator/Properties/Resources.*.resx
Languages: de, zh_cn

source: Message M is:
de: Nachricht M ist:
zh_cn: 消息M为：

source: Hash h(M) is:
de: Hash h(M) ist:
zh_cn: 哈希h（M）为：

source: Random number k is:
de: Zufallszahl k ist:
zh_cn: 随机数k为：

source: Signature S is:
de: Signatur S ist:
zh_cn: 签名S为：

# BlindSignature
source: Blind signature S
de: Blinde Signatur S
zh_cn: 盲签名S

# BlindSignatureAsNumber
source: Blind signature S as a number
de: Blinde Signatur S als Zahl
zh_cn: 盲目签名S为数字

# BlindSignatureAsNumberTooltip
source: Output of the blind signature as a number.
de: Ausgabe der blinden Signatur als Zahl.
zh_cn: 盲签名输出为数字。

# BlindSignatureGeneratorCaption
source: Blind Signature Generator
de: Blinde-Signatur-Generator
zh_cn: 盲签名生成器

# BlindSignatureGeneratorTooltip
source: Generates a blind signature for a message.
de: Erstellt eine blinde Signatur für eine Nachricht.
zh_cn: 生成消息的盲签名。

# BlindSignaturePaillier
source: Blind signature S for Paillier
de: Blinde Signatur S für Paillier
zh_cn: Paillier的盲目签名S

# BlindSignaturePaillierTooltip
source: Output of the blind signature for Paillier.
de: Ausgabe der blinden Signatur für Paillier.
zh_cn: Paillier的盲签名输出。

# BlindSignatureTooltip
source: Output of the blind signature.
de: Ausgabe der blinden Signatur.
zh_cn: 盲签名的输出。

source: Debug
zh_cn: 除错

# DebugTooltip
source: Output of all results for debugging.
de: Ausgabe aller Zwischenergebnisse für Debugging.
zh_cn: 输出所有结果以进行调试。

source: Hash algorithm
de: Hash-Verfahren
zh_cn: 哈希算法

# HashAlgorithmTooltip
source: Choose the hash algorithm to be used.
de: Wählen Sie das zu verwendende Hash-Verfahren.
zh_cn: 选择要使用的哈希算法。

source: Message M
de: Nachricht M
zh_cn: 讯息M

# MessageMTooltip
source: Input of the message to be signed.
de: Eingabe der zu signierenden Nachricht.
zh_cn: 输入要签名的消息。

# ModuloN
source: Modulus N
zh_cn: 模量N

# ModuloNTooltip
source: Input of the modulus.
de: Eingabe des Moduls.
zh_cn: 输入模数。

# PrivateKey
source: Private key D/Lambda
de: Privater Schlüssel D/Lambda
zh_cn: 私钥D / Lambda

# PrivateKeyTooltip
source: Input of the private key D/Lambda.
de: Eingabe des privaten Schlüssel D/Lambda.
zh_cn: 输入私钥D / Lambda。

# PublicKey
source: Public key E/G
de: Öffentlicher Schlüssel E/G
zh_cn: 公钥E / G

# PublicKeyTooltip
source: Input of the public key E/G.
de: Eingabe des öffentlichen Schlüssel E/G.
zh_cn: 输入公钥E / G。

source: Signing algorithm
de: Signier-Verfahren
zh_cn: 签名算法

# SigningAlgorithmTooltip
source: Choose the signing algorithm to be used.
de: Wählen Sie das zu verwendende Signier-Verfahren.
zh_cn: 选择要使用的签名算法。

# BlindSignatureAsNumberIn
source: Blind signature S as a number
de: Blinde Signatur S als Zahl
zh_cn: 盲目签名S为数字

# BlindSignatureAsNumberInTooltip
source: Input of the blind signature as a number.
de: Eingabe der blinden Signatur als Zahl.
zh_cn: 输入盲签名作为数字。

# BlindSignatureIn
source: Blind signature S
de: Blinde Signatur S
zh_cn: 盲签名S

# BlindSignatureInTooltip
source: Input of the blind signature.
de: Eingabe der blinden Signatur.
zh_cn: 输入盲签名。

# BlindSignaturePaillierIn
source: Blind signature S for Paillier
de: Blinde Signatur S für Paillier
zh_cn: Paillier的盲目签名S

# BlindSignaturePaillierInTooltip
source: Input of the blind signature for Paillier.
de: Eingabe der blinden Signatur für Paillier.
zh_cn: 输入Paillier的盲目签名。

# BlindSignatureVerifierCaption
source: Blind Signature Verifier
de: Blinde-Signatur-Verifizierer
zh_cn: 盲签名验证者

# BlindSignatureVerifierTooltip
source: Verifies a blind signature
de: Verifiziert eine blinde Signatur
zh_cn: 验证盲签名

# DecryptedBlindSignature
source: Decrypted blind signature S
de: Entschlüsselte blinde Signatur S
zh_cn: 解密的盲签名S

# DecryptedBlindSignatureAsNumber
source: Decrypted blind signature S as a number
de: Entschlüsselte blinde Signatur S als Zahl
zh_cn: 解密的盲签名S为数字

# DecryptedBlindSignatureAsNumberTooltip
source: Output of the decrypted blind signature as a number
de: Ausgabe der entschlüsselten blinden Signatur als Zahl
zh_cn: 解密的盲签名输出为数字

# DecryptedBlindSignatureTooltip
source: Output of the decrypted blind signature
de: Ausgabe der entschlüsselten blinden Signatur
zh_cn: 解密的盲签名的输出

# Slide0Description
source: This is the presentation of the Blind Signature Generator. Blind signatures are a special type of digital signatures which allow a high degree of anonymity and yet can be used for verification of messages.
de: Dies ist die Präsentation des Blinde-Signatur-Generators. Blinde Signaturen sind eine Sonderform der digitalen Signaturen, welche einen hohen Grad an Anonymität erlauben und dennoch zur Verifikation von Nachrichten genutzt werden können.
zh_cn: 这是盲签名生成器的演示。盲签名是一种特殊类型的数字签名，它允许高度匿名，但仍可用于验证消息。

# Slide0Values
source: Please run the generator and then click through the steps to be shown the internal calculations of the component.
de: Bitte starten Sie die Komponente und klicken Sie sich anschließend durch die Schritte um die internen Berechnungen der Komponente gezeigt zu bekommen.
zh_cn: 请运行生成器，然后单击相应步骤以显示组件的内部计算。

# Slide1Description
source: In the first step the component reads your input and registers it.
de: Im ersten Schritt liest die Komponente den Input und speichert diesen.
zh_cn: 第一步，组件读取您的输入并进行注册。

# Slide1Values0
source: Values:
de: Werte:
zh_cn: 值：

# Slide1Values1
source: The input of your message (M) is:
de: Der Input der Nachricht M ist:
zh_cn: 您的消息（M）的输入是：

# Slide1Values2
source: The input of your modulo (N) is:
de: Der Input des Modulo N ist:
zh_cn: 模（N）的输入为：

# Slide1Values3
source: The input of your public key (E/G)is:
de: Der Input des öffentlichen Schlüssels (E/G) ist:
zh_cn: 您的公共密钥（E / G）输入为：

# Slide1Values4
source: The input of your private key (D/Lambda) is:
de: Der Inpute des privaten Schlüssels (D/Lambda) ist:
zh_cn: 私钥（D / Lambda）的输入为：

# Slide2Description
source: In the second step the component the component converts your message to a byte[] and uses the hash algorithm you have chosen in the settings.
de: Im zweiten Schritt konvertiert die Komponente die Nachricht in ein byte[] und nutzt den Hash Algorithmus der in den Einstellungen gewählt wurde.
zh_cn: 在第二步中，组件组件将您的消息转换为byte []并使用您在设置中选择的哈希算法。

# Slide2Values
source: Your message has now become:
de: Die Nachricht ist nun:
zh_cn: 您的留言现在变成：

# Slide3DescriptionPaillier1
source: In the third step the component blinds the message for the paillier signing algorithm.
de: Im dritten Schritt blendet die Komponente die Nachricht für den Paillier Signier-Algorithmus.
zh_cn: 在第三步中，组件为消息签名算法屏蔽消息。

# Slide3DescriptionPaillier2
source: For this a blindingfactor k is randomly generated and used to blind the message with M* = M * k^N
de: Dafür wird ein Blendfaktor k zufällig generiert und verwendet um die Nachricht zu blenden mit M* = M * k^N
zh_cn: 为此，随机生成一个盲因子k，并使用盲因子M * = M * k ^ N

# Slide3DescriptionRSA1
source: In the third step the component blinds the message for the RSA signing algorithm.
de: Im dritten Schritt blendet die Komponente die Nachricht für den RSA Signier-Algorithmus.
zh_cn: 在第三步中，组件为RSA签名算法屏蔽消息。

# Slide3DescriptionRSA2
source: For this a blindingfactor k is randomly generated and used to blind the message with M* = M * k^E mod N
de: Dafür wird ein Blendfaktor k zufällig generiert. Das Blenden geschieht mit M* = M * k^E mod N
zh_cn: 为此，随机生成一个盲因子k，并使用盲因子M * = M * k ^ E mod N

# Slide3ValuesPaillier1
source: k:
zh_cn: 至：

# Slide3ValuesRSA1
source: k:
zh_cn: 至：

# Slide3ValuesRSA2
source: Blinded message M*:
de: Geblendete Nachricht M*:
zh_cn: 盲消息M *：

# Slide4DescriptionPaillier1
source: In the fourth step the component starts the pallier signing algorithm.
de: Im vierten Schritt beginnt die Komponente den Paillier Signier-Algorithmus.
zh_cn: 在第四步中，组件启动较浅的签名算法。

# Slide4DescriptionPaillier2
source: For that the two signature values s1 and s2 for the paillier algorithm are calculated with
de: Dafür werden die zwei Signatur Werte s1 uns 2 des Paillier Signier-Algorithmus berechnet mit
zh_cn: 为此，使用以下公式计算paillier算法的两个签名值s1和s2：

# Slide4DescriptionPaillier5
source: At last the signature is un-blinded by multiplying s2 with k^-1 mod N
de: Zuletzt wird die Signatur noch entblendet, indem s2 mit k^-1 mod N multipliziert wird
zh_cn: 最后通过将s2乘以k ^ -1 mod N来消除盲目性

# Slide4DescriptionRSA1
source: In the fourth step the component starts the RSA signing algorithm.
de: Im vierten Schritt beginnt die Komponente den RSA Signier-Algorithmus.
zh_cn: 在第四步中，组件启动RSA签名算法。

# Slide4DescriptionRSA2
source: For this the signature s is calculated with s = M^D mod N
de: Dafür wird die Signatur s berechnet mit s = M^D mod N
zh_cn: 为此，用s = M ^ D mod N计算签名s

# Slide4DescriptionRSA3
source: At last the signature is un-blinded by dividing s by k
de: Zuletzt wird die Signatur entblendet, indem s durch k geteilt wird
zh_cn: 最后，通过将s除以k来消除盲目性

# Slide4ValuesRSA1
source: k:
zh_cn: 至：

# PublicMessage
source: Message M publicly visible
de: Nachricht M öffentlich sichtbar
zh_cn: 消息M公开可见

# PublicMessageTooltip
source: Input of your Message to be publicly announced
de: Eingabe der öffentlich angekündigten Nachricht M
zh_cn: 输入要公开宣布的消息

# SlideDescription
source: Description:
de: Beschreibung:
zh_cn: 描述：

# SlideStep
source: Step:
de: Schritt:
zh_cn: 步：

# SlideTitle
source: Blind Signature Generator
de: Blinde-Signatur-Generator
zh_cn: 盲签名生成器

# SlideValues
source: Values:
de: Werte:
zh_cn: 值：

# BlindSigningSecurity
source: Blind Signing Security Level
de: Blindes Signieren Sicherheitsstufe
zh_cn: 盲签名安全级别

# BlindSigningSecurityTooltip
source: Choose the security level against blind signing attacks.
de: Wählen Sie die Sicherheitsstufe gegen Blind-Signing-Angriffe.
zh_cn: 选择针对盲签名攻击的安全级别。
