Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Ubchi/Properties/Resources.*.resx
Languages: de

# Ubchi_PluginTooltip
source: German WWI double columnar transposition cipher with nulls
de: Deutsche doppelte Spaltentranspositionschiffre aus dem Ersten Weltkrieg mit Nullzeichen

# Ubchi_InputText_Name
source: Input text
de: Eingabetext

# Ubchi_InputText_Description
source: Text to encrypt or decrypt
de: Text zum Ver- oder Entschlüsseln

# Ubchi_Key1_Name
source: Key 1
de: Schlüssel 1

# Ubchi_Key1_Description
source: Primary encryption key
de: Primärer Schlüssel

# Ubchi_Key2_Name
source: Key 2
de: Schlüssel 2

# Ubchi_Key2_Description
source: Secondary key for dual-key mode (optional)
de: Sekundärer Schlüssel für den Doppelschlüsselmodus (optional)

# Ubchi_OutputText_Name
source: Output text
de: Ausgabetext

# Ubchi_OutputText_Description
source: Encrypted or decrypted result
de: Ver- oder entschlüsseltes Ergebnis

# UbchiSettings_Action_Caption
source: Action
de: Aktion

# UbchiSettings_Action_Tooltip
source: Choose whether to encrypt or decrypt the text
de: Auswählen, ob der Text ver- oder entschlüsselt werden soll

# UbchiSettings_Action_Encrypt
source: Encrypt
de: Verschlüsseln

# UbchiSettings_Action_Decrypt
source: Decrypt
de: Entschlüsseln

# UbchiSettings_UseDualKey_Caption
source: Use Dual Key
de: Doppelschlüssel verwenden

# UbchiSettings_UseDualKey_Tooltip
source: Use different keys for first and second transposition (Key 2 required)
de: Unterschiedliche Schlüssel für erste und zweite Transposition verwenden (Schlüssel 2 erforderlich)

# UbchiSettings_UseCustomKeyLength_Caption
source: Allow Custom Key Length
de: Benutzerdefinierte Schlüssellänge erlauben

# UbchiSettings_UseCustomKeyLength_Tooltip
source: Allow keys of any length (if unchecked, requires 12-30 characters)
de: Schlüssel beliebiger Länge zulassen (falls deaktiviert: 12–30 Zeichen erforderlich)

# Ubchi_Error_InputAndKeyRequired
source: Input text and primary key are required
de: Eingabetext und primärer Schlüssel sind erforderlich

# Ubchi_Log_ActionWordsKey1
source: Action: {0}, Words in Key1: {1}
de: Aktion: {0}, Wörter in Schlüssel 1: {1}

# Ubchi_Log_WordsKey2TotalNulls
source: Words in Key2: {0}, Total nulls: {1}
de: Wörter in Schlüssel 2: {0}, Nullzeichen gesamt: {1}

# Ubchi_Log_Completed
source: UBCHI {0} completed successfully
de: ÜBCHI {0} erfolgreich abgeschlossen

# Ubchi_Log_ErrorPrefix
source: Error: {0}
de: Fehler: {0}

# Ubchi_Error_Key1Length
source: Key 1 must be 12-30 characters long (currently {0}). Enable '{1}' to use any length.
de: Schlüssel 1 muss 12–30 Zeichen lang sein (aktuell {0}). Aktiviere „{1}“, um beliebige Längen zuzulassen.

# Ubchi_Error_Key2Length
source: Key 2 must be 12-30 characters long (currently {0}). Enable '{1}' to use any length.
de: Schlüssel 2 muss 12–30 Zeichen lang sein (aktuell {0}). Aktiviere „{1}“, um beliebige Längen zuzulassen.

# Ubchi_Error_Key1Empty
source: Key 1 cannot be empty or contain only spaces
de: Schlüssel 1 darf nicht leer sein oder nur aus Leerzeichen bestehen

# Ubchi_Error_Key2Required
source: Key 2 is required for dual key mode and cannot be empty
de: Schlüssel 2 ist im Doppelschlüsselmodus erforderlich und darf nicht leer sein

# Ubchi_Error_Presentation
source: Presentation error: {0}
de: Darstellungsfehler: {0}

# Ubchi_GridVisualizationError
source: Grid visualization error
de: Fehler bei der Rasterdarstellung

# Ubchi_NullCharsAdded
source: Added null characters: {0}
de: Hinzugefügte Nullzeichen: {0}

# Ubchi_NullCharsRemoved
source: Removed null characters: {0}
de: Entfernte Nullzeichen: {0}

# Presentation_HeaderTitle
source: UBCHI CIPHER STEPS
de: ÜBCHI-CHIFFRE – SCHRITTE

# Presentation_InputInformation_Header
source: INPUT INFORMATION:
de: EINGABEINFORMATIONEN:

# Presentation_Input_Label
source: Input: {0}
de: Eingabe: {0}

# Presentation_Key_Label
source: Key: {0}
de: Schlüssel: {0}

# Presentation_Action_Label
source: Action: {0}
de: Aktion: {0}

# Presentation_EncryptionNoun
source: Encryption
de: Verschlüsselung

# Presentation_DecryptionNoun
source: Decryption
de: Entschlüsselung

# Presentation_Nulls_Label
source: Nulls: {0} (based on words in key)
de: Nullzeichen: {0} (basierend auf der Wortanzahl im Schlüssel)

# Presentation_Step1_FirstTransposition_Title
source: STEP 1: FIRST TRANSPOSITION
de: SCHRITT 1: ERSTE TRANSPOSITION

# Presentation_Step1_ReverseSecondTransposition_Title
source: STEP 1: REVERSE SECOND TRANSPOSITION
de: SCHRITT 1: RÜCKGÄNGIGMACHEN DER ZWEITEN TRANSPOSITION

# Presentation_FillBy_RowsReadByColumns
source: Fill by rows, read by columns:
de: Füllen nach Zeilen, Lesen nach Spalten:

# Presentation_FillBy_ColumnsReadByRows
source: Fill by columns, read by rows:
de: Füllen nach Spalten, Lesen nach Zeilen:

# Presentation_Result_Label
source: Result: {0}
de: Ergebnis: {0}

# Presentation_Step2_AddNulls_Title
source: STEP 2: ADD NULLS
de: SCHRITT 2: NULLZEICHEN HINZUFÜGEN

# Presentation_Step2_RemoveNulls_Title
source: STEP 2: REMOVE NULLS
de: SCHRITT 2: NULLZEICHEN ENTFERNEN

# Presentation_AddingNulls_Message
source: Adding {0} frequency-based null characters...
de: {0} häufigkeitsbasierte Nullzeichen werden hinzugefügt...

# Presentation_RemovingNulls_Message
source: Removing {0} null characters...
de: {0} Nullzeichen werden entfernt...

# Presentation_WithNulls_Label
source: With nulls: {0}
de: Mit Nullzeichen: {0}

# Presentation_WithoutNulls_Label
source: Without nulls: {0}
de: Ohne Nullzeichen: {0}

# Presentation_Step3_SecondTransposition_Title
source: STEP 3: SECOND TRANSPOSITION
de: SCHRITT 3: ZWEITE TRANSPOSITION

# Presentation_Step3_ReverseFirstTransposition_Title
source: STEP 3: REVERSE FIRST TRANSPOSITION
de: SCHRITT 3: RÜCKGÄNGIGMACHEN DER ERSTEN TRANSPOSITION

# Presentation_FinalResult_Title
source: FINAL RESULT (formatted in groups of 5):
de: ENDERGEBNIS (in Fünfergruppen formatiert):

# Presentation_ErrorUpdating
source: Error updating presentation: {0}
de: Fehler beim Aktualisieren der Darstellung: {0}

# Presentation_ReadyMessage
source: UBCHI Cipher - Ready for input...
de: ÜBCHI-Chiffre – bereit für Eingaben...
