Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/AvalancheVisualization/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# DESderivedFromMod
source: Final DES ciphertext derived from the modified input:{0}
de: Letzter DES-Geheimtext abgeleitet aus der veränderten Eingabe:{0}
ru: Окончательный шифротекст DES, полученный из измененного ввода: {0}
zh_cn: 来自修改后的输入的最终DES密文：{0}

# AESDerivedFromInit
source: {0}Final AES ciphertext derived from the initial input:{1}
de: {0}Letzter AES-Geheimtext abgeleitet aus der initialen Eingabe:{1}
ru: {0} Заключительный шифрованный текст AES, полученный из исходного ввода: {1}
zh_cn: {0}源自初始输入的最终AES密文：{1}

# AESDerivedFromMod
source: Final AES ciphertext derived from the modified input:{0}
de: Letzter AES-Geheimtext abgeleitet aus der veränderten Eingabe:{0}
ru: Заключительный шифрованный текст AES, полученный из измененного ввода: {0}
zh_cn: 来自修改后的输入的最终AES密文：{0}

# HashFunctionInitBin
source: Initial hash value (binary)
de: Initialer Hash-Wert (binär)
ru: Начальное значение хэша (двоичное)
zh_cn: 初始哈希值（二进制）

# HashFunctionModBin
source: Modified hash value (binary)
de: Veränderter Hash-Wert (binär)
ru: Измененное значение хеша (двоичное)
zh_cn: 修改后的哈希值（二进制）

source: Instructions
de: Anleitung
ru: инструкции
zh_cn: 使用说明

# InstructionsPrepDescription
source: Methods in the category "Prepared methods" are implemented within the Avalanche plugin. So the plugin can show the changes not only for the result of the cryptographic function (last step), but also for all intermediate steps.
de: Die Verfahren unter der Kategorie "Aufbereitete Verfahren" sind innerhalb des Avalanche-Plugins implementiert. Deshalb kann das Plugin nicht nur die Veränderungen beim Endergebnis der kryptografischen Funktion (letzter Schritt) anzeigen, sondern auch für alle Zwischenschritte.
ru: Методы в категории «Подготовленные методы» реализованы в плагине «Лавина». Таким образом, плагин может отображать изменения не только для результата криптографической функции (последний шаг), но и для всех промежуточных этапов.
zh_cn: 在Avalanche插件中实现了“ Prepared methods”类别中的方法。因此，该插件不仅可以显示加密功能（最后一步）的结果，还可以显示所有中间步骤的变化。

# ShowChangeTitleAES
source: Show Changed Input Data AES-
de: Anzeige veränderter Eingabedaten AES-
ru: Показать измененные входные данные AES-
zh_cn: 显示更改的输入数据AES-

# ShowChangeTitleDES
source: Show Changed Input Data DES
de: Anzeige veränderter Eingabedaten DES
ru: Показать измененные входные данные DES
zh_cn: 显示更改的输入数据DES

# Title_DES
source: Avalanche Effect DES
de: Avalanche-Effekt DES
ru: Лавинный эффект DES
zh_cn: 雪崩效应DES

source: Changed input
de: Veränderter Input
ru: Измененный вход
zh_cn: 更改输入

# OutputNotMod
source: Input not modified.
de: Eingabe nicht verändert.
ru: Вход не изменен.
zh_cn: 输入未修改。

# OutputNotModAESKey
source: AES key not modified.
de: AES-Schlüssel nicht verändert.
ru: Ключ AES не изменен.
zh_cn: AES密钥未修改。

# OutputNotModAESMsg
source: AES message not modified.
de: AES-Nachricht nicht verändert.
ru: Сообщение AES не изменено.
zh_cn: AES消息未修改。

# OutputNotModDESKey
source: DES key not modified.
de: DES-Schlüssel nicht verändert.
ru: DES ключ не изменен.
zh_cn: DES密钥未修改。

# OutputNotModDESMsg
source: DES message not modified.
de: DES-Nachricht nicht verändert.
ru: Сообщение DES не изменено.
zh_cn: DES消息未修改。

# SelectionTooltipUnprep
source: Select the method from the category "Unprepared methods" whose avalanche effect you would like to test.
de: Verfahren aus der Kategorie "Nicht-aufbereitete Verfahren" auswählen, dessen Avalanche-Effekt getestet wird.
ru: Выберите метод из категории «Неподготовленные методы», эффект лавины которого вы хотели бы протестировать.
zh_cn: 从“未准备的方法”类别中选择您要测试其雪崩效应的方法。

source: Black/white
de: Schwarz/weiß
ru: Черно-белый
zh_cn: 黑，白

source: Contrast
de: Kontrast
ru: контрастировать
zh_cn: 对比

# ContrastTooltip
source: Choose contrast for the pie chart.
de: Kontrast für das Kuchendiagramm auswählen.
ru: Выберите контраст для круговой диаграммы.
zh_cn: 为饼图选择对比度。

source: Red/green
de: Rot/grün
ru: Красный зеленый
zh_cn: 红/绿
