Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/AvalancheVisualization/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AfterRoundSubtitle
source: After round
de: Nach Runde
ru: После раунда
zh_cn: 回合后

source: Avalanche Effect
de: Avalanche-Effekt
ru: Эффект лавины
zh_cn: 雪崩效应

# AvalancheTooltip
source: Visualization of the avalanche effect in cryptographic ciphers and hash functions
de: Visualisierung des Avalanche-Effekts bei Verschlüsselungsverfahren und Hash-Funktionen
ru: Визуализация эффекта лавины в криптографических шифрах и хэш-функциях
zh_cn: 加密密码和哈希函数中雪崩效应的可视化

source: Category
de: Kategorie
ru: категория
zh_cn: 类别

# CategoryTooltip
source: Select the desired category.
de: Gewünschte Kategorie auswählen.
ru: Выберите нужную категорию.
zh_cn: 选择所需的类别。

# CheckAvalanche
source: Check avalanche effect after round ...
de: Avalanche-Effekt nach Runde ...
ru: Проверить лавинный эффект после раунда ...
zh_cn: 回合后检查雪崩效果...

# ClassicCipher
source: Classic Ciphers
de: Klassische Verschlüsselungsverfahren
ru: Классические шифры
zh_cn: 经典密码

# ClassicCipherSubtitle
source: (Classic ciphers)
de: (Klassische Verfahren)
ru: (Классические шифры)
zh_cn: （经典密码）

# ClearButton
source: Clear
de: Löschen
ru: Очистить
zh_cn: 明确

# ContinueButton
source: Continue
de: Weiter
ru: Продолжать
zh_cn: 继续

source: Decimal
de: Dezimal
ru: Десятичная дробь
zh_cn: 小数

source: DES
ru: О
zh_cn: 的

# DisplayInfo
source: Display input as:
de: Darstellung:
ru: Отображать ввод как:
zh_cn: 将输入显示为：

# DisplayInformation
source: Display input as:
de: Darstellung:
ru: Отображать ввод как:
zh_cn: 将输入显示为：

# DoneButton
source: Done
de: Fertig
ru: Готово
zh_cn: 完成了

# EncryptionInitialMsg
source: Encryption of initial message
de: Verschlüsselung initialer Nachricht
ru: Шифрование исходного сообщения
zh_cn: 初始消息的加密

# EncryptionModifiedMsg
source: Encryption of modified message
de: Verschlüsselung veränderter Nachricht
ru: Шифрование измененного сообщения
zh_cn: 修改邮件的加密

# ExplanationText
source: Input changes can be done by directly modifying the external input feed.
de: Eingabeänderungen können direkt am externen Input vorgenommen werden.
ru: Входные изменения могут быть сделаны путем непосредственного изменения внешнего входного фида.
zh_cn: 输入更改可以通过直接修改外部输入源来完成。

source: Flipped bits
de: Geflippte Bits
ru: Перевернутые биты
zh_cn: 翻转位

# GroupName
source: Test avalanche effect
de: Avalanche-Effekt testen
ru: Испытательный лавинный эффект
zh_cn: 测试雪崩效果

# HashFunction
source: Hash Functions
de: Hash-Funktionen
ru: Хэш-функции
zh_cn: 散列函数

# Hex
source: Hexadecimal
de: Hexadezimal
ru: шестнадцатеричный
zh_cn: 十六进制

# HomeTitle
source: VISUALIZATION OF THE AVALANCHE EFFECT
de: VISUALISIERUNG DES AVALANCHE-EFFEKTS
ru: ВИЗУАЛИЗАЦИЯ АВАЛЬЯННОГО ЭФФЕКТА
zh_cn: 可视化雪崩效应

source: Input Data
de: Eingabedaten
ru: Входные данные
zh_cn: 输入数据

# InputKey
source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

# InputKeyTooltip
source: Enter key
de: Schlüssel eingeben
ru: Введите ключ
zh_cn: 回车键

# InputMessage
source: Message/ Hash value
de: Nachricht/ Hash-Wert
ru: Значение Message / Hash
zh_cn: 消息/哈希值

# InputMessageTooltip
source: Enter message or hash value
de: Nachricht bzw. Hash-Wert eingeben
ru: Введите сообщение или значение хэша
zh_cn: 输入消息或哈希值

# InputTitleAES
source: Change Input Data AES-
de: Ändern der Eingabedaten AES-
ru: Изменение входных данных AES-
zh_cn: 更改输入数据AES-

# InstructionsPrep
source: Prepared methods:
de: Aufbereitete Verfahren:
ru: Подготовленные методы:
zh_cn: 准备方法：

# InstructionsPrepBullet1
source: Use key and message entries.
de: Schlüssel- und Nachricht-Eingabe nutzen.
ru: Используйте ключевые и сообщения.
zh_cn: 使用密钥和消息条目。

# InstructionsPrepBullet2
source: Provide key in hex format: 16, 24, or 32 bytes (AES) -- 8 bytes (DES).
de: Schlüssel im Hex-Format eingeben: 16, 24 oder 32 Bytes (AES) -- 8 Bytes (DES).
ru: Укажите ключ в шестнадцатеричном формате: 16, 24 или 32 байта (AES) - 8 байтов (DES).
zh_cn: 提供十六进制格式的密钥：16、24或32字节（AES）-8字节（DES）。

# InstructionsPrepBullet3
source: Input data initially shown in: Hex and binary format (AES) -- binary format (DES).
de: Dateneingaben werden zuerst wie folgt angezeigt: Hex- und Binär-Format (AES) -- Binär-Format (DES).
ru: Входные данные изначально показаны в: Hex и двоичном формате (AES) - двоичный формат (DES).
zh_cn: 输入数据最初显示为：十六进制和二进制格式（AES）-二进制格式（DES）。

# InstructionsPrepBullet4
source: Modify initial input (only effective when the screen "Change Input Data" is shown. Modifications from the external input are also not taken into account if you are already checking the avalanche effect after each round).
de: Initiale Eingabe modifizieren (wirkt nur, wenn die Maske "Ändern der Eingabe" angezeigt wird. Auch die Veränderungen an der externen Eingabe werden nicht berücksichtigt, wenn man sich bereits am Testen des Avalanche-Effekts nach jeder Runde befindet).
ru: Изменение начального ввода (действует только тогда, когда отображается экран «Изменить входные данные». Изменения с внешнего входа также не учитываются, если вы уже проверяете лавинный эффект после каждого раунда).
zh_cn: 修改初始输入（仅在显示“更改输入数据”屏幕时有效。如果已经在每个回合之后检查雪崩效果，则也不会考虑来自外部输入的修改）。

# InstructionsPrepBullet5
source: Check avalanche effect.
de: Avalanche-Effekt testen.
ru: Проверьте лавинный эффект.
zh_cn: 检查雪崩效果。

# InstructionsTitle
source: Instructions
de: Anleitung
ru: инструкции
zh_cn: 使用说明

# InstructionsUnprep
source: Unprepared methods:
de: Nicht-aufbereitete Verfahren:
ru: Неподготовленные методы:
zh_cn: 未准备的方法：

# InstructionsUnprepBullet1
source: Methods in the category "Unprepared methods" have no extra implementation within the Avalanche plugin. So the plugin evaluates the Avalanche effect only by comparing the initial and the changed external input. This is very generic. Here only the message entry is used.
de: Methoden unter der Kategorie "Nicht-aufbereitete Verfahren" sind nicht im Avalanche-Plugin implementiert. Deswegen berechnet das Plugin den Avalanche-Effekt nur aus dem Vergleich zwischen der initialen und der veränderten externen Eingabe. Dies ist sehr generisch. Hier wird nur die Nachricht-Eingabe verwendet.
ru: Методы в категории «Неподготовленные методы» не имеют дополнительной реализации в плагине «Лавина». Таким образом, плагин оценивает эффект лавины только путем сравнения исходного и измененного внешнего входа. Это очень общий характер. Здесь используется только запись сообщения.
zh_cn: “未准备的方法”类别中的方法在Avalanche插件中没有额外的实现。因此，该插件仅通过比较初始和更改后的外部输入来评估雪崩效果。这是非常通用的。这里仅使用消息条目。

# InstructionsUnprepBullet2
source: Input data initially shown in: hex format (hash functions and modern ciphers) -- text format (classic ciphers).
de: Eingabedaten werden zuerst wie folgt angezeigt: Hex-Format (moderne und Hash-Verfahren) -- Text-Format (klassische Verfahren).
ru: Входные данные изначально показаны в формате: hex (хеш-функции и современные шифры) - текстовый формат (классические шифры).
zh_cn: 最初以以下格式显示的输入数据：十六进制格式（哈希函数和现代密码）-文本格式（经典密码）。

# InstructionsUnprepBullet3
source: Modify initial input (for classic and modern ciphers, the length of the message to be evaluated by the Avalanche plugin may not be changed).
de: Initiale Eingabe modifizieren (bei klassischen und modernen Verfahren darf die Länge der modifizierten Nachricht nicht geändert werden) .
ru: Измените начальный ввод (для классических и современных шифров, длина сообщения, которое будет оцениваться плагином Avalanche, не может быть изменена).
zh_cn: 修改初始输入（对于经典和现代密码，由Avalanche插件评估的消息的长度可能不会更改）。

# InstructionsUnprepSubtitle
source: General hash functions, classic ciphers, modern ciphers
de: Hashverfahren, klassische und moderne Verschlüsselungsverfahren
ru: Общие хэш-функции, классические шифры, современные шифры
zh_cn: 通用哈希函数，经典密码，现代密码

# Intro
source: A good avalanche effect is achieved when a small change in the input results in a significant change of the encrypted text. You can select in the settings the category of the algorithm whose avalanche effect you would like to test.
de: Ein starker Avalanche-Effekt wird erreicht, wenn eine geringfügige Änderung der Eingabe zu einer signifikanten Änderung der Ausgabe führt. Sie können in den Einstellungen die Kategorie des Verfahrens auswählen, dessen Avalanche-Effekt getestet wird.
ru: Хороший эффект лавины достигается, когда небольшое изменение входного сигнала приводит к существенному изменению зашифрованного текста. Вы можете выбрать в настройках категорию алгоритма, эффект лавины которого вы хотели бы проверить.
zh_cn: 当输入的微小变化导致加密文本发生重大变化时，将获得良好的雪崩效果。您可以在设置中选择要测试其雪崩效应的算法类别。

source: Key length
de: Schlüssellänge
ru: Длина ключа
zh_cn: 键长

# KeyLengthTooltip
source: Select the key length for AES.
de: Schlüssellänge für AES auswählen.
ru: Выберите длину ключа для AES.
zh_cn: 选择AES的密钥长度。

# ModernCipher
source: Modern Ciphers
de: Moderne Verschlüsselungsverfahren
ru: Современные шифры
zh_cn: 现代密码

# OutputStream
source: Output
de: Ausgabe
ru: Вывод
zh_cn: 输出量

# OutputStreamDescription
source: Generated statistical data
de: Erzeugte statistische Daten
ru: Сгенерированные статистические данные
zh_cn: 生成统计数据

# OverviewButton
source: General Overview
de: Allgemeine Übersicht
ru: Общий обзор
zh_cn: 总体概述

# PluginCaption
source: Avalanche Visualization
de: Avalanche-Visualisierung
ru: Визуализация лавины
zh_cn: 雪崩可视化

# PreparedCaption
source: Prepared methods
de: Aufbereitete Verfahren
ru: Подготовленные методы
zh_cn: 准备方法

source: Selection
de: Auswahl
ru: выбор
zh_cn: 选拔

# SelectionTooltipPrep
source: Select the method from the category "Prepared methods" whose avalanche effect you would like to test.
de: Verfahren aus der Kategorie "Aufbereitete Verfahren" auswählen, dessen Avalanche-Effekt getestet wird.
ru: Выберите метод из категории «Подготовленные методы», эффект лавины которого вы хотели бы протестировать.
zh_cn: 从“准备的方法”类别中选择要测试其雪崩效果的方法。

# SingleBitCheckBox
source: Enable to change single bits
de: Flippen einzelner Bits
ru: Разрешить изменять отдельные биты
zh_cn: 启用更改单个位

source: Skip instructions
de: Anleitung überspringen
ru: Пропустить инструкции
zh_cn: 跳过说明

source: Text
ru: Текст
zh_cn: 文本

# Title_AES128
source: Avalanche Effect AES-128
de: Avalanche-Effekt AES-128
ru: Лавинный эффект AES-128
zh_cn: 雪崩效应AES-128

# Title_AES192
source: Avalanche Effect AES-192
de: Avalanche-Effekt AES-192
ru: Лавинный эффект AES-192
zh_cn: 雪崩效应AES-192

# Title_AES256
source: Avalanche Effect AES-256
de: Avalanche-Effekt AES-256
ru: Лавинный эффект AES-256
zh_cn: 雪崩效应AES-256

# UnpreparedCaption
source: Unprepared methods
de: Nicht-aufbereitete Verfahren
ru: Неподготовленные методы
zh_cn: 未准备好的方法

# BinaryRep
source: Binary representation
de: Binärdarstellung
ru: Бинарное представление
zh_cn: 二进制表示

source: Binary values
de: Binärwerte
ru: Двоичные значения
zh_cn: 二进制值

# ChangesText
source: Modify input in order to proceed with the presentation. Message and key changes can be made in two ways:
de: Zum Fortfahren der Präsentation verändern Sie die Eingabedaten. Nachricht- und Schlüsseländerungen können wie folgt erfolgen:
ru: Измените ввод, чтобы продолжить презентацию. Изменение сообщения и ключа может быть выполнено двумя способами:
zh_cn: 修改输入以继续演示。消息和密钥更改可以通过两种方式进行：

# ChangesTextBullet1
source: Modify external input feed directly.
de: Direkte Änderung am externen Input.
ru: Измените внешний входной канал напрямую.
zh_cn: 直接修改外部输入提要。

# ChangesTextBullet2
source: Click on single bits -- only possible after checking checkbox.
de: Änderung einzelner Bits -- nur möglich nach Checkbox-Aktivierung.
ru: Нажмите на отдельные биты - возможно только после проверки флажка.
zh_cn: 单击单个位-仅在选中复选框后才可能。

# CipherStateInitMsg
source: Encryption state of initial input
de: Verschlüsselungszustand initialer Eingabe
ru: Состояние шифрования исходного ввода
zh_cn: 初始输入的加密状态

# CipherStateModMsg
source: Encryption state of modified input
de: Verschlüsselungszustand veränderter Eingabe
ru: Состояние шифрования измененного ввода
zh_cn: 修改后的输入的加密状态

# ClickOnBits
source: Click on the bit(s) you'd like to flip.
de: Klicken Sie auf die Bits, die Sie flippen möchten.
ru: Нажмите на бит (ы), который вы хотите перевернуть.
zh_cn: 单击您想要翻转的位。

source: Flipped bits
de: Geflippte Bits
ru: Перевернутые биты
zh_cn: 翻转位

# InitialKeyHex
source: Initial key (in hex)
de: Initialer Schlüssel (hex)
ru: Начальный ключ (в шестнадцатеричном формате)
zh_cn: 初始键（十六进制）

# InitialMessageHex
source: Initial message (in hex)
de: Initiale Nachricht (hex)
ru: Исходное сообщение (в шестнадцатеричном формате)
zh_cn: 初始消息（十六进制）

source: Initial msg
de: Initiale Nachr.
ru: Первоначальный msg
zh_cn: 初始味精

source: Modified key
de: Veränderter Schlüssel
ru: Измененный ключ
zh_cn: 修改密钥

source: Modified message
de: Veränderte Nachricht
ru: Модифицированное сообщение
zh_cn: 修改后的讯息

source: Modified msg
de: Veränderte Nachr.
ru: Модифицированные сообщения
zh_cn: 修改后的味精

source: Initial key
de: Initialer Schlüssel
ru: Начальный ключ
zh_cn: 初始金钥

source: Initial message
de: Initiale Nachricht
ru: Исходное сообщение
zh_cn: 初始讯息

source: Left half
de: Linke Hälfte
ru: Левая половина
zh_cn: 左半

# NoChanges
source: No changes occurred at all!
de: Keine Veränderung hat stattgefunden!
ru: Никаких изменений не произошло!
zh_cn: 根本没有发生任何变化！

# OnlyLeft
source: Changes occurred only on the left half of the cipher!
de: Veränderungen fanden nur auf der linken Hälfte statt!
ru: Изменения произошли только в левой половине шифрования!
zh_cn: 更改仅发生在密码的左半部！

# OnlyRight
source: Changes occurred only on the right half of the cipher!
de: Veränderungen fanden nur auf der rechten Hälfte statt!
ru: Изменения произошли только в правой половине шифрования!
zh_cn: 更改仅发生在密码的右半部分！

source: Right half
de: Rechte Hälfte
ru: Правая половина
zh_cn: 右半

# StatsBullet1
source: bit flipped (out of {0}). Avalanche effect of {1}%
de: Bit geflippt (von {0}). Avalanche-Effekt von {1}%
ru: бит перевернулся (из {0}). Лавинный эффект {1}%
zh_cn: 位翻转（在{0}中）。 {1}％的雪崩效应

# StatsBullet1_Plural
source: bits flipped (out of {0}). Avalanche effect of {1}%
de: Bits geflippt (von {0}). Avalanche-Effekt von {1}%
ru: бит (из {0}). Лавинный эффект {1}%
zh_cn: 位翻转（从{0}中移出）。 {1}％的雪崩效应

# StatsBullet2
source: Length of longest identical bit sequence: {0}. Offset {1}.
de: Länge der längsten Sequenz identischer Bits: {0}. Offset {1}.
ru: Длина самой длинной идентичной последовательности бит: {0}. Смещение {1}.
zh_cn: 最长相同位序列的长度：{0}。偏移量{1}。

# StatsBullet3
source: Length of longest flipped bit sequence: {0}. Offset {1}.
de: Länge der längsten Sequenz geflippter Bits: {0}. Offset {1}.
ru: Длина самой длинной перевернутой последовательности бит: {0}. Смещение {1}.
zh_cn: 最长翻转位序列的长度：{0}。偏移量{1}。

# StatsBullet4
source: Average number of differing bits per byte: {0}
de: Durchschnittszahl unterschiedlicher Bits pro Byte: {0}
ru: Среднее количество бит в байтах: {0}
zh_cn: 每个字节的平均不同位数：{0}

# FlippedBytes
source: Changed bytes
de: Veränderte Bytes
ru: Измененные байты
zh_cn: 更改的字节

# InitialKeyColon
source: Initial key:
de: Initialer Schlüssel:
ru: Начальный ключ:
zh_cn: 初始密钥：

# InitialKeyDES
source: Initial key (64 bits):
de: Initialer Schlüssel (64 Bits):
ru: Начальный ключ (64 бит):
zh_cn: 初始密钥（64位）：

# InitialMessageColon
source: Initial message:
de: Initiale Nachricht:
ru: Исходное сообщение:
zh_cn: 初始消息：

# InitialMessageDES
source: Initial message (64 bits):
de: Initiale Nachricht (64 Bits):
ru: Исходное сообщение (64 бит):
zh_cn: 初始消息（64位）：

# InputTitleDES
source: Change Input Data DES
de: Ändern der Eingabedaten DES
ru: Изменение входных данных DES
zh_cn: 更改输入数据DES

# ModKeyColon
source: Modified key:
de: Veränderter Schlüssel:
ru: Измененный ключ:
zh_cn: 修改密钥：

# ModMessageColon
source: Modified message:
de: Veränderte Nachricht:
ru: Модифицированное сообщение:
zh_cn: 修改后的消息：

source: Unchanged bits
de: Unveränderte Bits
ru: Неизменные биты
zh_cn: 不变的位

source: Unchanged bytes
de: Unveränderte Bytes
ru: Неизменные байты
zh_cn: 不变字节

source: Binary
de: Binär
ru: двоичный
zh_cn: 二元

# Ciphertext
source: Ciphertext (hex)
de: Geheimtext (hex)
ru: Шифрованный текст (шестнадцатеричный)
zh_cn: 密文（十六进制）

# EncryptionInit
source: Encryption of init. message (bin)
de: Verschlüsselung init. Nachr (bin)
ru: Шифрование init. сообщение (bin)
zh_cn: 初始化的加密。消息（bin）

# EncryptionMod
source: Encryption of mod. message (bin)
de: Verschlüsselung ver. Nachr (bin)
ru: Шифрование мод. сообщение (bin)
zh_cn: mod的加密。消息（bin）

# HashFunctionInit
source: Initial hash value
de: Initialer Hash-Wert
ru: Начальное значение хэш-функции
zh_cn: 初始哈希值

# HashFunctionMod
source: Modified hash value
de: Veränderter Hash-Wert
ru: Измененное значение хэша
zh_cn: 修改后的哈希值

# HashFunctionSubtitle
source: (Hash functions)
de: (Hash-Funktionen)
ru: (Хэш-функции)
zh_cn: （哈希函数）

# ModernCipherSubtitle
source: (Modern ciphers)
de: (Moderne Verfahren)
ru: (Современные шифры)
zh_cn: （现代密码）

# OverviewAES128
source: Encryption Results after All Rounds of AES-128
de: Verschlüsselungsergebnisse aller Runden von AES-128
ru: Результаты шифрования после всех раундов AES-128
zh_cn: 经过所有AES-128加密后的结果

# OverviewAES192
source: Encryption Results after All Rounds of AES-192
de: Verschlüsselungsergebnisse aller Runden von AES-192
ru: Результаты шифрования после всех раундов AES-192
zh_cn: 经过所有AES-192加密后的结果

# OverviewAES256
source: Encryption Results after All Rounds of AES-256
de: Verschlüsselungsergebnisse aller Runden von AES-256
ru: Результаты шифрования после всех раундов AES-256
zh_cn: 所有AES-256加密后的加密结果

# OverviewDES
source: Encryption Results after All DES Rounds
de: Verschlüsselungsergebnisse aller DES-Runden
ru: Результаты шифрования после всех раундов DES
zh_cn: 所有DES回合后的加密结果

# Percentage
source: % changed
de: % Änderung
ru: % изменено
zh_cn: ％已更改

# PercentageFlipped
source: % of flipped bits
de: % geflippter Bits
ru: % перевернутых битов
zh_cn: 翻转位的百分比

source: Round
de: Runde
ru: Круглый
zh_cn: 回合

# AfterRound
source: After round {0}:{1}
de: Nach Runde {0}:{1}
ru: После раунда {0}: {1}
zh_cn: 回合{0}之后：{1}

# EncryptionInitialMsgOut
source: Encryption of initial input:{0}
de: Verschlüsselung der initialen Eingabe:{0}
ru: Шифрование исходного ввода: {0}
zh_cn: 初始输入的加密：{0}

# EncryptionModifiedlMsgOut
source: Encryption of modified input:{0}
de: Verschlüsselung der veränderten Eingabe:{0}
ru: Шифрование измененного ввода: {0}
zh_cn: 修改后的输入的加密：{0}

# InitialHashOutput
source: Initial hash value:{0}
de: Initialer Hash-Wert:{0}
ru: Начальное значение хеша: {0}
zh_cn: 初始哈希值：{0}

# ModHashOutput
source: Modified hash value:{0}
de: Veränderter Hash-Wert:{0}
ru: Измененное значение хеша: {0}
zh_cn: 修改后的哈希值：{0}

source: Output
ru: Вывод
zh_cn: 输出量

# OutputInitialDESKey
source: Initial DES key:{0}
de: Initialer DES-Schlüssel:{0}
ru: Начальный ключ DES: {0}
zh_cn: 初始DES密钥：{0}

# OutputInitialDESMsg
source: Initial DES message:{0}
de: Initiale DES-Nachricht:{0}
ru: Начальное сообщение DES: {0}
zh_cn: 初始DES消息：{0}

# OutputModifiedDESKey
source: Modified DES key:{0}
de: Veränderter DES-Schlüssel:{0}
ru: Измененный ключ DES: {0}
zh_cn: 修改后的DES密钥：{0}

# OutputModifiedDESMsg
source: Modified DES message:{0}
de: Veränderte DES-Nachricht:{0}
ru: Измененное сообщение DES: {0}
zh_cn: 修改后的DES消息：{0}

# OutputStats1
source: Flipped bits: {0}. Avalanche effect: {1}%{2}
de: Geflippte Bits: {0}. Avalanche-Effekt: {1}%{2}
ru: Перевернутые биты: {0}. Эффект лавины: {1}% {2}
zh_cn: 翻转位：{0}。雪崩效应：{1}％{2}

# OutputStats2
source: Length of longest identical bit sequence: {0}. Offset: {1}.{2}
de: Länge der längsten Sequenz identischer Bits: {0}. Offset: {1}.{2}
ru: Длина самой длинной идентичной последовательности бит: {0}. Смещение: {1}. {2}
zh_cn: 最长相同位序列的长度：{0}。偏移量：{1}。{2}

# OutputStats3
source: Length of longest flipped bit sequence: {0}. Offset: {1}.{2}
de: Länge der längsten Sequenz geflippter Bits: {0}. Offset: {1}.{2}
ru: Длина самой длинной перевернутой последовательности бит: {0}. Смещение: {1}. {2}
zh_cn: 最长翻转位序列的长度：{0}。偏移量：{1}。{2}

# OutputStatsClassic1
source: Changed bytes: {0}. Avalanche effect: {1}% {2}
de: Veränderte Bytes: {0}. Avalanche-Effekt: {1}%{2}
ru: Измененные байты: {0}. Эффект лавины: {1}% {2}
zh_cn: 更改的字节：{0}。雪崩效应：{1}％{2}

# OutputStatsClassic2
source: Length of longest identical byte sequence: {0}. Offset {1}.{2}
de: Länge der längsten Sequenz identischer Bytes: {0}. Offset: {1}.{2}
ru: Длина самой длинной идентичной последовательности байтов: {0}. Смещение {1}. {2}
zh_cn: 最长相同字节序列的长度：{0}。偏移量{1}。{2}

# OutputStatsClassic3
source: Length of longest changed byte sequence: {0}. Offset {1}.{2}
de: Länge der längsten Sequenz veränderter Bytes: {0}. Offset: {1}.{2}
ru: Длина самой длинной измененной последовательности байтов: {0}. Смещение {1}. {2}
zh_cn: 最长更改的字节序列的长度：{0}。偏移量{1}。{2}

# OutputTooltip
source: Generated data
de: Erzeugte Daten
ru: Сгенерированные данные
zh_cn: 产生的数据

# StatsClassicBullet1
source: byte changed (out of {0}). Avalanche effect of {1}%
de: Byte verändert (von {0}). Avalanche-Effekt von {1}%
ru: байт изменен (из {0}). Лавинный эффект {1}%
zh_cn: 字节已更改（在{0}中）。 {1}％的雪崩效应

# StatsClassicBullet1_Plural
source: bytes changed (out of {0}). Avalanche effect of {1}%
de: Bytes verändert (von {0}). Avalanche-Effekt von {1}%
ru: байты изменены (из {0}). Лавинный эффект {1}%
zh_cn: 字节已更改（在{0}中）。 {1}％的雪崩效应

# StatsClassicBullet2
source: Length of longest identical byte sequence: {0}. Offset {1}.
de: Länge der längsten Sequenz identischer Bytes: {0}. Offset {1}.
ru: Длина самой длинной идентичной последовательности байтов: {0}. Смещение {1}.
zh_cn: 最长相同字节序列的长度：{0}。偏移量{1}。

# StatsClassicBullet3
source: Length of longest changed byte sequence: {0}. Offset {1}.
de: Länge der längsten Sequenz veränderter Bytes: {0}. Offset {1}.
ru: Длина самой длинной измененной последовательности байтов: {0}. Смещение {1}.
zh_cn: 最长更改的字节序列的长度：{0}。偏移量{1}。

# Warning
source: Modified message ({0} characters) must be as long as the initial message ({1} characters).
de: Modifizierte Nachricht ({0} Zeichen) muss genauso lang sein wie die initiale Nachricht ({1} Zeichen).
ru: Модифицированное сообщение ({0} символов) должно быть таким же, как и начальное сообщение ({1} символов).
zh_cn: 修改后的消息（{0}个字符）必须与初始消息（{1}个字符）一样长。

# KeyLength128
source: Key must have 16 bytes.
de: Schlüssel muss 16 Bytes haben.
ru: Ключ должен иметь 16 байт.
zh_cn: 密钥必须具有16个字节。

# KeyLength192
source: Key must have 24 bytes.
de: Schlüssel muss 24 Bytes haben.
ru: Ключ должен содержать 24 байта.
zh_cn: 密钥必须具有24个字节。

# KeyLength256
source: Key must have 32 bytes.
de: Schlüssel muss 32 Bytes haben.
ru: Ключ должен иметь 32 байта.
zh_cn: 密钥必须具有32个字节。

# KeyLengthDES
source: Key must have 8 bytes.
de: Schlüssel muss 8 Bytes haben.
ru: Ключ должен иметь 8 байтов.
zh_cn: 密钥必须具有8个字节。

# University
source: University of Mannheim
de: Universität Mannheim
ru: Университет Мангейма
zh_cn: 曼海姆大学

# End
source: End of presentation!
de: Ende der Präsentation!
ru: Конец презентации!
zh_cn: 演示结束！

# OutputInitialAESKey
source: Initial AES key:{0}
de: Initialer AES-Schlüssel:{0}
ru: Начальный ключ AES: {0}
zh_cn: 初始AES密钥：{0}

# OutputInitialAESMsg
source: Initial AES message:{0}
de: Initiale AES-Nachricht:{0}
ru: Исходное сообщение AES: {0}
zh_cn: 初始AES消息：{0}

# OutputModifiedAESKey
source: Modified AES key:{0}
de: Veränderter AES-Schlüssel:{0}
ru: Измененный ключ AES: {0}
zh_cn: 修改后的AES密钥：{0}

# OutputModifiedAESMsg
source: Modified AES message:{0}
de: Veränderte AES-Nachricht:{0}
ru: Модифицированное сообщение AES: {0}
zh_cn: 修改后的AES消息：{0}

# DESderivedFromInit
source: {0}Final DES ciphertext derived from the initial input:{1}
de: {0}Letzter DES-Geheimtext abgeleitet aus der initialen Eingabe:{1}
ru: {0} Конечный шифротекст DES, полученный из исходного ввода: {1}
zh_cn: {0}源自初始输入的最终DES密文：{1}
