Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/KasiskiTest/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: Kasiski's Test
de: Kasiski-Test
ru: Тест Касиски
zh_cn: 霞关的测验

# PluginTooltip
source: Calculates possible key lengths of a polyalphabetic substitution cipher
de: Analysiert den eingegebenen Vigenère-Geheimtext und gibt die wahrscheinlichen Schlüssellängen aus
ru: Вычисляет возможные длины ключей полиалфавитного шифрования замещения
zh_cn: 计算多字母替换密码的可能密钥长度

# StringInputCaption
source: The string to be analyzed
de: Eingabe des Geheimtextes
ru: Строка, подлежащая анализу
zh_cn: 要分析的字符串

# StringInputTooltip
source: The input string should be a ciphertext encrypted with the Vigenère cipher.
de: Eingabe des zu analysierenden Vigenère-Geheimtextes
ru: Входная строка должна быть шифрованным ключом, зашифрованным с помощью шифрования Vigenère.
zh_cn: 输入的字符串应该是使用Vigenère密码加密的密文。

# IntegerArrayCaption
source: Integer Array
de: Schlüssellängen
ru: Целочисленный массив
zh_cn: 整数数组

# IntegerArrayTooltip
source: An array containing proposed keylengths as integers. Used by the Vigenère Analyzer.
de: Eine Zahlenliste mit wahrscheinlichen Schlüssellängen (wird als Eingabe für das Plugin "Vigenère Analyse" verwendet).
ru: Массив, содержащий предложенные ключевые строки как целые числа. Используется анализатором Vigenère.
zh_cn: 包含建议的密钥长度作为整数的数组。 Vigenère分析仪使用。

# StringOutputCaption
source: Multiples of the keylength and the amount of times they are encountered.
de: Vielfache der Schlüssellänge und ihre jeweilige Auftrittshäufigkeit.
ru: Умножает длину ключа и количество раз, когда они встречаются.
zh_cn: 密钥长度及其遇到的次数的倍数。

# StringOutputTooltip
source: Keylength is either the most common factor, or a multiple of it.
de: Die Schlüssellänge ist entweder der am häufigsten auftretende gemeinsame Faktor oder ein Vielfaches davon.
ru: Keylength является либо самым распространенным фактором, либо кратным ему.
zh_cn: 密钥长度是最常见的因素，或者是其倍数。

# CaseSensitivityCaption
source: Case Sensitivity
de: Groß-/Kleinschreibung
ru: Чувствительность корпуса
zh_cn: 区分大小写

# CaseSensitivityTooltip
source: Is a==A? Please pay attention to the alphabet used in the given ciphertext as well as the 'Case Sensitivity' of the applied Vigenère cipher.
de: Sollen Groß- und Kleinbuchstaben gleich behandelt werden? Bitte das benutzte Alphabet beachten.
ru: Является ли == A? Обращаем внимание на алфавит, используемый в данном зашифрованном тексте, а также на «Чувствительность к регистру» применяемого шифра Vigenère.
zh_cn: 是a == A吗？请注意给定密文中使用的字母以及所应用的Vigenère密码的“大小写敏感性”。

# FactorSizeCaption
source: Maximum Factor Size
de: Maximale Schlüssellänge
ru: Максимальный размер фактора
zh_cn: 最大因子大小

# FactorSizeTooltip
source: Enter maximum factor/key size to be examined. default = 20
de: Geben Sie eine obere Schranke für die Schlüssellänge an (Default: 20).
ru: Введите максимальный коэффициент / размер ключа для изучения. default = 20
zh_cn: 输入要检查的最大因子/密钥大小。默认值= 20

# GrammLengthCaption
source: Gram length
de: Maximale N-Gramm-Länge
ru: Длина града
zh_cn: 克长度

# GrammLengthTooltip
source: Enter maximum gram length to be examined. Minimum/default = 3
de: Geben Sie die maximale Länge der N-Gramme an, nach denen der Geheimtext untersucht wird (Minimum und Default: 3).
ru: Введите максимальную длину града для проверки. Минимум / по умолчанию = 3
zh_cn: 输入要检查的最大克长度。最小值/默认值= 3

# RemoveUnknownSymbolsCaption
source: Handling of unknown characters
de: Behandlung ungültiger Zeichen
ru: Обработка неизвестных символов
zh_cn: 处理未知字符

# RemoveUnknownSymbolsTooltip
source: What should be done with encountered characters at the input which are not in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
ru: Что нужно делать с встречающимися символами на входе, которые не находятся в алфавите?
zh_cn: 如果输入中遇到的字符不是字母，该怎么办？

# CaseSensitivityList1
source: Yes 'a' should equal 'A'
de: Groß-/Kleinschreibung nicht beachten
ru: Да 'a' должен быть равен 'A'
zh_cn: 是的，“ a”应等于“ A”

# CaseSensitivityList2
source: No 'a' should not equal 'A'
de: Groß-/Kleinschreibung beachten
ru: Нет 'a' не должен равняться 'A'
zh_cn: 没有“ a”不应该等于“ A”

# RemoveUnknownSymbolsList1
source: Ignore (leave unmodified)
de: nicht entfernen
ru: Игнорировать (оставить без изменений)
zh_cn: 忽略（保留未修改的内容）

# RemoveUnknownSymbolsList2
source: Remove
de: entfernen
ru: Удалить
zh_cn: 去掉

# Label1Desc
source: Frequency of factors composing the distances
de: Häufigkeit der Faktoren, aus denen sich die Distanzen
ru: Частота факторов, составляющих расстояния
zh_cn: 构成距离的因素的频率

# Label2Desc
source: between identical strings in the ciphertext
de: identischer Zeichenfolgen im Geheimtext zusammensetzen
ru: между идентичными строками в зашифрованном тексте
zh_cn: 密文中相同字符串之间

# TooltipDesc
source: Tip: The keylength could be one of the most frequent factors or a multiple
de: Hinweis: Die Schlüssellänge ist wahrscheinlich einer der am häufigsten auftretenden Faktoren oder ein Vielfaches davon.
ru: Совет. Длина ключа может быть одним из наиболее часто встречающихся факторов или нескольких
zh_cn: 提示：密钥长度可能是最常见的因素之一，也可能是倍数

source: Number of hits for the corresponding factor
de: Anzahl der Treffer für den zugehörigen Faktor
ru: Количество обращений за соответствующим фактором
zh_cn: 对应因子的点击数
