Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Primes/Primes/Resources/lang/WpfControls/Generation/PrimesGeneration.*.resx
Languages: de

# ntimesm_btnCancel
source: Cancel
de: Abbrechen

# ntimesm_btnExecute
source: Execute
de: Generieren

# ntimesm_digits
source: digits
de: Stellen

# ntimesm_errordigits
source: More than {0} digits are not allowed.
de: Mehr als {0} Stellen sind nicht erlaubt.

# ntimesm_input
source: Input
de: Eingabe

# ntimesm_numbers
source: numbers with
de: Zahlen mit

# polynomrange_btnCancel
source: Cancel
de: Abbrechen

# polynomrange_btnExecute
source: Execute
de: Ausführen

# polynomrange_choosevaluesrnd
source: Choose random values for x
de: Wert für x zufällig bestimmen

# polynomrange_foreachformulars
source: For each function
de: Für jedes Polynom

# polynomrange_numberofcalculations
source: Number of calculations
de: Berechnungen pro Durchgang

# polynomrange_numberofformulars
source: Number of functions
de: Anzahl der Funktionen

# polynom_values
source: Values for x
de: Werte für x

# isNotPrime
source: not a prime number
de: keine Primzahl

# isPrime
source: prime number
de: Primzahl

# rnd10100
source: 10 x 100 digits
de: 10 x 100-stellig

# rnd1020
source: 10 x 20 digits
de: 10 x 20-stellig

# rnd1050
source: 10 x 50 digits
de: 10 x 50-stellig

# rndntimesm
source: n x m digits
de: n x m-stellig

# rndPrimes
source: Create random primes in the range...
de: Zufällige Primzahl erzeugen im Bereich...

# rndQuadratic
source: Quadratic polynomials for generating primes
de: Quadratische Polynome zur Erzeugung von Primzahlen

# rndQuadraticEuler
source: Test Euler's polynomial
de: Eulers Polynom testen

# rndQuadraticFormular
source: Test a particular polynomial
de: Spezielles Polynom testen

# rndQuadraticRnd
source: Test random polynomials
de: Zufällige Polynome testen

# rndQuadraticSystematic
source: Test polynomials systematically
de: Polynome systematisch testen

# statAvgCountPrimes
source: The average number of primes is {0} ({1}%).
de: Die durchschnittliche Anzahl der Primzahlen beträgt {0} ({1}%).

# statFunctionsLeast
source: Functions that generated the least number of primes:
de: Funktion(en), die als Funktionswert die wenigsten Primzahlen lieferten, sind:

# statFunctionsLeastInterval
source: Functions that generated the least number of primes in the interval:
de: Funktion(en), die als Funktionswert die wenigsten Primzahlen in diesem Wertebereich lieferten, sind:

# statFunctionsMost
source: Functions that generated the most number of primes:
de: Funktion(en), die als Funktionswert die meisten Primzahlen lieferten, sind:

# statFunctionsMostInterval
source: Functions that generated the most number of primes in the interval:
de: Funktion(en), die als Funktionswert die meisten Primzahlen in diesem Wertebereich lieferten, sind:

# statFunctionsMostMisc
source: Functions that generated the most number of different primes:
de: Funktion(en), die als Funktionswert die meisten verschiedenen Primzahlen lieferten, sind:

# statFunctionsMostMiscInterval
source: Functions that generated the most number of different primes in the interval:
de: Funktion(en), die als Funktionswert die meisten verschiedenen Primzahlen in diesem Wertebereich lieferten, sind:

# statGenerated
source: {0} different primes were generated, {2} total ({1} %).
de: Insgesamt {0} verschiedene Primzahlen erzeugt, {2} gesamt ({1} %).

# statGeneratedAbsolut
source: {1} out of {0} numbers are prime numbers ({2}%).
de: Von {0} Zahlen sind {1} Primzahlen ({2}%).

# statRnd
source: {0} functions were examined
de: Es wurden {0} Funktionen untersucht.

# statRndInterval
source: {0} functions in the interval [{1}, {2}] were examined
de: Es wurden {0} Funktionen im Wertebereich x aus [{1}, {2}] untersucht.

# statNonPrimes
source: No more prime numbers found
de: Es wurden keine weiteren Primzahlen gefunden.

# soa_generateprimesto
source: Generate all primes to
de: alle Primzahlen erechnen bis

# soa_actualnumber
source: Consider the number {0}.
de: Betrachte die Zahl {0}.

# soa_firstifmatch
source: {0} mod 60 = {1}. Search all solutions of 4 * xݙ + yݙ = {2}.
de: {0} mod 60 = {1}. Suche alle Lösungen von 4 * x² + y² = {2}.

# soa_firstsolutionfound
source: Found a solution. 4 * {0}ݙ + {1}ݙ = {2}. Mark {3} as {4}.
de: Eine Lösung wurde gefunden. 4 * {0}² + {1}² = {2}. Markiere {3} als {4}.

# soa_initvsieve
source: All numbers from 1 to {0} are marked as non-primes.
de: Alle Zahlen von 1 bis {0} werden als nicht-prim markiert.

# soa_isnotprime
source: "is not a prime number"
de: "ist keine Primzahl"

# soa_isprime
source: "is a prime number"
de: "ist eine Primzahl"

# soa_secondifmatch
source: {0} mod 60 = {1}. Search all solutions of 3 * xݙ + yݙ = {2}.
de: {0} mod 60 = {1}. Suche alle Lösungen von 3 * x² + y² = {2}.

# soa_secondsolutionfound
source: Found a solution. 3 * {0}ݙ + {1}ݙ = {2}. Mark {3} as {4}.
de: Eine Lösung wurde gefunden. 3 * {0}² + {1}² = {2}. Markiere {3} als {4}.

# soa_startsieve
source: Start sieving. Consider numbers mod 60.
de: Das Sieb wird gestartet. Alle Zahlen werden mod 60 betrachtet.

# soa_thirdifmatch
source: {0} mod 60 = {1}. Search all solutions of 3 * xݙ - yݙ = {2}.
de: {0} mod 60 = {1}. Suche alle Lösungen von 3 * x² - y² = {2}.

# soa_thirdsolutionfound
source: Found a solution. 3 * {0}ݙ - {1}ݙ = {2}. Mark {3} as {4}.
de: Eine Lösung wurde gefunden. 3 * {0}² - {1}² = {2}. Markiere {3} als {4}.

# soa_fithsolutionfound
source: {0} is a multiple of {1} and thus not a prime.
de: {0} ist ein Vielfaches von {1} und darum keine Primzahl.

# soa_fourthsolutionfound
source: {0} was identified as a prime. Remove multiples of {1}.
de: {0} wurde als Primzahl identifiziert. Entferne alle Vielfachen von {1}.

# polynomname_polynom
source: Enter coefficients of a particular polynomial
de: Eingabe der Koeffizienten für ein Polynom

# polynomname_polynomeuler
source: Enter parameters for Euler's polynomial
de: Eingabe der Parameter für Eulers Polynom

# polynomname_polynomrnd
source: Enter parameters for the random polynomials
de: Eingabe der Parameter für zufällige Polynome

# polynomname_polynomsyst
source: Enter parameters for the systematic test
de: Eingabe der Parameter für den systematischen Test
