Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/M209/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# ActionCaption
source: Action
de: Aktion
ru: действие
zh_cn: 行动

# ActionList1
source: Encrypt
de: Verschlüsselung
ru: шифровать
zh_cn: 加密

# ActionList2
source: Decrypt
de: Entschlüsselung
ru: расшифровывать
zh_cn: 解密

# ActionTooltip
source: Select the Algorithm action
de: Wählen Sie die Betriebsart des Plugins.
ru: Выберите действие «Алгоритм»
zh_cn: 选择算法动作

# Bar10Caption
source: Bar #10
de: Stange 10
ru: Бар №10
zh_cn: 酒吧＃10

# Bar10Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar11Caption
source: Bar #11
de: Stange 11
ru: Бар №11
zh_cn: 酒吧＃11

# Bar11Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar12Caption
source: Bar #12
de: Stange 12
ru: Бар №12
zh_cn: 12号酒吧

# Bar12Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar13Caption
source: Bar #13
de: Stange 13
ru: Бар №13
zh_cn: 酒吧＃13

# Bar13Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar14Caption
source: Bar #14
de: Stange 14
ru: Бар №14
zh_cn: 酒吧＃14

# Bar14Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar15Caption
source: Bar #15
de: Stange 15
ru: Бар №15
zh_cn: 15号酒吧

# Bar15Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar16Caption
source: Bar #16
de: Stange 16
ru: Бар №16
zh_cn: 16号酒吧

# Bar16Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar17Caption
source: Bar #17
de: Stange 17
ru: Бар №17
zh_cn: 酒吧＃17

# Bar17Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar18Caption
source: Bar #18
de: Stange 18
ru: Бар №18
zh_cn: 酒吧＃18

# Bar18Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar19Caption
source: Bar #19
de: Stange 19
ru: Бар №19
zh_cn: 酒吧＃19

# Bar19Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar1Caption
source: Bar #1
de: Stange 1
ru: Бар №1
zh_cn: 酒吧＃1

# Bar1Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar20Caption
source: Bar #20
de: Stange 20
ru: Бар №20
zh_cn: 酒吧＃20

# Bar20Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar21Caption
source: Bar #21
de: Stange 21
ru: Бар №21
zh_cn: 酒吧＃21

# Bar21Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar22Caption
source: Bar #22
de: Stange 22
ru: Бар №22
zh_cn: 酒吧＃22

# Bar22Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar23Caption
source: Bar #23
de: Stange 23
ru: Бар № 23
zh_cn: 酒吧＃23

# Bar23Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar24Caption
source: Bar #24
de: Stange 24
ru: Бар №24
zh_cn: 酒吧＃24

# Bar24Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar25Caption
source: Bar #25
de: Stange 25
ru: Бар №25
zh_cn: 酒吧＃25

# Bar25Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar26Caption
source: Bar #26
de: Stange 26
ru: Бар №26
zh_cn: 酒吧＃26

# Bar26Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar27Caption
source: Bar #27
de: Stange 27
ru: Бар №27
zh_cn: 酒吧＃27

# Bar27Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar2Caption
source: Bar #2
de: Stange 2
ru: Бар №2
zh_cn: 酒吧＃2

# Bar2Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar3Caption
source: Bar #3
de: Stange 3
ru: Бар №3
zh_cn: 酒吧＃3

# Bar3Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar4Caption
source: Bar #4
de: Stange 4
ru: Бар №4
zh_cn: 酒吧＃4

# Bar4Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar5Caption
source: Bar #5
de: Stange 5
ru: Бар №5
zh_cn: 酒吧＃5

# Bar5Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar6Caption
source: Bar #6
de: Stange 6
ru: Бар №6
zh_cn: 酒吧＃6

# Bar6Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar7Caption
source: Bar #7
de: Stange 7
ru: Бар №7
zh_cn: 7号酒吧

# Bar7Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar8Caption
source: Bar #8
de: Stange 8
ru: Бар №8
zh_cn: 酒吧＃8

# Bar8Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# Bar9Caption
source: Bar #9
de: Stange 9
ru: Бар №9
zh_cn: 酒吧＃9

# Bar9Tooltip
source: Please activate Slider, e.g. 24
de: Positionen der Schieber, z.B. 24
ru: Включите слайдер, например, 24
zh_cn: 请激活滑块，例如24

# BarGroup
source: Lug positions
de: Schieberpositionen
ru: Позиции Луга
zh_cn: 吊耳位置

# BlockCaption
source: Format output in blocks
de: Ausgabe in 5er-Blöcken
ru: Форматирование вывода в блоках
zh_cn: 格式化输出块

# BlockTooltip
source: Format the output of the component in blocks of 5 characters?
de: Soll die Textausgabe der Komponente in Blöcken von 5 Zeichen formatiert werden?
ru: Отформатировать вывод компонента в блоках по 5 символов?
zh_cn: 将组件的输出格式化为5个字符的块？

# CaseHandlingCaption
source: Case handling
de: Groß-/Kleinschreibung
ru: Обработка корпуса
zh_cn: 案件处理

# CaseHandlingList1
source: Preserve case
de: Keine Änderung
ru: Запасной корпус
zh_cn: 保留大小写

# CaseHandlingList2
source: Convert to upper
de: In Großbuchstaben konvertieren
ru: Преобразовать в верхнюю
zh_cn: 转换为上

# CaseHandlingList3
source: Convert to lower
de: In Kleinbuchstaben konvertieren
ru: Преобразовать в нижний
zh_cn: 转换为较低

# CaseHandlingTooltip
source: What should be done with upper and lower case letters?
de: Wie sollen Groß- und Kleinbuchstaben behandelt werden?
ru: Что нужно делать с помощью строчных и строчных букв?
zh_cn: 大写和小写字母应该怎么做？

# FormattedCheckCaption
source: Output key sheet
de: Ausgabe des Schlüsselblattes
ru: Выходной ключ
zh_cn: 输出按键表

# FormattedCheckTooltip
source: If this checkbox is activated, a formatted key sheet for the internal key is sent to the "Key Check" output along with the control value. Otherwise, only the control value is output.
de: Wenn dieses Kontrollkästchen aktiviert ist, wird am Ausgang "Schlüsseltest" neben dem Kontrollwert auch der interne Schlüssel in formatierter Form ausgegeben. Sonst wird nur der Kontrollwert ausgegeben.
ru: Если этот флажок активирован, отформатированный ключевой лист для внутреннего ключа отправляется на вывод «Проверка ключа» вместе с контрольным значением. В противном случае выводится только управляющее значение.
zh_cn: 如果激活此复选框，则将内部键的格式化键表连同控制值一起发送到“键检查”输出。否则，仅输出控制值。

# InputInternalKeyCaption
source: Input internal key
de: Eingabe interner Schlüssel
ru: Входной внутренний ключ
zh_cn: 输入内部键

# InputInternalKeyTooltip
source: Input of the internal key, consisting of a string of the comma-separated positions of the active rotor pins and the positions of the lugs.
de: Eingabe des internen Schlüssels, der aus einer durch Komma getrennten Aufzählung der Positionen der aktiven Stifte und den Positionen der Schieber besteht.
ru: Ввод внутреннего ключа, состоящий из строки разделенных запятыми позиций контактов активного ротора и положений выступов.
zh_cn: 内部键的输入，由活动转子销的逗号分隔位置和接线片位置组成。

# KeyCheckCaption
source: Key Check
de: Schlüsseltest
ru: Проверка ключа
zh_cn: 密钥检查

# KeyCheckTooltip
source: The plaintext consisting of 26 letters 'A' is encrypted with the external key 'AAAAAA'. The resulting ciphertext is used to check the correctness of the internal key.
de: Der Klartext bestehend aus 26 'A' wird mit dem externen Schlüssel 'AAAAAA' verschlüsselt. Der entstehende Geheimtext wird zur Kontrolle des internen Schlüssels verwendet.
ru: Открытый текст, состоящий из 26 букв «A», зашифровывается внешним ключом «AAAAAA». Полученный зашифрованный текст используется для проверки правильности внутреннего ключа.
zh_cn: 由26个字母“ A”组成的明文用外部密钥“ AAAAAA”加密。生成的密文用于检查内部密钥的正确性。

# ModelCaption
source: Model
de: Modell
ru: Модель
zh_cn: 模型

# ModelList1
source: 6 Rotors
de: 6 Rotoren
ru: 6 Роторы
zh_cn: 6个转子

# ModelList2
source: 5 Rotors
de: 5 Rotoren
ru: 5 роторов
zh_cn: 5个转子

# ModelTooltip
source: Choose the machine model.
de: Modell
ru: Выберите модель машины.
zh_cn: 选择机器型号。

# OutputInternalKeyCaption
source: Output internal key
de: Ausgabe interner Schlüssel
ru: Внутренний ключ выхода
zh_cn: 输出内部键

# OutputInternalKeyTooltip
source: Output of the internal key, consisting of the active rotor pins and the positions of the lugs on the bars.
de: Ausgabe des internen Schlüssels, der aus den aktiven Stiften der Rotoren und den Positionen der Schieber auf den Stangen besteht.
ru: Выход внутреннего ключа, состоящий из активных штифтов ротора и положений выступов на стержнях.
zh_cn: 内部钥匙的输出，包括活动的转子销和凸耳在凸耳上的位置。

# OutputStringCaption
source: Text output
de: Textausgabe
ru: Вывод текста
zh_cn: 文字输出

# OutputStringTooltip
source: The string after processing with the M-209 cipher
de: Der mit der M-209-Chiffre verschlüsselte oder entschlüsselte Text
ru: Строка после обработки с помощью шифрования M209
zh_cn: 使用M209密码处理后的字符串

# PluginTooltip
source: Classic Cipher Machine from the 2nd World War (USA)
de: Verschlüsselungsmaschine, die vom US-Militär im Zweiten Weltkrieg benutzt wurde
ru: Classic Cipher Machine от 2-й мировой войны (США)
zh_cn: 第二次世界大战的经典密码机（美国）

# RandomKeyCaption
source: Generate internal key
de: Generiere internen Schlüssel
ru: Создание внутреннего ключа
zh_cn: 产生内部金钥

# RandomKeyGroup
source: Internal key
de: Interner Schlüssel
ru: Внутренний ключ
zh_cn: 内部钥匙

# RandomKeyTooltip
source: Press this button to generate a random internal key consisting of the positions of the pins and the lugs.
de: Klicken Sie auf diese Schaltfläche, um einen zufälligen internen Schlüssel (bestehend aus den Positionen der Stifte und der Schieber) zu generieren.
ru: Нажмите эту кнопку, чтобы создать случайный внутренний ключ, состоящий из положений контактов и выступов.
zh_cn: 按下此按钮可生成一个随机的内部键，该内部键由引脚和接线片的位置组成。

# Rotor1Caption
source: Rotor #1
ru: Ротор №1
zh_cn: 1号转子

# Rotor1Tooltip
source: Please write all Active Pins, e.g. ABCD.
de: Geben Sie die aktiven Stifte an, z.B. ABCD
ru: Пожалуйста, напишите все активные контакты, например ABCD.
zh_cn: 请写所有活动引脚，例如ABCD。

# Rotor2Caption
source: Rotor #2
ru: Ротор №2
zh_cn: 2号转子

# Rotor2Tooltip
source: Please write all Active Pins, e.g. ABCD
de: Geben Sie die aktiven Stifte an, z.B. ABCD
ru: Пожалуйста, напишите все активные контакты, например, ABCD
zh_cn: 请写所有活动引脚，例如ABCD

# Rotor3Caption
source: Rotor #3
ru: Ротор №3
zh_cn: 3号转子

# Rotor3Tooltip
source: Please write all Active Pins, e.g. ABCD
de: Geben Sie die aktiven Stifte an, z.B. ABCD
ru: Пожалуйста, напишите все активные контакты, например, ABCD
zh_cn: 请写所有活动引脚，例如ABCD

# Rotor4Caption
source: Rotor #4
ru: Ротор №4
zh_cn: 4号转子

# Rotor4Tooltip
source: Please write all Active Pins, e.g. ABCD
de: Geben Sie die aktiven Stifte an, z.B. ABCD
ru: Пожалуйста, напишите все активные контакты, например, ABCD
zh_cn: 请写所有活动引脚，例如ABCD

# Rotor5Caption
source: Rotor #5
ru: Ротор №5
zh_cn: 5号转子

# Rotor5Tooltip
source: Please write all Active Pins, e.g. ABCD
de: Geben Sie die aktiven Stifte an, z.B. ABCD
ru: Пожалуйста, напишите все активные контакты, например, ABCD
zh_cn: 请写所有活动引脚，例如ABCD

# Rotor6Caption
source: Rotor #6
ru: Ротор №6
zh_cn: 6号转子

# Rotor6Tooltip
source: Please write all Active Pins, e.g. ABCD
de: Geben Sie die aktiven Stifte an, z.B. ABCD
ru: Пожалуйста, напишите все активные контакты, например, ABCD
zh_cn: 请写所有活动引脚，例如ABCD

# StartwertCaption
source: Key (Initial rotor setting)
de: Schlüssel (Grundstellung der Rotorscheiben)
ru: Ключ (начальная установка ротора)
zh_cn: 键（初始转子设置）

# StartwertTooltip
source: Please provide the initial rotor setting for each rotor, e.g. ABCDEF
de: Bitte geben Sie die Grundstellung der Rotorscheiben an, z.B. ABCDEF
ru: Пожалуйста, предоставьте начальную настройку ротора для каждого ротора, например, ABCDEF
zh_cn: 请提供每个转子的初始转子设置，例如ABCDEF

# TextCaption
source: Text Input
de: Texteingabe
ru: Ввод текста
zh_cn: 文字输入

# TextOptionsGroup
source: Text options
de: Text-Optionen
ru: Параметры текста
zh_cn: 文字选项

# TextTooltip
source: Input Text
ru: Входной текст
zh_cn: 输入文本

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Behandlung ungültiger Zeichen
ru: Неизвестная обработка символов
zh_cn: 未知符号处理

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (nicht ändern)
ru: Игнорировать (оставить без изменений)
zh_cn: 忽略（保留未修改的内容）

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen
ru: Удалить
zh_cn: 去掉

# UnknownSymbolHandlingList3
source: Replace with 'X'
de: Ersetzen durch 'X'
ru: Заменить на «X»
zh_cn: 替换为“ X”

# UnknownSymbolHandlingTooltip
source: What should be done with input characters which are not in the plaintext alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Klartext-Alphabets sind?
ru: Что нужно делать с входными символами, которые не находятся в алфавите простого текста?
zh_cn: 非明文字母中的输入字符应该怎么做？

# WheelGroup
source: Pin positions
de: Stiftpositionen
ru: Позиции контактов
zh_cn: 引脚位置

# ZSpaceCaption
source: Replace space with 'Z'
de: Ersetze Leerzeichen durch 'Z'
ru: Замените пространство на «Z»
zh_cn: 用“ Z”代替空格

# ZSpaceTooltip
source: Replace space characters with 'Z' during encryption and 'Z' with space during decryption.
de: Ersetze Leerzeichen durch 'Z' bei der Verschlüsselung und 'Z' durch Leerzeichen bei der Entschlüsselung.
ru: Заменяйте пробелы символами «Z» во время шифрования и «Z» с пробелом во время дешифрования.
zh_cn: 在加密过程中，将空格字符替换为“ Z”，在解密过程中，将空格字符替换为“ Z”。
