Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/BooleanOperators/Properties/Resources.*.resx
Languages: de, ru

# PluginBBO_Caption
source: Boolean Binary Operator
de: Binärer boolescher Operator
ru: Логический двоичный оператор

# PluginBBO_Tooltip
source: Boolean Binary Operator
de: Binärer boolescher Operator
ru: Логический двоичный оператор

# PluginBIE_Caption
source: Boolean If-Else Operator
de: Boolescher Wenn-Dann-Operator
ru: Оператор Boolean If-Else

# PluginBIE_Tooltip
source: Boolean If-Else Operator
de: Boolescher Wenn-Dann-Operator
ru: Оператор Boolean If-Else

# PluginBI_Caption
source: Boolean Input
de: Boolesche Eingabe
ru: Логический вход

# PluginBI_Tooltip
source: Boolean Input
de: Boolesche Eingabe
ru: Логический вход

# PluginBN_Caption
source: Boolean Not Operator
de: Boolescher Nicht-Operator

# PluginBN_Tooltip
source: Boolean Not Operator
de: Boolescher Nicht-Operator

# PluginBO_Caption
source: Boolean Output
de: Boolesche Ausgabe
ru: Логический вывод

# PluginBO_Tooltip
source: Boolean Output
de: Boolesche Ausgabe
ru: Логический вывод

# BBO_InputACaption
source: InputA
de: Eingabe A
ru: вход

# BBO_InputATooltip
source: inputA
de: Eingabe A
ru: вход

# BBO_InputBCaption
source: InputB
de: Eingabe B

# BBO_InputBTooltip
source: inputB
de: Eingabe B

# BBO_OutputCaption
source: Output
de: Ausgabe
ru: Вывод

# BBO_OutputTooltip
source: output
de: Ausgabe
ru: вывод

# BIE_InputCaption
source: Input
de: Eingabe
ru: вход

# BIE_InputTooltip
source: input
de: Eingabe
ru: вход

# BIE_Output_trueCaption
source: Output_true
de: Ausgabe wahr

# BIE_Output_trueTooltip
source: output true
de: Ausgabe wahr

# BIE_Output_falseCaption
source: Output_false
de: Ausgabe falsch

# BIE_Output_falseTooltip
source: output false
de: Ausgabe falsch
ru: вывод false

# BI_OutputCaption
source: Output
de: Ausgabe
ru: Вывод

# BI_OutputTooltip
source: Output
de: Ausgabe
ru: Вывод

# BN_InputCaption
source: Input
de: Eingabe
ru: вход

# BN_InputTooltip
source: input
de: Eingabe
ru: вход

# BN_OutputCaption
source: Output
de: Ausgabe
ru: Вывод

# BN_OutputTooltip
source: output negated
de: Negierte Ausgabe
ru: выход отрицается

# BO_InputCaption
source: Input
de: Eingabe
ru: вход

# BO_InputTooltip
source: input
de: Eingabe
ru: вход

# BBO_DefaultFlagACaption
source: Default Flag A
de: Voreinstellung Flag A
ru: Флаг по умолчанию A

# BBO_DefaultFlagATooltip
source: If checked, Flag A will be set to fired
de: Wenn dieses Kontrollkästchen gesetzt ist, wird der Eingang A beim Start des Plugins als aktualisiert betrachtet.
ru: Если флажок установлен, флаг A будет установлен в

# BBO_DefaultFlagBCaption
source: Default Flag B
de: Voreinstellung Flag B
ru: Флаг по умолчанию B

# BBO_DefaultFlagBTooltip
source: If checked, Flag B will be set to fired
de: Wenn dieses Kontrollkästchen gesetzt ist, wird der Eingang B beim Start des Plugins als aktualisiert betrachtet.
ru: Если флажок установлен, флаг B будет установлен в

# BBO_OperatorTypeCaption
source: Operator Type
de: Boolesche Operation
ru: Тип оператора

# BBO_OperatorTypeTooltip
source: Operator Type
de: Boolesche Operation
ru: Тип оператора

# BBO_UpdateOnlyAtBothInputsChangedCaption
source: Update needs both inputs
de: Update braucht beide Eingaben
ru: Обновление нуждается в обоих входах

# BBO_UpdateOnlyAtBothInputsChangedTooltip
source: If checked, this plugin will only update its status if both inputs have changed
de: Wenn dieses Flag gesetzt ist, wird die Ausgabe des Plugins nur dann erneuert, wenn beide Eingänge aktualisiert wurden.
ru: Если этот флажок установлен, этот плагин обновит свой статус только в том случае, если оба входа изменились

# BI_ValueCaption
source: Value
de: Wert
ru: Стоимость

# BI_ValueTooltip
source: Set the boolean value
de: Setze den booleschen Wert der Ausgabe
ru: Задайте логическое значение

# BI_ValueList1
source: False
de: Falsch
ru: Ложь

# BI_ValueList2
source: True
de: Wahr
ru: Правда

source: False
de: Falsch
ru: Ложь

source: True
de: Wahr
ru: Правда

# BBO_OperatorTypeList1
source: AND
ru: А ТАКЖЕ

# BBO_OperatorTypeList2
source: OR
ru: ИЛИ

# BBO_OperatorTypeList5
source: XOR
ru: бЕСПЛАТНО
