Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/NLFSR/Properties/Resources.*.resx
Languages: ru

# PluginTooltip
source: Non-Linear Feedback Shift Register
ru: Нелинейный регистр сдвига обратной связи

# InputTapSequenceCaption
source: Feedback function
ru: Функция обратной связи

# InputTapSequenceTooltip
source: Feedback function as a string, for example x0 * x2 + x1 + 1
ru: Функция обратной связи как строка, например x0 * x2 + x1 + 1

# InputSeedCaption
source: Seed
ru: семя

# InputSeedTooltip
source: Seed of the NLFSR in binary presentation.
ru: Семя NLFSR в двоичном представлении.

# InputClockBoolCaption
source: Clock
ru: Часы

# InputClockBoolTooltip
source: Optional clock input. NLFSR only advances if clock is true.
ru: Дополнительный тактовый вход. NLFSR только продвигается, если часы истинны.

# OutputStringCaption
source: String Output
ru: Строковый выход

# OutputStringTooltip
source: Produces the output bits as a string with length==rounds. Use this output without a clock input.
ru: Производит выходные биты в виде строки с длиной == раундов. Используйте этот выход без ввода часов.

# OutputBoolCaption
source: Boolean Output
ru: Логический вывод

# OutputBoolTooltip
source: NLFSR Boolean Output. Use this output together with a clock input.
ru: Логический вывод NLFSR. Используйте этот выход вместе с вводом часов.

# OutputBoolArrayCaption
source: Boolean[] Output
ru: Boolean [] Выход

# OutputBoolArrayTooltip
source: NLFSR Boolean Output. Use this output together with a clock input.
ru: Логический вывод NLFSR. Используйте этот выход вместе с вводом часов.

# OutputClockingBitCaption
source: Additional Output Bit
ru: Дополнительный выходной бит

# OutputClockingBitTooltip
source: Additional Output Bit.
ru: Дополнительный выходной бит.

# AlwaysCreateOutputCaption
source: Always create output
ru: Всегда создавать вывод

# AlwaysCreateOutputTooltip
source: With this checkbox enabled, an output will be generated, even though the clock is set to false. The output bit will be the bit from the last clock cycle.
ru: При включенном флажке будет генерироваться выходной сигнал, даже если для часов установлено значение false. Выходной бит будет бит от последнего такта.

# ClockingBitCaption
source: Additional output bit #
ru: Дополнительный выходной бит #

# ClockingBitTooltip
source: Which bit shall be generated as an additional output? For example as a clocking bit.
ru: Какой бит должен быть сгенерирован как дополнительный выход? Например, как бит синхронизации.

# NoQuickwatchCaption
source: Do not display presentation
ru: Не показывать презентацию

# NoQuickwatchTooltip
source: With this checkbox enabled, no presentation will be shown and performance will be better.
ru: Если этот флажок включен, презентация не будет показана, и производительность будет лучше.

# PolynomialCaption
source: Feedback function
ru: Функция обратной связи

# PolynomialTooltip
source: Define the feedback function, for example x0 * x2 + x1 + 1
ru: Определите функцию обратной связи, например x0 * x2 + x1 + 1

# RoundsCaption
source: Rounds
ru: Туры

# RoundsTooltip
source: How many bits shall be generated? Note: This only applies if no boolean clock is used.
ru: Сколько бит должно быть сгенерировано? Примечание. Это применимо только в том случае, если не используются логические часы.

# SaveCurrentStateCaption
source: Save the state of the NLFSR
ru: Сохранить состояние NLFSR

# SaveCurrentStateTooltip
source: With this checkbox enabled, the current state will be restored after opening a .cte.
ru: Если этот флажок включен, текущее состояние будет восстановлено после открытия .cte.

# SeedCaption
source: Seed
ru: семя

# SeedTooltip
source: Define the seed of the LFSR. For example 11100
ru: Определите семя LFSR. Например, 11100

# UseBoolClockCaption
source: Use BoolClock
ru: Использовать BoolClock

# UseBoolClockTooltip
source: With this checkbox enabled, BoolClock will be used.
ru: При включенном флажке будет использоваться BoolClock.

# UseClockingBitCaption
source: Generate add. output bit
ru: Создать add. выходной бит

# UseClockingBitTooltip
source: With this checkbox enabled, the additional output bit will be generated.
ru: При включенном флажке будет генерироваться дополнительный выходной бит.

# initNLFSRCaption
source: Draw NLFSR
ru: Нарисуйте NLFSR

# initNLFSRTooltip
source: Initializes NLFSR and draws the presentation. This is used to view the NLFSR before pressing play.
ru: Инициализирует NLFSR и рисует презентацию. Это используется для просмотра NLFSR перед нажатием на воспроизведение.

# AlwaysCreateOutputList1
source: Always generate output?
ru: Всегда генерировать вывод?

# ClockGroup
source: Clock Properties
ru: Свойства часов

# ClockingBitGroup
source: Additional Output Bit
ru: Дополнительный выходной бит

# NoQuickwatchList1
source: Display presentation?
ru: Показать презентацию?

# No_Quickwatch_data_right_now_
source: No data to present right now.
ru: Данных сейчас нет.

# SaveCurrentStateList1
source: Save current state?
ru: Сохранить текущее состояние?

# UseBoolClockList1
source: Use external clock?
ru: Использовать внешние часы?

# UseClockingBitList1
source: Generate additional output bit?
ru: Создать дополнительный бит вывода?
