Repository: CrypToolProject/CrypTool-2
Catalog: CrypWin/Properties/Resources.*.resx
Languages: de, ru, zh_cn

source: No update available
de: Kein Update verfügbar
ru: Нет доступных обновлений
zh_cn: 无可用更新

source: Checking for updates ...
de: Suche nach Updates ...
ru: Проверка обновлений ...
zh_cn: 查询更新...

source: Update available
de: Updates verfügbar
ru: Доступно обновление
zh_cn: 有可用更新

source: Downloading update ...
de: Lade Update ...
ru: Загрузка обновления ...
zh_cn: 正在下载更新...

source: Update ready to install
de: Update bereit zur Installation
ru: Обновление готово к установке
zh_cn: 准备安装更新

source: Update ready to install, would you like to install it now?
de: Update bereit zur Installation. Jetzt durchführen?
ru: Обновление готово для установки, хотите ли вы установить его сейчас?
zh_cn: 准备安装更新，您要立即安装吗？

# CrypTool_2_0_Update
source: CrypTool 2 Update
ru: Обновление CrypTool 2
zh_cn: CrypTool 2更新

source: Update available, would you like to download?
de: Update verfügbar, möchten Sie dieses runterladen?
ru: Доступно обновление, вы хотите скачать?
zh_cn: 有可用更新，您要下载吗？

# _Open_CrypTool_2_0
source: &Open CrypTool 2
de: &Öffne CrypTool 2
ru: &amp; Открыть CrypTool 2
zh_cn: ＆打开CrypTool 2

source: &Normal Priority
de: &Normale Priorität
ru: &amp; Нормальный приоритет
zh_cn: ＆正常优先

source: &Idle Priority
de: &Leerlauf Priorität
ru: &amp; Приоритет ожидания
zh_cn: ＆空闲优先

source: &High Priority
de: &Hohe Priorität
ru: &amp;Высокий приоритет
zh_cn: ＆高优先级

source: &Realtime Priority
de: &Echtzeit Priorität
ru: &amp; Приоритет реального времени
zh_cn: ＆实时优先

source: &Below Normal Priority
de: &Unter normaler Priorität
ru: &amp; Ниже нормального приоритета
zh_cn: 低于正常优先级

source: &Above Normal Priority
de: &Über normaler Priorität
ru: &amp; Над нормальным приоритетом
zh_cn: 高于正常优先级

source: &Exit
de: &Ende
ru: &amp;Выход
zh_cn: ＆出口

source: Change &Priority
de: Ändere &Priorität
ru: Изменение и приоритет
zh_cn: 变化与优先

source: Classic Ciphers
de: Klassische Verfahren
ru: Классические шифры
zh_cn: 经典密码

source: Symmetric
de: Symmetrisch
ru: симметричный
zh_cn: 对称的

source: Added plugin "{0}"
de: Plugin "{0}" hinzugefügt
ru: Добавлен плагин &quot;{0}&quot;
zh_cn: 添加了插件“ {0}”

source: Assembly "{0}" loaded.
de: Assembly "{0}" geladen.
ru: Сборка «{0}» загружена.
zh_cn: 程序集“ {0}”已加载。

source: Information Message
de: Hinweis
ru: Информационное сообщение
zh_cn: 信息留言

source: Error Message
de: Fehler
ru: Сообщение об ошибке
zh_cn: 错误信息

source: messages ({0} filtered)
de: Nachrichten ({0} gefiltert)
ru: Сообщения ({0} отфильтрованы)
zh_cn: 消息（已过滤{0}）

source: Messages
de: Nachrichten
ru: Сообщения
zh_cn: 留言内容

source: Hide Errors
de: Verstecke Fehler
ru: Скрыть ошибки
zh_cn: 隐藏错误

source: Show Errors
de: Zeige Fehler
ru: Показать ошибки
zh_cn: 显示错误

source: Show Warnings
de: Zeige Warnungen
ru: Показать предупреждения
zh_cn: 显示警告

source: Hide Warnings
de: Verstecke Warnungen
ru: Скрыть предупреждения
zh_cn: 隐藏警告

source: Hide Infos
de: Verstecke Hinweise
ru: Скрыть информацию
zh_cn: 隐藏信息

source: Show Infos
de: Zeige Hinweise
ru: Показать информацию
zh_cn: 显示信息

source: Hide Debugs
de: Verstecke Debugnachrichten
ru: Скрыть отладки
zh_cn: 隐藏调试

source: Show Debugs
de: Zeige Debugnachrichten
ru: Показать отладки
zh_cn: 显示调试

source: Hide Balloons
de: Verstecke Sprechblasennachrichten
ru: Скрыть воздушные шары
zh_cn: 隐藏气球

source: Show Balloons
de: Zeige Sprechblasennachrichten
ru: Показать воздушные шары
zh_cn: 显示气球

source: There are still running tasks (workspaces in Play mode). Do you really want to exit CrypTool 2 ?
de: Mehrere Arbeitsflächen sind noch im Play-Mode. Möchten Sie CrypTool 2 wirklich beenden?
ru: Все еще выполняются задачи (рабочие области в режиме воспроизведения). Вы действительно хотите выйти из CrypTool 2?
zh_cn: 仍有正在运行的任务（“播放”模式下的工作区）。您真的要退出CrypTool 2吗？

source: Warning
de: Warnung
ru: Предупреждение
zh_cn: 警告

source: Load this file.
de: Lade diese Datei.
ru: Загрузите этот файл.
zh_cn: 加载该文件。

source: Information
de: Hinweis
ru: Информация
zh_cn: 信息

# CrypTool_2_0_has_been_backgrounded_due_to_running_tasks_
source: CrypTool 2 has been minimized to tray due to running tasks.
de: CrypTool 2 wurde wegen laufender Aufgaben im Hintergrund versteckt.
ru: CrypTool 2 был сведен к минимуму до лотка из-за выполняемых задач.
zh_cn: 由于运行任务，CrypTool 2已最小化到托盘。

source: System Infos
de: Systeminformationen
ru: Информация о системе
zh_cn: 系统信息

source: Plugin type:
de: Art des Plugins:
ru: Тип плагина:
zh_cn: 插件类型：

source: Save file
de: Datei speichern
ru: Сохранить файл
zh_cn: 保存存档

source: Open file
de: Datei öffnen
ru: Открыть файл
zh_cn: 打开文件

source: Error loading file
de: Fehler beim Laden von Datei
ru: Ошибка при загрузке файла
zh_cn: 加载文件时出错

source: File {0} doesn't exist!
de: Datei {0} existiert nicht!
ru: Файл {0} не существует!
zh_cn: 文件{0}不存在！

source: Pause
ru: Пауза
zh_cn: 暂停

source: ContextHelp
de: Kontexthilfe
zh_cn: 上下文帮助

source: Paste
de: Einfügen
ru: Вставить
zh_cn: 糊

source: Remove
de: Entfernen
ru: Удалить
zh_cn: 去掉

source: PlayDemo
de: Starte Demo
ru: Играть демо
zh_cn: 播放演示

source: StopDemo
de: Stoppe Demo
zh_cn: 停止演示

source: Maximize
de: Maximieren
ru: максимизировать
zh_cn: 最大化

source: Fullscreen
de: Vollbild
ru: Полноэкранный
zh_cn: 全屏

# Network
source: CrypCloud
zh_cn: 加密云

# AutoUpdater
source: Updates
ru: Обновления
zh_cn: 更新

source: Settings
de: Einstellungen
ru: настройки
zh_cn: 设定值

source: Check for updates now
de: Suche jetzt nach Updates
ru: Проверить наличие обновлений
zh_cn: 立即检查更新

# You_have_currently_the_latest_version_installed_
source: You have currently installed the latest version of CrypTool 2.
de: Sie haben derzeit die neuste Version von CrypTool 2 installiert.
ru: В настоящее время установлена ​​последняя версия CrypTool 2.
zh_cn: 您当前已经安装了最新版本的CrypTool 2。

source: Checking failed, cannot contact server: {0}
de: Suche fehlgeschlagen, kann den Server nicht kontaktieren: {0}
ru: Не удалось выполнить проверку, не удается связаться с сервером: {0}
zh_cn: 检查失败，无法联系服务器：{0}

source: Download update now
de: Lade Updates jetzt runter
ru: Загрузить обновление сейчас
zh_cn: 立即下载更新

source: Update available: {0}
de: Update verfügbar: {0}
ru: Доступно обновление: {0}
zh_cn: 可用更新：{0}

source: Downloading update {0} ...
de: Lade Update {0} ...
ru: Загрузка обновления {0} ...
zh_cn: 正在下载更新 {0} ...

source: Restart and install now
de: Jetzt neu starten und installieren...
ru: Перезапустите и установите сейчас
zh_cn: 立即重新启动并安装

# Update___0___ready_to_install_
source: Update ready to install: {0}
de: Update bereit zur Installation: {0}
ru: Обновление готово к установке: {0}
zh_cn: 准备安装更新：{0}

source: Stop
de: Stoppen
ru: Стоп
zh_cn: 停止

source: Home
de: Start
ru: Главная
zh_cn: 家

# RBHeader_File
source: File
de: Datei
ru: файл
zh_cn: 文件

# RBTooltip_File
source: Main control for CrypTool2 workspaces
de: Hauptsteuerung des CrypTool 2-Arbeitsbereichs
ru: Основное управление рабочими пространствами CrypTool 2
zh_cn: CrypTool2工作区的主控件

source: Save
de: Speichern
ru: Сохранить
zh_cn: 救

source: Print
de: Drucken
ru: Распечатать
zh_cn: 打印

source: Edit
de: Bearbeiten
ru: редактировать
zh_cn: 编辑

# RBHeader_RedoUndo
source: Undo/Redo
de: Wiederholen/Rückgängig
zh_cn: 撤销重做

source: Asymmetric
de: Asymmetrisch
ru: асимметричный
zh_cn: 不对称

source: Checksum
de: Prüfsumme
ru: Контрольная сумма
zh_cn: 校验和

source: Specific
de: Spezifisch
ru: Конкретный
zh_cn: 具体

source: Tools
de: Werkzeuge
ru: инструменты
zh_cn: 工具类

source: Standalone
de: Selbständig
zh_cn: 单机版

source: Generators
de: Generatoren
ru: Генераторы
zh_cn: 发电机

source: Input
de: Eingabe
ru: вход
zh_cn: 输入值

source: Output
de: Ausgabe
ru: Вывод
zh_cn: 输出量

source: Throughput
de: Durchlauf
ru: пропускная способность
zh_cn: 通量

source: Parameters
de: Parameter
ru: параметры
zh_cn: 参量

source: 0 Messages
de: 0 Nachrichten
ru: 0 сообщений
zh_cn: 0条消息

source: Exit CrypTool
de: Beende CrypTool
ru: Выйти из CrypTool
zh_cn: 退出CrypTool

source: New
de: Neu
ru: новый
zh_cn: 新

source: Open
de: Öffnen
ru: открыто
zh_cn: 打开

source: Save as...
de: Speichern als...
ru: Сохранить как...
zh_cn: 另存为...

source: Play
de: Starten
ru: Играть
zh_cn: 玩

# RBTooltip_Start
source: Start execution of the current workspace (F5)
de: Starte den aktuellen Arbeitsbereich (F5)
ru: Начать выполнение текущей рабочей области (F5)
zh_cn: 开始执行当前工作区（F5）

# RBTooltip_Stop
source: Stop execution of the current workspace (Shift + F5)
de: Stoppe den aktuellen Arbeitsbereich (Shift + F5)
ru: Прекратить выполнение текущей рабочей области (Shift + F5)
zh_cn: 停止执行当前工作区（Shift + F5）

source: Dynamic controls of the current plugin editor
de: Dynamische Steuerung des derzeitigen Plug-In Editors
ru: Динамические элементы управления текущего редактора плагинов
zh_cn: 当前插件编辑器的动态控件

source: Plugin editor
ru: Редактор плагинов
zh_cn: 插件编辑器

# Select_samples_and_start_demo_mode_
source: Select projects and start demo mode
de: Wähle Projekte und starte den Demo-Modus
ru: Выбрать проекты и запустить демонстрационный режим
zh_cn: 选择项目并启动演示模式

# In_demo_mode_a_selected_set_of_samples_is_repeatedly_executed_
source: In demo mode a selected set of project is repeatedly executed
de: Im Demo-Modus wird eine Menge von Projekten in einer Schleife ausgeführt
ru: В демонстрационном режиме выбранный набор проектов выполняется повторно
zh_cn: 在演示模式下，重复执行选定的项目集

# RBHeader_Demo
source: Demo mode
de: Demo-Modus
ru: Демо-режим
zh_cn: 示范模式

# How_long_should_a_sample_be_kept_running_before_opening_next_one_
source: How long should a project be kept running before opening next one? (in seconds)
de: Wie lange sollte ein Projekt geöffnet sein? (in Sekunden)
ru: Как долго должен продолжаться проект до открытия следующего? (в секундах)
zh_cn: 在打开下一个项目之前，一个项目应保持运行多长时间？ （片刻之间）

source: Stop Demo Mode
de: Stoppe Demo-Modus
ru: Остановить демонстрационный режим
zh_cn: 停止演示模式

# RBHeader_Extras
source: Extras
ru: Дополнительно
zh_cn: 附加功能

source: Management functions for CrypTool 2
de: Verwaltungsfunktionen für CrypTool 2
ru: Функции управления для CrypTool 2
zh_cn: CrypTool 2的管理功能

# Manages_the_integrated_network_connection_
source: Participate in distributed cryptanalysis using CrypCloud
de: An verteilter Kryptoanalyse mithilfe der CrypCloud teilnehmen
ru: Участвовать в распределенном криптоанализе с использованием CrypCloud
zh_cn: 使用CrypCloud参与分布式密码分析

# SettingsTooltip
source: Configure CrypTool 2
de: Konfiguration von CrypTool 2
ru: Настройка CrypTool 2
zh_cn: 配置CrypTool 2

# RBTooltip_Help
source: Help for CrypTool 2 (F1)
de: Hilfe für CrypTool 2 (F1)
ru: Справка для CrypTool 2 (F1)
zh_cn: CrypTool 2（F1）的帮助

# Redo_or_Undo_your_last_changes_
source: Undo or Redo your last changes
de: Letztere Änderungen rückgängig machen oder wiederholen
ru: Отменить или изменить свои последние изменения
zh_cn: 撤消或重做您的最后更改

source: Undo
de: Rückgängig
ru: расстегивать
zh_cn: 撤消

source: Redo
de: Wiederholen
ru: готовый
zh_cn: 准备

# RBTooltip_Editing
source: Editing functions for the current workspace
de: Bearbeitungsfunktionen für den aktuellen Arbeitsbereich
ru: Редактирование функций для текущего рабочего пространства
zh_cn: 当前工作空间的编辑功能

# RBHeader_Editing
source: Editing
de: Bearbeiten
ru: редактирование
zh_cn: 编辑中

source: Cut
de: Ausschneiden
ru: Порез
zh_cn: 切

source: Copy
de: Kopieren
ru: копия
zh_cn: 复制

# CrypTutorial
source: Crypto Tutorials
de: Kryptotutorien
zh_cn: 加密教程

source: About
de: Über
ru: Около
zh_cn: 关于

source: System Infos
de: Systeminformationen
ru: Информация о системе
zh_cn: 系统信息

source: Components
de: Komponenten
ru: Компоненты
zh_cn: 组件

source: Modern Ciphers
de: Moderne Verfahren
ru: Современные шифры
zh_cn: 现代密码

source: Misc
de: Sonstige
ru: Разное
zh_cn: 杂项

source: Hash Functions
de: Hash-Funktionen
ru: Хэш-функции
zh_cn: 散列函数

source: Cryptanalysis
de: Kryptoanalyse
ru: криптоанализа
zh_cn: 密码分析

source: Statistics
de: Statistiken
ru: Статистика
zh_cn: 统计

source: Differential
de: Differenz
ru: дифференцированный
zh_cn: 微分

# Editor_Specific_
source: Project Specific
de: Projektspezifisch
ru: Конкретный проект
zh_cn: 具体项目

source: Templates
de: Vorlagen
ru: Шаблоны
zh_cn: 范本

source: Search
de: Suche
ru: Поиск
zh_cn: 搜索

source: Hide Errors
de: Verstecke Fehler
ru: Скрыть ошибки
zh_cn: 隐藏错误

source: Hide Warnings
de: Verstecke Warnungen
ru: Скрыть предупреждения
zh_cn: 隐藏警告

source: Hide Infos
de: Verstecke Hinweise
ru: Скрыть информацию
zh_cn: 隐藏信息

source: Show Debugs
de: Zeige Debugnachrichten
ru: Показать отладки
zh_cn: 显示调试

source: Show Balloons
de: Zeige Sprechblasennachrichten
ru: Показать воздушные шары
zh_cn: 显示气球

source: Balloons
de: Sprechblasen
ru: Надувные шарики
zh_cn: 气球

source: Debugs
de: Debugnachrichten
ru: отлаживает
zh_cn: 除错

source: Infos
de: Hinweise
ru: информация
zh_cn: 信息

source: Warnings
de: Warnungen
ru: Предупреждения
zh_cn: 警告事项

source: Errors
de: Fehler
ru: ошибки
zh_cn: 失误

# Clear_LogWindow_
source: Clear all messages
de: Alle Nachrichten löschen
ru: Очистить все сообщения
zh_cn: 清除所有讯息

source: Export to HTML
de: Exportiere zu HTML
ru: Экспорт в HTML
zh_cn: 导出为HTML

source: Nr
ru: Нет.
zh_cn: 没有。

source: LogLevel
zh_cn: 日志级别

source: Time
de: Zeit
ru: Время
zh_cn: 时间

source: Plugin
zh_cn: 插入

# Title
source: Revision
ru: пересмотр
zh_cn: 修订版

source: Message
de: Nachricht
ru: Сообщение
zh_cn: 信息

source: No updates available.
de: Keine Updates verfügbar.
ru: Нет доступных обновлений.
zh_cn: 没有可用的更新。

# Please_report_any_bugs_you_may_encounter_on_our_website_
source: Please feel free to further improve CrypTool 2.
de: Bitte helfen Sie uns, CrypTool 2 zu verbessern.
ru: Пожалуйста, не стесняйтесь улучшать CrypTool 2.
zh_cn: 请随时进一步改进CrypTool 2。

# Feel_free_to_contribute_to_this_project_
source: We are glad about any feedback on our website.
de: Wir freuen uns über Feedback auf unserer Webseite.
ru: Мы рады любым отзывам на нашем сайте.
zh_cn: 我们很高兴收到我们网站上的任何反馈。

# For_more_information_
source: For more information take a look at our website:
de: Weitere Informationen auf unserer Webseite:
ru: Для получения дополнительной информации посетите наш веб-сайт:
zh_cn: 有关更多信息，请访问我们的网站：

# RBHeader_Execute
source: Execute
de: Ausführen
ru: казнить
zh_cn: 执行

source: Help
de: Hilfe
ru: Помогите
zh_cn: 救命

source: Balloon Message
de: Sprechblasennachricht
ru: Сообщение о воздушном шаре
zh_cn: 气球讯息

source: Warning Message
de: Warnungsnachricht
ru: Предупреждающее сообщение
zh_cn: 警告信息

source: Debug Message
de: Debugnachricht
ru: Отладочное сообщение
zh_cn: 调试信息

# Contact_Us_
source: Contact Developers / Report a Bug
de: Kontakt aufnehmen / Fehler melden
ru: Связаться с разработчиками / Сообщить об ошибке
zh_cn: 联系开发人员/报告错误

source: Visit Homepage
de: Homepage besuchen
ru: Ответов: 4
zh_cn: 访问主页

source: Description
de: Beschreibung
ru: Описание
zh_cn: 描述

source: Value
de: Wert
ru: Стоимость
zh_cn: 值

# Update_ready_to_install__would_you_like_to_remove_it
source: Would you like to remove the existing update?
de: Wollen Sie das verfügbare Update löschen?
ru: Вы хотите удалить существующее обновление?
zh_cn: 您要删除现有更新吗？

source: Startcenter
zh_cn: 起始中心

# Startcenter_Tooltip
source: Opens the Startcenter
de: Öffnet das Startcenter
ru: Startcenter
zh_cn: 打开Startcenter

# CrypToolStore_Tooltip
source: Opens the CrypTool Store
de: Öffnet den CrypTool-Store
zh_cn: 开设CrypTool商店

source: Online Help
de: Online-Hilfe
ru: Онлайн помощь
zh_cn: 网上帮助

# GeneratingWaitMessage
source: Please wait... generating online help.
de: Bitte warten... Online-Hilfe wird erzeugt.
ru: Подождите ... Генерация документации.
zh_cn: 请稍候...正在生成在线帮助。

# OnlineHelpTab_ShowHTMLFile_Doc_page__0__not_found_
source: Doc page {0} not found!
ru: Страница Doc {0} не найдена!
zh_cn: 找不到文档页面{0}！

# MainWindow_ShowHelpPage_No_special_help_file_found_for__0__
source: No special help file found for {0}!
ru: Не найдено специального файла справки для {0}!
zh_cn: 找不到{0}的特殊帮助文件！

source: Steganography
de: Steganografie
ru: стеганография
zh_cn: 隐写术

# Changelog
source: Release Notes
ru: Примечания к выпуску
zh_cn: 发行说明

source: Can't get unique ID: {0}
de: Kann eindeutige ID nicht feststellen: {0}
ru: Не удается получить уникальный идентификатор: {0}
zh_cn: 无法获得唯一ID：{0}

source: Data flow
de: Datenfluss
ru: Поток данных
zh_cn: 数据流

source: Data input/output
de: Daten-Ein-/Ausgabe
ru: Ввод / вывод данных
zh_cn: 数据输入/输出

source: Peer-to-peer
ru: Пиринговый
zh_cn: 点对点

source: Protocols
de: Protokolle
ru: протоколы
zh_cn: 规约

source: Generic
de: Generisch
ru: общий
zh_cn: 泛型

source: Search
de: Suche
ru: Поиск
zh_cn: 搜索

# RBHeader_Add
source: Add
de: Einfügen
ru: Добавить
zh_cn: 加

source: Fit to Screen
de: an Bildschirmgröße anpassen
ru: По размеру экрана
zh_cn: 适应屏幕

# AddImage
source: Image
de: Bild
ru: Образ
zh_cn: 图片

source: Log
de: Protokoll
ru: Журнал
zh_cn: 日志记录

# RBTooltip_Execute
source: Start or stop execution of the current workspace
de: Ausführungssteuerung für den aktuellen Arbeitsbereich
ru: Запуск или остановка выполнения текущего рабочего пространства
zh_cn: 开始或停止当前工作区的执行

# AddText
source: Text
ru: Текст
zh_cn: 文本

source: Zoom
de: Vergrößerung
ru: Увеличить
zh_cn: 放大

# Do_you_want_to_save_the_changes_you_made_in_the_project
source: Do you want to save the changes you made in the project in the file "{0}" ?
de: Wollen Sie die im Projekt vorgenommenen Änderungen in der Datei "{0}" speichern?
ru: Вы хотите сохранить изменения, внесенные вами в проект в файле «{0}»?
zh_cn: 您是否要将在项目中所做的更改保存到文件“ {0}”中？

source: Do you want to save your new project?
de: Wollen Sie Ihr neues Projekt speichern?
ru: Вы хотите сохранить свой новый проект?
zh_cn: 您要保存新项目吗？

# Generating_Documentation_Title
source: Generating Documentation
de: Dokumentation wird erzeugt
ru: Создание документации
zh_cn: 产生文件

source: Question
de: Frage
ru: Вопрос
zh_cn: 题

source: Unsaved changes
de: Ungesicherte Änderungen
ru: Несохраненные изменения
zh_cn: 未保存的更改

source: Unsaved workspace
de: ungesicherte Arbeitsfläche
ru: Несохраненное рабочее пространство
zh_cn: 未保存的工作区

# DateHeader
source: Date
de: Datum
ru: Дата
zh_cn: 日期

# MessageHeader
source: Message
de: Bemerkung
ru: Сообщение
zh_cn: 信息

# TitleHeader
source: Title
de: Titel
ru: заглавие
zh_cn: 标题

source: Are you sure?
de: Sind Sie sicher?
ru: Ты уверен?
zh_cn: 你确定吗？

# Are_you_sure_you_want_to_send_this_message_to_the_CrypToo_developers_
source: Are you sure you want to send this message to the CrypTool 2 developers?
de: Sind Sie sicher, dass Sie diese Nachricht an die CrypTool 2-Entwickler schicken wollen?
ru: Вы действительно хотите отправить это сообщение разработчикам CrypTool 2?
zh_cn: 您确定要将此消息发送给CrypTool 2开发人员吗？

source: Cancel
de: Abbrechen
ru: Отмена
zh_cn: 取消

# Contact_Developers
source: Contact Developers / Report a Bug
de: Kontakt aufnehmen / Fehler melden
ru: Связаться с разработчиками / Сообщить об ошибке
zh_cn: 联系开发人员/报告错误

source: Copy everything to clipboard
de: Alles in die Zwischenablage kopieren
ru: Скопировать все в буфер обмена
zh_cn: 将所有内容复制到剪贴板

source: Copy this row to clipboard
de: Diese Zeile in die Zwischenablage kopieren
ru: Скопируйте эту строку в буфер обмена
zh_cn: 将此行复制到剪贴板

# Error_trying_to_send_the_message
source: Error trying to send the message: {0}. Please try again later or visit our website.
de: Fehler beim Senden der Nachricht: {0}. Bitte versuchen Sie es später noch einmal oder besuchen Sie unsere Webseite.
ru: Ошибка при попытке отправить сообщение: {0}. Повторите попытку позже или посетите наш веб-сайт.
zh_cn: 尝试发送消息时出错：{0}。请稍后重试或访问我们的网站。

source: Input failure
de: Eingabefehler
ru: Ошибка входа
zh_cn: 输入失败

source: Interval
de: Intervall
ru: интервал
zh_cn: 间隔

source: Please fill in all required fields!
de: Bitte füllen Sie alle benötigten Felder aus!
ru: Пожалуйста, заполните все обязательные поля!
zh_cn: 请填写所有必填字段！

source: Send
de: Senden
ru: послать
zh_cn: 发送

source: Sending done
de: Senden erfolgreich
ru: Отправка
zh_cn: 发送完成

source: Sending failed
de: Senden fehlgeschlagen
ru: Отправка не удалась
zh_cn: 发送失败

# SI_Administrative_Rights
source: Administrative rights
de: Administrationsrechte
ru: Административные права
zh_cn: 行政权

# SI_Build_Time
source: Build time
de: Erstellungszeit
ru: Время сборки
zh_cn: 建立时间

# SI_Build_Type
source: Build type
de: Erstellungstyp
ru: Тип сборки
zh_cn: 构建类型

# SI_Common_Language_Runtime_Version
source: Common language runtime version (.NET version)
ru: Версия Common Language Runtime (версия .NET)
zh_cn: 公共语言运行时版本（.NET版本）

# SI_Runtime_Path
source: Runtime path
de: Laufzeitpfad
ru: Путь времени выполнения
zh_cn: 运行时路径

# SI_CrypTool_Version
source: CrypTool version
ru: Версия CrypTool
zh_cn: CrypTool版本

# SI_Current_Culture
source: Current culture
de: Spracheinstellung
ru: Текущая культура
zh_cn: 当前文化

# SI_Host_Name
source: Host Name
de: Rechnername
ru: Имя хоста
zh_cn: 主机名

# SI_Installation_Type
source: Installation type
de: Installationstyp
ru: Тип установки
zh_cn: 安装方式

# SI_Machine_Name
source: Machine Name
de: Maschinenname
ru: Название машины
zh_cn: 机器名称

# SI_Operating_System
source: Operating system
de: Betriebssystem
ru: Операционная система
zh_cn: 操作系统

# SI_Processors
source: Processors
de: Prozessoren
ru: процессоры
zh_cn: 处理器

# SI_Unique_Identifier
source: Unique identifier of the certificate
de: Eindeutiger Bezeichner
ru: Уникальный идентификатор сертификата
zh_cn: 证书的唯一标识符

# SI_User_Name
source: User Name
de: Benutzer
ru: Имя пользователя
zh_cn: 用户名

source: Subject:
de: Betreff:
ru: Предмет:
zh_cn: 学科：

source: Your e-mail address (optional):
de: Ihre E-Mail-Adresse (optional):
ru: Ваш адрес электронной почты (необязательно):
zh_cn: 您的电子邮件地址（可选）：

source: Your message:
de: Ihre Nachricht:
ru: Ваше сообщение:
zh_cn: 你的信息：

# Your_message_has_been_delivered
source: Your message has been delivered. Thank you!
de: Ihre Nachricht wurde übermittelt. Vielen Dank!
ru: Ваше сообщение доставлено. Спасибо!
zh_cn: 您的消息已送达。谢谢！

source: Close
de: Schließen
ru: Закрыть
zh_cn: 关

source: Close all
de: Alle schließen
ru: Закрыть все
zh_cn: 关闭所有

source: Close all, except this
de: Alle außer diesem schließen
ru: Закрыть Все, кроме этого
zh_cn: 关闭所有，除了这个

source: This is a template
de: Das ist ein Template
ru: Это шаблон
zh_cn: 这是一个模板

# HelpBackward
source: Backward
de: Zurück
ru: назад
zh_cn: 落后

# HelpForward
source: Forward
de: Vor
ru: Вперед
zh_cn: 前锋

# HelpHome
source: Home
de: Startseite
ru: Главная
zh_cn: 家

# SI_System_Time
source: System time
de: Systemzeit
ru: Системное время
zh_cn: 系统时间

# SI_Product_Name
source: Product name
de: Produktname
ru: Наименование товара
zh_cn: 产品名称

source: Boolean
ru: логический
zh_cn: 布尔型

# RBHeader_View
source: View
de: Ansicht
ru: Посмотреть
zh_cn: 视图

# UpdaterTooltip
source: Available updates for CrypTool 2
de: Verfügbare Updates für CrypTool 2
ru: Доступные обновления для CrypTool 2
zh_cn: CrypTool 2的可用更新

# WritingInTemplatesNotAllowed
source: Writing into the template directory is not allowed. You are being redirected to your home directory.
de: Das Schreiben im Vorlageordner ist nicht erlaubt. Sie werden in Ihr Heimverzeichnis weitergeleitet.
ru: Запись в каталог шаблона запрещена. Вы перенаправляетесь в свой домашний каталог.
zh_cn: 不允许写入模板目录。您将被重定向到主目录。

# TemplateUseDifferentDirectory
source: Please store your changes in a different directory.
de: Bitte speichern Sie Ihre Änderungen in einem anderen Verzeichnis.
ru: Сохраните изменения в другом каталоге.
zh_cn: 请将您的更改存储在其他目录中。

# RBHeader_CrypTutorial
source: Crypto Tutorials
de: Kryptotutorien
zh_cn: 加密教程

# RBTooltip_Add
source: Add image or text to the current workspace
de: Bilder oder Texte in den aktuellen Arbeitsbereich einfügen
ru: Добавить изображение или текст в текущую рабочую область
zh_cn: 将图像或文本添加到当前工作空间

# RBTooltip_AddImg
source: Add an image to the current workspace
de: Bild in den aktuellen Arbeitsbereich einfügen
ru: Добавление изображения в текущую рабочую область
zh_cn: 将图像添加到当前工作空间
