Repository: CrypToolProject/CrypTool-2
Catalog: CrypWin/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# RBTooltip_AddText
source: Add text to the current workspace
de: Text in den aktuellen Arbeitsbereich einfügen
ru: Добавить текст в текущую рабочую область
zh_cn: 向当前工作区添加文本

# RBTooltip_CrypTutorial
source: Available Crypto Tutorials
de: Verfügbare Kryptotutorien
ru: Доступные Crypto Tutorials
zh_cn: 可用的加密教程

# RBTooltip_Load
source: Load a workspace (Ctrl + O)
de: Arbeitsbereich laden (Strg + O)
ru: Загрузите рабочую область (Ctrl + O)
zh_cn: 加载工作区（Ctrl + O）

# RBTooltip_Log
source: Toggle visibility of the log window (Ctrl + L)
de: Log-Fenster ein-/ausblenden (Strg + L)
ru: Переключить видимость окна журнала (Ctrl + L)
zh_cn: 切换日志窗口的可见性（Ctrl + L）

# RBTooltip_New
source: Create a new workspace or open Wizard (Ctrl + N)
de: Neuen Arbeitsbereich oder Wizard öffnen (Strg + N)
ru: Создайте новое рабочее пространство или откройте мастер (Ctrl + N)
zh_cn: 创建一个新的工作区或打开向导（Ctrl + N）

# RBTooltip_Print
source: Print the current workspace (Ctrl + P)
de: Aktuellen Arbeitsbereich drucken (Strg + P)
ru: Печать текущей рабочей области (Ctrl + P)
zh_cn: 打印当前工作区（Ctrl + P）

# RBTooltip_Save
source: Save the current workspace (Ctrl + S)
de: Aktuellen Arbeitsbereich speichern (Strg + S)
ru: Сохранить текущую рабочую область (Ctrl + S)
zh_cn: 保存当前工作区（Ctrl + S）

# RBTooltip_View
source: Toggle visibility of windows
de: Fenster ein- und ausblenden
ru: Переключение видимости окон
zh_cn: 切换窗口的可见性

source: Licenses
de: Lizenzen
ru: Лицензии
zh_cn: 执照

source: View Licenses
de: Lizenzen anschauen
ru: Просмотр лицензий
zh_cn: 查看许可证

# CrypToolLicenses
source: CrypTool 2 and all its components are based on the Apache license 2.0 if not marked otherwise
de: CrypTool 2 und alle seine Komponenten unterliegen der Apache Lizenz 2.0, wenn nicht anders angegeben
ru: CrypTool 2 и все его компоненты основаны на лицензии Apache 2.0, если не отмечены иначе
zh_cn: 如果没有另外标记，CrypTool 2及其所有组件均基于Apache许可证2.0

# FileLost
source: Couldn't restore tab for file {0} because file is lost!
de: Konnte Tab für die Datei {0} nicht wiederherstellen, da die Datei verloren wurde!
ru: Не удалось восстановить вкладку для файла {0}, потому что файл потерян!
zh_cn: 由于文件丢失，无法恢复文件{0}的标签！

# Couldnt_create_tab_of_Type
source: Couldn't create tab of type {0}: {1}
de: Konnte den Tab vom Typ {0} nicht erstellen: {1}
ru: Не удалось создать вкладку типа {0}: {1}
zh_cn: 无法创建类型为{0}的标签：{1}

# LicensesTooltip
source: Licenses
de: Lizenzen
ru: Лицензии
zh_cn: 执照

# SI_no
source: no
de: nein
ru: нет
zh_cn: 没有

# SI_yes
source: yes
de: ja
ru: да
zh_cn: 是

# SysinfosTooltip
source: System Infos
de: Systeminformationen
ru: Информация о системе
zh_cn: 系统信息

# GeneratingLaTeXWaitMessage
source: Please wait... generating LaTeX documentation.
de: Bitte warten... LaTeX-Dokumentation wird erzeugt.
ru: Подождите ... Создание LaTeX-документации.
zh_cn: 请稍候...正在生成LaTeX文档。

# Generating_Statistics_Title
source: Please wait... generating connection statistics.
de: Bitte warten... Konnektoren-Statistik wird erzeugt.
ru: Создание статистики соединений компонентов
zh_cn: 请稍候...正在生成连接统计信息。

# StatisticsWaitMessage
source: Please wait... Generating Component Connection Statistics!
de: Bitte warten... Konnektoren-Statistiken werden erzeugt!
ru: Подождите ... Генерация статистики соединений компонентов!
zh_cn: 请稍候...正在生成组件连接统计信息！

source: Copy title
de: Titel kopieren
ru: Название копии
zh_cn: 复制标题

# DistractionFree
source: Distraction free (on/off)
de: Ablenkungsfreiheit (an/aus)
ru: Отвлечение бесплатно (вкл / выкл)
zh_cn: 无干扰（开/关）

# HideMenu
source: Hide menu (on/off)
de: Menü verstecken (an/aus)
ru: Скрыть меню (вкл. / Выкл.)
zh_cn: 隐藏菜单（打开/关闭）

# There_is_still_one_running_task
source: There is still one running task (workspace in Play mode). Do you really want to exit CrypTool 2 ?
de: Eine Arbeitsfläche ist noch im Play-Mode. Möchten Sie CrypTool 2 wirklich beenden?
ru: Еще одна работающая задача (рабочая область в режиме воспроизведения). Вы действительно хотите выйти из CrypTool 2?
zh_cn: 仍然有一个正在运行的任务（“播放”模式下的工作区）。您真的要退出CrypTool 2吗？

# SI_CertHash
source: SHA-1 hash of the certificate (X509v3 format)
de: SHA-1-Hash des Zertifikats (X509v3-Format)
ru: SHA-1 хэш сертификата (формат X509v3)
zh_cn: 证书的SHA-1哈希（X509v3格式）

# SI_EffectiveDate
source: Effective date of the certificate
de: Datum Gültigkeitsbeginn des Zertifikats
ru: Дата вступления в силу сертификата
zh_cn: 证书的生效日期

# SI_ExpirationDate
source: Expiration date of the certificate
de: Datum Gültigkeitsende des Zertifikats
ru: Срок действия сертификата
zh_cn: 证书的到期日期

# SI_IsSigned
source: CrypTool 2 is signed
de: CrypTool 2 ist signiert
ru: CrypTool 2 подписан
zh_cn: CrypTool 2已签名

# SI_IssuerName
source: Issuer name of the certificate
de: Name des Ausstellers des Zertifikats
ru: Название эмитента сертификата
zh_cn: 证书的发行人名称

# SI_KeyAlgorithm
source: OID of the key algorithm
de: OID des Schlüssel-Algorithmus
ru: OID ключевого алгоритма
zh_cn: 密钥算法的OID

# SI_PublicKey
source: Public key of the applicant
de: Öffentlicher Schlüssel des Antragstellers
ru: Открытый ключ заявителя
zh_cn: 申请人的公钥

# SI_SerialNumber
source: Serial number of the certificate
de: Seriennummer des Zertifikats
ru: Серийный номер сертификата
zh_cn: 证书的序列号

# SI_Subject
source: Subject
de: Antragsteller des Zertifikats
ru: Предмет
zh_cn: 学科

# SI_ValidCertificate
source: Valid certificate
de: Valides Zertifikat
ru: Действительный сертификат
zh_cn: 有效证书

# ToolTip_Copy
source: Copy tooltip
de: Kurzinfo kopieren
ru: Копировать подсказку
zh_cn: 复制工具提示

# Homepage
source: https://www.cryptool.org/ct2
ru: https://www.CrypTool.org/CrypTool2
zh_cn: https://www.CrypTool.org/CrypTool2

# SI_System_Type
source: System type
de: Systemtyp
ru: Тип системы
zh_cn: 系统类型

# SI_System_Type_32
source: 32-bit operating system
de: 32 bit-Betriebssystem
ru: 32-разрядная операционная система
zh_cn: 32位操作系统

# SI_System_Type_64
source: 64-bit Operating System
de: 64 bit-Betriebssystem
ru: 64-разрядная операционная система
zh_cn: 64位操作系统

# GeneratingFunctionListWaitMessage
source: Please wait... generating function list.
de: Bitte warten... Funktionsliste wird erzeugt.
ru: Подождите ... Генерирует список функций.
zh_cn: 请稍候...正在生成功能列表。

# GeneratingTemplateInfoWaitMessage
source: Please wait... generating template information.
de: Bitte warten... Vorlagen-Informationen werden erzeugt.
ru: Подождите ... Генерирование информации о шаблонах.
zh_cn: 请稍候...正在生成模板信息。

# Generating_TemplateInfo_Title
source: Generating Template Information.
de: Bitte warten... Vorlagen-Informationen werden erzeugt.
ru: Создание информации о шаблонах
zh_cn: 生成模板信息。

# SI_Processor_Name
source: Processor name
de: Prozessorname
ru: Имя процессора
zh_cn: 处理器名称

# SI_CommandLine
source: Command line
de: Kommandozeile
ru: Командная строка
zh_cn: 命令行

# Java_could_not
source: Could not start java.exe. Probably no Java installed.
de: Konnte java.exe nicht starten. Wahrscheinlich kein Java installiert.
zh_cn: 无法启动java.exe。可能没有安装Java。

source: Java version
zh_cn: Java版本

source: Process type
de: Prozesstyp
ru: тип процесса
zh_cn: 工艺类型

source: Loaded/referenced assembly
de: Geladene/referenzierte Assembly
ru: Загруженная/ссылающаяся сборка
zh_cn: 加载/引用的程序集

# SI_Or_newer
source: or newer
de: oder neuer
ru: или новее
zh_cn: 或更新的

source: Category
de: Kategorie
zh_cn: 类别

source: Codes
de: Kodierungen
ru: кодировок
zh_cn: 代号

source: Random numbers
de: Zufallszahlen
ru: случайные числа
zh_cn: 随机数

source: Log window:
de: Protokoll-/Log-Fenster:
ru: Журнал / окно журнала:
zh_cn: 日志窗口：
