Repository: CrypToolProject/CrypTool-2
Catalog: CrypPluginsExperimental/EncryptedVM/Properties/Resources.*.resx
Languages: ru, zh_cn

# EncryptedVM_Assemblerr_Log_Tooltip
source: Assembling log
ru: Сборочный журнал
zh_cn: 组装日志

# EncryptedVM_Assembler_Log_Name
source: Log
ru: Журнал
zh_cn: 日志记录

# EncryptedVM_Assembler_Mode_Name
source: Load from file
ru: Загрузить из файла
zh_cn: 从文件加载

# EncryptedVM_Assembler_Mode_Tooltip
source: Whether to load the source code from a file or not
ru: Загружать ли исходный код из файла или нет
zh_cn: 是否从文件加载源代码

# EncryptedVM_Assembler_Name
source: EncryptedVM Assembler
ru: Ассемблер EncryptedVM
zh_cn: EncryptedVM汇编器

# EncryptedVM_Assembler_Program_Name
source: Program
ru: программа
zh_cn: 程序

# EncryptedVM_Assembler_Program_Tooltip
source: Assembled program
ru: Собранная программа
zh_cn: 组装程序

# EncryptedVM_Assembler_SourceCode_Name
source: Source code
ru: Исходный код
zh_cn: 源代码

# EncryptedVM_Assembler_SourceCode_Tooltip
source: Source code to assemble
ru: Исходный код для сборки
zh_cn: 汇编源代码

# EncryptedVM_Assembler_SourcePath_Name
source: Source code path
ru: Исходный код
zh_cn: 源代码路径

# EncryptedVM_Assembler_SourcePath_Tooltip
source: Path to file containing the source code
ru: Путь к файлу, содержащему исходный код
zh_cn: 包含源代码的文件的路径

# EncryptedVM_Assembler_Tooltip
source: Assemble a program for an encrypted virtual machine
ru: Соберите программу для зашифрованной виртуальной машины
zh_cn: 组装用于加密虚拟机的程序

# EncryptedVM_Keygen_KeySize_Name
source: Power of Poly Modulus (Key size)
ru: Мощность полимодуля (размер ключа)
zh_cn: 多项式的幂（密钥大小）

# EncryptedVM_Keygen_KeySize_Tooltip
source: The power of the polynomial modulus
ru: Мощность модуля многочлена
zh_cn: 多项式模的幂

# EncryptedVM_Keygen_Mode_Name
source: Encrypt
ru: шифровать
zh_cn: 加密

# EncryptedVM_Keygen_Mode_Tooltip
source: Whether to encrypt the program or not
ru: Зашифровать ли программу или нет
zh_cn: 是否加密程序

# EncryptedVM_Keygen_Tooltip
source: Generate keys for an encrypted virtual machine
ru: Создание ключей для зашифрованной виртуальной машины
zh_cn: 为加密的虚拟机生成密钥

# EncryptedVM_Machine_Cycles_Name
source: Cycles
ru: циклы
zh_cn: 周期数

# EncryptedVM_Machine_Cycles_Tooltip
source: Number of cycles
ru: Количество циклов
zh_cn: 循环数

# EncryptedVM_Machine_Name
source: EncryptedVM Machine
ru: Шифрованная машина
zh_cn: EncryptedVM计算机

# EncryptedVM_Machine_Tooltip
source: Virtual encrypted machine
ru: Виртуальная зашифрованная машина
zh_cn: 虚拟加密机

# EncryptedVM_MemoryDisplay_Name
source: EncryptedVM Memory Display
ru: Экран памяти EncryptedVM
zh_cn: 加密的VM内存显示

# EncryptedVM_MemoryDisplay_Tooltip
source: Decrypt the memory of an EncryptedVM machine
ru: Расшифруйте память машины EncryptedVM
zh_cn: 解密EncryptedVM计算机的内存

# EncryptedVM_Memory_Decrypted_Name
source: Decrypted Memory
ru: Расшифрованная память
zh_cn: 解密的内存

# EncryptedVM_Memory_Decrypted_Tooltip
source: The decrypted memory of the machine (or parts of it)
ru: Расшифрованная память машины (или ее частей)
zh_cn: 机器（或其一部分）的解密内存

# EncryptedVM_Memory_Encrypted_Name
source: Encrypted Memory
ru: Зашифрованная память
zh_cn: 加密记忆体

# EncryptedVM_Memory_Encrypted_Tooltip
source: The encrypted memory of the machine
ru: Зашифрованная память машины
zh_cn: 机器的加密内存

# EncryptedVM_Memory_Rows_Name
source: Rows
ru: Ряды
zh_cn: 行数

# EncryptedVM_Memory_Rows_Tooltip
source: Number of rows to decrypt
ru: Количество строк для расшифровки
zh_cn: 要解密的行数

# EncryptionParameters_Name
source: Parameters
ru: параметры
zh_cn: 参量

# EncryptionParameters_Tooltip
source: Parameters for Encoding/Encrypting/Decrypting/Decoding
ru: Параметры для кодирования / шифрования / дешифрования / декодирования
zh_cn: 编码/加密/解密/解码参数

# EvaluationKeys_Name
source: Evaluation Keys
ru: Ключи оценки
zh_cn: 评估键

# EvaluationKeys_Tooltip
source: Keys to perform operations on encrypted data
ru: Ключи для выполнения операций с зашифрованными данными
zh_cn: 对加密数据执行操作的密钥

# PublicKey_Name
source: Public Key
ru: Открытый ключ
zh_cn: 公钥

# PublicKey_Tooltip
source: Key to encrypt data
ru: Ключ для шифрования данных
zh_cn: 加密数据的密钥

# SecretKey_Name
source: Secret Key
ru: Секретный ключ
zh_cn: 密钥

# SecretKey_Tooltip
source: Key to decrypt data
ru: Ключ к расшифровке данных
zh_cn: 解密数据的钥匙

# Ac_specified_multiple_times
source: AC specified multiple times, using first occurence (line: {0})
ru: AC задано несколько раз, используя первое вхождение (строка: {0})
zh_cn: 使用第一次出现，多次指定了AC（行：{0}）

# Failed_to_read_source_code_file
source: Failed to read source code from \"{0}\"
ru: Не удалось прочитать исходный код с \ &quot;{0} \&quot;
zh_cn: 无法从\“ {0} \”读取源代码

# Invalid_program_no_code
source: Invalid Program (contains no code)
ru: Недействительная программа (не содержит кода)
zh_cn: 无效的程序（不包含代码）

source: Invalid Program (too much code)
ru: Недопустимая программа (слишком много кода)
zh_cn: 无效的程序（代码太多）

# Invalid_syntax
source: Invalid Syntax (line: {0}, command: {1})
ru: Недопустимый синтаксис (строка: {0}, команда: {1})
zh_cn: 语法无效（行：{0}，命令：{1}）

# Label_not_found
source: Label \"{0}\" not found (line: {1}, command: {2})
ru: Ярлык \ &quot;{0} \&quot; не найден (строка: {1}, команда: {2})
zh_cn: 找不到标签\“ {0} \”（行：{1}，命令：{2}）

# Label_used_multiple_times
source: Label \"{0}\" used multiple times (line: {1}, command: {2})
ru: Метка \ &quot;{0} \&quot; используется несколько раз (строка: {1}, команда: {2})
zh_cn: 标签\“ {0} \”多次使用（行：{1}，命令：{2}）

# No_ac_defined
source: No AC defined (line: {0})
ru: Не определено AC (строка: {0})
zh_cn: 未定义AC（行：{0}）

# No_pc_defined
source: No PC defined (line: {0})
ru: ПК не определен (строка: {0})
zh_cn: 未定义PC（行：{0}）

# Pc_label_not_found
source: Label \"{0}\" not found (line: {1})
ru: Ярлык \ &quot;{0} \&quot; не найден (строка: {1})
zh_cn: 找不到标签\“ {0} \”（行：{1}）

# Pc_specified_multiple_times
source: PC specified multiple times, using first occurence (line: {0})
ru: ПК задан несколько раз, используя первое вхождение (строка: {0})
zh_cn: 使用第一次出现多次指定PC（行：{0}）

# EncryptedVM_Machine_Output_Name
source: Result
ru: результат
zh_cn: 结果

# EncryptedVM_Machine_Output_Tooltip
source: Result of the program
ru: Результат программы
zh_cn: 程序结果

source: -> DUMP-END <-
ru: -&gt; DUMP-END &lt;-
zh_cn: -&gt;转储结束&lt;-

source: -> DUMP_START <-
ru: -&gt; DUMP_START &lt;-
zh_cn: -&gt; DUMP_START &lt;-

# End_Cycle
source: -> END-PROCESS-CYCLE <-
ru: -&gt; КОНЕЦ-ПРОЦЕСС-ЦИКЛ &lt;-
zh_cn: -&gt;结束过程循环&lt;-

source: Executing Program...
ru: Выполнение программы ...
zh_cn: 执行程序...

# Failed_loading_program
source: Failed to load program
ru: Не удалось загрузить программу
zh_cn: 加载程序失败

source: ...Finished executing program
ru: ... Законченная программа выполнения
zh_cn: ...完成的执行程序

source: Init Machine...
zh_cn: 初始化机器...

source: Loading Program...
ru: Загрузка программы ...
zh_cn: 正在载入程式...

# Phase_1
source: PHASE 1: Fetch
ru: ФАЗА 1: выборка
zh_cn: 阶段1：提取

# Phase_2
source: PHASE 2: Decode
ru: ФАЗА 2: Декодирование
zh_cn: 第二阶段：解码

# Phase_3
source: PHASE 3: Execute
ru: ЭТАП 3: Выполнить
zh_cn: 第三阶段：执行

# Phase_4
source: PHASE 4: Load / Store
ru: ЭТАП 4: загрузка / хранение
zh_cn: 阶段4：加载/存储

# Phase_5
source: PHASE 5: Rewrite registers / flags
ru: ФАЗА 5: Переписать регистры / флаги
zh_cn: 阶段5：重写寄存器/标志

# Start_Cycle
source: -> START-PROCESS-CYCLE <-
ru: -&gt; СТАРТ-ПРОЦЕСС-ЦИКЛ &lt;-
zh_cn: -&gt; START-PROCESS-CYCLE &lt;-

# EncryptedVM_Memory_Mode_Name
source: Run selection algorithm
ru: Выполнить алгоритм выбора
zh_cn: 运行选择算法

# EncryptedVM_Memory_Mode_Tooltip
source: Whether to display rows of the memory or the selection made by the program
ru: Отображать ли строки памяти или выбор, сделанные программой
zh_cn: 是显示内存行还是由程序选择

# EncryptedVM_Memory_Program_Name
source: Memory display program
ru: Программа отображения памяти
zh_cn: 内存显示程序

# EncryptedVM_Memory_Program_Tooltip
source: Program to display the content of the memory
ru: Программа для отображения содержимого памяти
zh_cn: 程序显示内存内容
