Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/QuadraticSieve/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# PluginCaption
source: Quadratic Sieve
de: Quadratisches Sieb
ru: Квадратичное сито
zh_cn: 二次筛

# PluginTooltip
source: Modern factorization algorithm
de: Moderner Faktorisierungsalgorithmus
ru: Современный алгоритм факторизации
zh_cn: 现代分解算法

# InputNumberCaption
source: Number input
de: Eingabezahl
ru: Количество ввода
zh_cn: 号码输入

# InputNumberTooltip
source: Enter the number you want to factorize
de: Die zu faktorisierende natürliche Zahl (als Zeichenfolge)
ru: Введите номер, который вы хотите разделить
zh_cn: 输入您要分解的数字

# OutputFactorsCaption
source: Factors output
de: Ausgabe der Faktoren
ru: Вывод факторов
zh_cn: 因素输出

# OutputFactorsTooltip
source: Your factors will be sent here
de: Hier werden die gefundenen Faktoren ausgegeben.
ru: Ваши факторы будут отправлены здесь
zh_cn: 您的因素将发送到这里

# ChannelCaption
source: Channel
de: Kanal
ru: канал
zh_cn: 渠道

# ChannelTooltip
source: Channel of the Peer2Peer network
de: Kanal des Peer2Peer-Netzwerks
ru: Канал сети Peer2Peer
zh_cn: Peer2Peer网络的渠道

# CoresUsedCaption
source: CoresUsed
de: CPU-Kerne
zh_cn: 使用的磁芯

# CoresUsedTooltip
source: Choose how many cores should be used for sieving
de: Wie viele CPU-Kerne werden für die Faktorisierung verwendet?
ru: Выберите, сколько ядер следует использовать для просеивания
zh_cn: 选择应使用多少个筛芯

# DeleteCacheCaption
source: Delete cache
de: Cache löschen
ru: Удалить кеш
zh_cn: 删除缓存

# DeleteCacheTooltip
source: If checked, this plugin will delete the old cache file before it starts sieving
de: Wenn dieses Kontrollkästchen gesetzt ist, werden die alten Cache-Dateien gelöscht, bevor die Faktorisierung begonnen wird.
ru: Если этот флажок установлен, этот плагин удалит старый файл кеша, прежде чем он начнет просеивать
zh_cn: 如果选中，此插件将在开始筛选之前删除旧的缓存文件。

# StatusKeyButtonCaption
source: Copy status key
de: Kopiere P2P-Status
ru: Копировать статус
zh_cn: 复制状态键

# StatusKeyButtonTooltip
source: Copy status key to clipboard. The key can then be used to upload it together with the job using the P2PEditor.
de: Kopiere den P2P-Status in die Zwischenablage.
ru: Скопировать код состояния в буфер обмена. Затем ключ можно использовать для загрузки его вместе с заданием с помощью P2PEditor.
zh_cn: 将状态键复制到剪贴板。然后可以使用P2PEditor将密钥与作业一起上传。

# UsePeer2PeerCaption
source: Use Peer2Peer
de: Verwende Peer2Peer
ru: Использовать Peer2Peer
zh_cn: 使用Peer2Peer

# UsePeer2PeerTooltip
source: If checked, this plugin will connect to Peer2Peer network to sieve together with other clients
de: Wenn dieses Kontrollkästchen gesetzt ist, verbindet sich das Plugin mit dem Peer2Peer-Netzwerk, um die Faktorisierung auf mehrere Rechner zu verteilen.
ru: Если этот флажок установлен, этот плагин подключится к сети Peer2Peer, чтобы просеять вместе с другими клиентами
zh_cn: 如果选中，此插件将连接到Peer2Peer网络以与其他客户端一起筛分

# Relpack_loaded
source: This relation package was sieved by {0} but we loaded it.
de: Dieses Relationenpaket wurde von {0} gesiebt und wir haben es geladen.
ru: Этот пакет отношений был просеян {0}, но мы его загрузили.
zh_cn: {0}过滤了此关系包，但我们已加载它。

# Relpack_lost
source: This relation package got lost.
de: Dieses Relationenpaket ist verloren gegangen.
ru: Этот пакет отношений потерялся.
zh_cn: 这个关系包迷路了。

# Relpack_other
source: other user
de: einem anderen Benutzer
ru: другой пользователь
zh_cn: 其他使用者

# Relpack_unknown
source: This relation package was sieved by an unknown user and we didn't load it yet.
de: Dieses Relationenpaket wurde von einem unbekannten Benutzer gesiebt und wir haben es noch nicht geladen.
ru: Этот пакет отношений был просеян неизвестным пользователем, и мы его еще не загрузили.
zh_cn: 该关系包已被未知用户筛分，我们尚未加载它。

# Relpack_us
source: This relation package was sieved by us.
de: Dieses Relationenpaket wurde von uns gesiebt.
ru: Этот пакет отношений был просеян нами.
zh_cn: 这个关系包由我们筛选。

source: Active Peers:
de: Aktive Peers:
ru: Активные коллеги:
zh_cn: 活动对等方：

source: Composite Factor
de: Zusammengesetzter Faktor
ru: Композитный фактор
zh_cn: 综合因素

source: Cores used:
de: Verwendete CPUs:
ru: Используемые сердечники:
zh_cn: 使用的核心：

source: days
de: Tage
ru: дней
zh_cn: 天

source: Downloaded:
de: Heruntergeladen:
ru: Скачано:
zh_cn: 已下载：

source: Elapsed:
de: Vergangen:
ru: Прошедшее:
zh_cn: 过去：

source: End:
de: Ende:
ru: Конец:
zh_cn: 结束：

source: Factorlist
de: Faktorenliste
zh_cn: 因子表

# Found_enough_relations
source: Found enough relations. Please wait...
de: Genügend Relationen gefunden. Bitte warten...
ru: Нашли достаточно отношений. Пожалуйста, подождите...
zh_cn: 找到足够的关系。请耐心等待...

source: Found Relations:
de: Gefundene Relationen:
ru: Найденные отношения:
zh_cn: 找到的关系：

source: hours
de: Stunden
ru: часов
zh_cn: 小时

source: State:
de: Status:
ru: Состояние:
zh_cn: 州：

# Local_Sieving_
source: Local Sieving (Not Connected)
de: Lokales Sieben (nicht verbunden)
ru: Местное просеивание (не подключено)
zh_cn: 本地筛选（未连接）

source: minutes
de: Minuten
ru: минут
zh_cn: 分钟

source: Needed Relations:
de: Benötigte Relationen:
ru: Необходимые отношения:
zh_cn: 所需关系：

source: Now sieving first composite factor.
de: Sieben des ersten zusammengesetzten Faktors.
ru: Теперь просеиваем первый составной коэффициент.
zh_cn: 现在筛选第一个复合因子。

source: Other peer finished sieving.
de: Ein Peer hat das Sieben beendet.
ru: Другое сверление с готовым сверлом.
zh_cn: 其他同伴完成了筛分。

source: Peer2Peer
zh_cn: 对等2

source: Prime Factor
de: Primfaktor
ru: Главный фактор
zh_cn: 主要方面

source: Progress
de: Fortschritt
ru: Прогресс
zh_cn: 进展

source: Queue:
de: Warteschlange:
ru: Очередь:
zh_cn: 队列：

source: Remaining:
de: Verbleibend:
ru: Осталось:
zh_cn: 剩余的：

source: Searching trivial factors.
de: Suche triviale Faktoren.
ru: Поиск тривиальных факторов.
zh_cn: 寻找琐碎的因素。

source: seconds
de: Sekunden
ru: секунд
zh_cn: 秒

source: seconds left
de: Sekunden verbleibend
ru: осталось секунд
zh_cn: 还剩几秒钟

# Sieving_finished
source: Sieving finished. Found all {0} factors.
de: Sieben beendet. Alle {0} Faktoren gefunden.
ru: Просеивание закончено. Найдены все факторы {0}.
zh_cn: 筛分完毕。找到所有{0}个因素。

source: Sieving now.
de: Es wird gesiebt.
ru: Просеивание сейчас.
zh_cn: 现在筛选。

# Starting_quadratic_sieve
source: Starting, please wait.
de: Startvorgang, bitte warten.
ru: Запуск, пожалуйста, подождите.
zh_cn: 正在启动，请稍候。

source: Start:
de: Beginn:
ru: Начало:
zh_cn: 开始：

source: Stopped by user.
de: Vom Benutzer gestoppt.
ru: Остановлен пользователем.
zh_cn: 已被用户停止。

source: Time
de: Zeit
ru: Время
zh_cn: 时间

source: Uploaded:
de: Hochgeladen:
ru: Загружено:
zh_cn: 已上传：

source: very soon
de: In Kürze
ru: очень скоро
zh_cn: 很快

source: bits
ru: биты
zh_cn: 位

source: digits
de: Dezimalstellen
ru: цифры
zh_cn: 数字

source: day
de: Tag
ru: День
zh_cn: 天

source: hour
de: Stunde
ru: Час
zh_cn: 小时

source: minute
ru: минут
zh_cn: 分钟

source: second
de: Sekunde
ru: второй
zh_cn: 第二

# NoneLeft
source: None
de: Keine
ru: Никто
zh_cn: 没有

# SievingFinished2
source: Sieving finished.
de: Sieben beendet.
ru: Просеивание закончено.
zh_cn: 筛分完毕。

# Input_too_big_
source: Input too big (Upper limit: 10^274; given input: 10^{0})
de: Eingabe zu groß (Obere Schranke: 10^274; erhaltene Eingabe: 10^{0})
ru: Вход слишком большой (верхний предел: 10^274; заданный вход: 10^{0})
zh_cn: 输入太大（上限：10 ^ 274；给定输入：10 ^ {0}）

source: digit
de: Dezimalstelle
ru: цифра
zh_cn: 数字

source: bit
ru: немного
zh_cn: 一点

# Input_too_small_
source: Please enter a number >= 2
de: Bitte geben Sie eine Zahl >= 2 ein
ru: Пожалуйста, введите число> = 2
zh_cn: 请输入数字&gt; = 2
