Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/WatermarkCreator/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AdvancedModeCap
source: Use advanced mode
de: Expertenmodus
ru: Использовать расширенный режим
zh_cn: 使用进阶模式

# AdvancedModeDes
source: Do you want to use advanced mode which offers more settings to be set by the user?
de: Nutze den Expertenmodus, um mehr Einstellungen vornehmen zu können.
ru: Вы хотите использовать расширенный режим, который предлагает больше настроек для пользователя?
zh_cn: 您是否要使用高级模式，该模式可以提供更多由用户设置的设置？

# AdvancedModeList1
source: No
de: Nein
ru: нет
zh_cn: 没有

# AdvancedModeList2
source: Yes
de: Ja
ru: да
zh_cn: 是

# BotLoc
source: Locate watermark at the bottom of the image
de: Platziere das Wasserzeichen am unteren Bildrand
ru: Найдите водяной знак в нижней части изображения
zh_cn: 在图像底部找到水印

# BoxSizeCap
source: Box size
de: Box-Größe
ru: Размер коробки
zh_cn: 箱体尺寸

# BoxSizeDes
source: The bigger the box, the higher the error correction, the more solid the watermark, but less data can be stored.
de: Je größer die Box, desto stärker ist das Wasserzeichen. Allerdings sinkt die Anzahl der Daten, die gespeichert werden können
ru: Чем больше коробка, тем выше коррекция ошибок, тем более твердый водяной знак, но меньше данных можно сохранить.
zh_cn: 框越大，纠错程度越高，水印越牢固，但可以存储的数据更少。

# ErrorCorrectionCap
source: Error correction
de: Fehler-Korrektur
ru: Исправление ошибки
zh_cn: 错误修正

# ErrorCorrectionDes
source: Set number of bytes used for error correction
de: Anzahl der Bytes, die zur Korrektur von Fehlern verwendet werden.
ru: Задайте количество байтов, используемых для исправления ошибок
zh_cn: 设置用于纠错的字节数

# FontTypeCap
source: Font type
de: Schriftart
ru: Тип шрифта
zh_cn: 字体类型

# FontTypeDes
source: Font type that is used for the watermark
de: Schriftart, die für das Wasserzeichen genutzt wird
ru: Тип шрифта, который используется для водяного знака
zh_cn: 用于水印的字体类型

# ImageCaption
source: Image
de: Bild
ru: Образ
zh_cn: 图片

# ImageTooltip
source: The image which should be used to embed/extract a digital watermark.
de: Das Bild, dem ein Wasserzeichen hinzugefügt werden soll oder aus dem ein Wasserzeichen extrahiert werden soll.
ru: Изображение, которое должно использоваться для вставки / извлечения цифрового водяного знака.
zh_cn: 用于嵌入/提取数字水印的图像。

# LocationPercentageCap
source: Custom location of the watermark
de: Freie Platzierung des Wasserzeichens
ru: Пользовательское расположение водяного знака
zh_cn: 水印的自定义位置

# LocationPercentageDes
source: Allows to manually set the location of the watermark. The further to the right you put the slider, the further up to the top the watermark will move.
de: Erlaubt eine freie Platzierung des Wasserzeichens. Je weiter nach rechts der Schieber gezogen wird, desto weiter nach oben wird das Wasserzeichen gesetzt
ru: Позволяет вручную установить местоположение водяного знака. Чем дальше справа вы поместите слайдер, тем дальше вверх по воде будет перемещаться водяной знак.
zh_cn: 允许手动设置水印的位置。将滑块向右移得越远，水印将越往顶部移动。

# ModificationTypeCap
source: Modification type
de: Art der Modifizierung
ru: Тип модификации
zh_cn: 修改类型

# ModificationTypeDes
source: Choose what kind of modification should be applied to the input image
de: Wähle aus, welche Modifizierung mit der Eingabe vorgenommen wird
ru: Выберите, какая модификация должна быть применена к входному изображению
zh_cn: 选择应对输入图像应用哪种修改

# NoPictureError
source: Please provide a valid image as a carrier for the watermark, using the file input component
de: Bitte nutzen Sie die Komponente "Dateieingabe", um ein Bild als Eingabe hinzuzufügen.
ru: Предоставьте действительное изображение в качестве носителя для водяного знака, используя компонент ввода файлов
zh_cn: 请使用文件输入组件提供有效的图像作为水印的载体

# NoTextError
source: Please provide a string to be added to the image as a watermark, using the text input component
de: Bitte nutzen Sie die Komponente "Texteingabe", um einen String, der als Wasserzeichen verwendet wird, als Eingabe hinzuzufügen.
ru: Укажите строку, которая будет добавлена ​​к изображению в виде водяного знака, используя компонент ввода текста
zh_cn: 请使用文本输入组件提供一个字符串，以将其作为水印添加到图像中

# OpacityCap
source: Opacity of the watermark
de: Deckkraft des Wasserzeichens
ru: Непрозрачность водяного знака
zh_cn: 水印的不透明度

# OpacityDes
source: Opacity of the watermark. A higher value means more opacity and a stronger watermark, though it'll also become more visible. Maximum value is 1000. A value larger or equal 500 is recommended for a good result.
de: Deckkraft des Wasserzeichens. Ein höherer Wert führt zu einer höheren Deckkraft, wodurch das Wasserzeichen stabiler wird. Allerdings wird es dadurch auch sichtbarer. Der maximale Wert ist 1000; für ein gutes Ergebnis wird ein Wert von über 500 empfohlen.
ru: Непрозрачность водяного знака. Более высокое значение означает большую непрозрачность и более сильный водяной знак, хотя он также станет более заметным. Максимальное значение - 1000. Для хорошего результата рекомендуется значение больше или равно 500.
zh_cn: 水印的不透明度。更高的值意味着更多的不透明度和更强的水印，尽管它也会变得更加可见。最大值为1000。建议使用大于或等于500的值以获得良好的效果。

# OtherLoc
source: Choose a custom location
de: Wähle eine eigene Platzierung
ru: Выберите пользовательское местоположение
zh_cn: 选择一个自定义位置

# PluginCaption
source: Watermark Creator
de: Wasserzeichen-Generator
ru: Создатель водяных знаков
zh_cn: 水印创作者

# PluginTooltip
source: Writes or extracts a digital watermark of an image
de: Schreibt oder extrahiert ein digitales Wasserzeichen eines Bildes
ru: Записывает или извлекает цифровой водяной знак изображения
zh_cn: 写入或提取图像的数字水印

# Seed
source: Set some random number that will be used as seed
de: Wähle eine Zufallszahl
ru: Установите случайное число, которое будет использоваться как семя
zh_cn: 设置一些随机数作为种子

source: Seed 1
de: Zufallszahl 1
ru: Семя 1
zh_cn: 种子1

source: Seed 2
de: Zufallszahl 2
ru: Семя 2
zh_cn: 种子2

# TextCaption
source: Embedded text
de: Eingebetteter Text
ru: Встроенный текст
zh_cn: 内嵌文字

# TextSizeMaxCap
source: Maximum text size
de: Maximale Schriftgröße
ru: Максимальный размер текста
zh_cn: 最大文字大小

# TextSizeMaxDes
source: Maximum size of the text to be used when embedding the watermark. Internally, the maximum possible size that fits the whole text onto the image in one line will be chosen.
de: Maximale Größe des Textes. Sollte diese zu groß für das Bild sein, wird intern eine Größe berechnet, sodass der Text in einer Zeile auf das Bild passt.
ru: Максимальный размер текста, который будет использоваться при встраивании водяного знака. Внутри выбирается максимально возможный размер, который соответствует всему тексту на изображении в одной строке.
zh_cn: 嵌入水印时要使用的文本的最大大小。在内部，将选择将整个文本放在一行中的最大可能大小。

# TextTooltip
source: Extracted text that was embedded in the image
de: Extrahiere das versteckte Wasserzeichen aus dem Bild
ru: Извлеченный текст, встроенный в изображение
zh_cn: 提取图像中嵌入的文本

# TopLoc
source: Locate at top of the image
de: Platziere das Wasserzeichen am oberen Bildrand
ru: Найдите в верхней части изображения
zh_cn: 定位在图片的顶部

# WatermarkCaption
source: Watermark
de: Wasserzeichen
ru: водяной знак
zh_cn: 水印

# WatermarkCreatorSettings_ModificationType_EmbedInvisibleText
source: Embed invisible watermark into the image
de: Bette unsichtbares Wasserzeichen in das Bild ein
ru: Вставить невидимый водяной знак в изображение
zh_cn: 在图像中嵌入不可见的水印

# WatermarkCreatorSettings_ModificationType_EmbedText
source: Embed visible text into the image
de: Bette sichtbaren Text in das Bild ein
ru: Вставить видимый текст в изображение
zh_cn: 将可见文本嵌入图像

# WatermarkCreatorSettings_ModificationType_ExtractText
source: Extract hidden Watermark from image
de: Extrahiere verstecktes Wasserzeichen aus dem Bild
ru: Извлечь скрытый водяной знак из изображения
zh_cn: 从图像中提取隐藏的水印

# WatermarkImageCaption
source: Image with watermark
de: Bild mit Wasserzeichen
ru: Изображение с водяным знаком
zh_cn: 带水印的图像

# WatermarkImageTooltip
source: Image with text added to it as a watermark
de: Bild, in das ein Text als Wasserzeichen eingefügt wurde
ru: Изображение с текстом, добавленным к нему как водяной знак
zh_cn: 带有文本作为水印添加到图像的图像

# WatermarkLocationCap
source: Location of the watermark
de: Platzierung des Wasserzeichens
ru: Расположение водяного знака
zh_cn: 水印的位置

# WatermarkLocationDes
source: Choose the location where the watermark will be placed on the image.
de: Wähle den Ort, wo auf dem Bild das Wasserzeichen eingefügt wird.
ru: Выберите место, где водяной знак будет помещен на изображение.
zh_cn: 选择将水印放置在图像上的位置。

# WatermarkTooltip
source: Text to be added to the image as a watermark
de: Text, der dem Bild als Wasserzeichen hinzugefügt wird
ru: Текст, который будет добавлен к изображению в виде водяного знака
zh_cn: 要作为水印添加到图像的文本
