Repository: CrypToolProject/CrypTool-2
Catalog: CrypPluginsExperimental/SigabaBruteforce/Properties/Resources.*.resx
Languages: ru, zh_cn

# ActionTooltip
source: Choose the mode of operation
ru: Выберите режим работы
zh_cn: 选择操作方式

# AnalysisUseRotor1Caption
source: Code rotor 1
ru: Кодовый ротор 1
zh_cn: 编码转子1

# AnalysisUseRotor2Caption
source: Code rotor 2
ru: Кодовый ротор 2
zh_cn: 编码转子2

# AnalysisUseRotor3Caption
source: Code rotor 3
ru: Кодовый ротор 3
zh_cn: 编码转子3

# AnalysisUseRotor4Caption
source: Code rotor 4
ru: Кодовый ротор 4
zh_cn: 编码转子4

# AnalysisUseRotor9Caption
source: Code rotor 9
ru: Кодовый ротор 9
zh_cn: 编码转子9

# AnalysisUseRotor5Caption
source: Code rotor 5
ru: Кодовый ротор 5
zh_cn: 编码转子5

# AnalysisUseRotor6Caption
source: Code rotor 6
ru: Кодовый ротор 6
zh_cn: 编码转子6

# AnalysisUseRotor7Caption
source: Code rotor 7
ru: Кодовый ротор 7
zh_cn: 编码转子7

# AnalysisUseRotor8Caption
source: Code rotor 8
ru: Кодовый ротор 8
zh_cn: 编码转子8

# AnalysisUseRotor10Caption
source: Code rotor 10
ru: Кодовый ротор 10
zh_cn: 编码转子10

# AnalyzeCipherRotors1Caption
source: Cipher rotor 1
ru: Шифр 1
zh_cn: 密码转子1

# AnalyzeCipherRotors2Caption
source: Cipher rotor 2
ru: Шифр 2
zh_cn: 密码转子2

# AnalyzeCipherRotors3Caption
source: Cipher rotor 3
ru: Шифр 3
zh_cn: 密码转子3

# AnalyzeCipherRotors4Caption
source: Cipher rotor 4
ru: Шифратор 4
zh_cn: 密码转子4

# AnalyzeCipherRotors5Caption
source: Cipher rotor 5
ru: Шифровальный ротор 5
zh_cn: 密码转子5

# AnalyzeControlRotors1Caption
source: Conrol rotor 1
ru: Коронный ротор 1
zh_cn: 控制转子1

# AnalyzeControlRotors2Caption
source: Conrol rotor 2
ru: Коронный ротор 2
zh_cn: 控制转子2

# AnalyzeControlRotors3Caption
source: Conrol rotor 3
ru: Ротор 3
zh_cn: 控制转子3

# AnalyzeControlRotors4Caption
source: Conrol rotor 4
ru: Коронный ротор 4
zh_cn: 控制转子4

# AnalyzeControlRotors5Caption
source: Conrol rotor 5
ru: Рулон ротора 5
zh_cn: 控制转子5

# AnalyzeIndexRotors1Caption
source: Index rotor 1
ru: Индексный ротор 1
zh_cn: 分度转子1

# AnalyzeIndexRotors2Caption
source: Index rotor 2
ru: Индексный ротор 2
zh_cn: 分度转子2

# AnalyzeIndexRotors3Caption
source: Index rotor 3
ru: Индексный ротор 3
zh_cn: 分度转子3

# AnalyzeIndexRotors4Caption
source: Index rotor 4
ru: Индексный ротор 4
zh_cn: 分度转子4

# AnalyzeIndexRotors5Caption
source: Index rotor 5
ru: Индексный ротор 5
zh_cn: 分度转子5

# CalculateKeypaceCaption
source: Calculate
ru: подсчитывать
zh_cn: 计算

# CalculateKeypaceTooltip
source: Calculates the keyspace of the current settings
ru: Вычисляет пространство клавиш текущих настроек
zh_cn: 计算当前设置的键空间

# CaseHandlingCaption
source: Case handling
ru: Обработка корпуса
zh_cn: 案件处理

# CaseHandlingList1
source: Preserve case
ru: Запасной корпус
zh_cn: 保留大小写

# CaseHandlingList2
source: Convert to upper
ru: Преобразовать в верхнюю
zh_cn: 转换为上

# CaseHandlingList3
source: Convert to lower
ru: Преобразовать в нижний
zh_cn: 转换为较低

# CaseHandlingTooltip
source: What should be done with upper and lower case letters?
ru: Что нужно делать с помощью строчных и строчных букв?
zh_cn: 大写和小写字母应该怎么做？

# Cipher1AnalysisOptionsGroup
source: Choose cipher rotor 1 from
ru: Выберите ротор шифрования 1 из
zh_cn: 从中选择密码转子1

# Cipher2AnalysisOptionsGroup
source: Choose cipher rotor 2 from
ru: Выберите шифратор 2 из
zh_cn: 从中选择密码转子2

# Cipher3AnalysisOptionsGroup
source: Choose cipher rotor 3 from
ru: Выберите ротор 3 шифрования из
zh_cn: 从中选择密码转子3

# Cipher4AnalysisOptionsGroup
source: Choose cipher rotor 4 from
ru: Выберите шифратор 4 с
zh_cn: 从中选择密码转子4

# Cipher5AnalysisOptionsGroup
source: Choose cipher rotor 5 from
ru: Выберите шифратор 5 с
zh_cn: 从中选择密码转子5

# CipherGroup
source: Alphabet maze
ru: Лабиринт лабиринта
zh_cn: 字母迷宫

# CipherKeyCaption
source: Cipher key
ru: Ключ шифрования
zh_cn: 密码键

# CipherKeyTooltip
source: Defines the positions of the cipher rotors
ru: Определяет положения шифраторов
zh_cn: 定义密码转子的位置

# CipherRotor1Caption
source: Cipher rotor 1 (most left)
ru: Шифр 1 (самый левый)
zh_cn: 密码转子1（最左侧）

# CipherRotor1FromCaption
source: Cipher rotor 1: From
ru: Шифр 1: От
zh_cn: 密码转子1：从

# CipherRotor1ReverseCaption
source: Reverse
ru: Задний ход
zh_cn: 逆转

# CipherRotor1Tooltip
source: Defines the typ of the first cipher rotor
ru: Определяет тип первого ротора шифрования
zh_cn: 定义第一个密码转子的类型

# CipherRotor2Caption
source: Cipher rotor 2
ru: Шифр 2
zh_cn: 密码转子2

# CipherRotor2FromCaption
source: Cipher rotor 2: From
ru: Шифр 2: От
zh_cn: 密码转子2：从

# CipherRotor2ReverseTooltip
source: Check for plug the rotor heads up
ru: Проверить, подключены ли головки ротора
zh_cn: 检查转子头是否堵塞

# CipherRotor2Tooltip
source: Defines the typ of the second cipher rotor
ru: Определяет тип второго ротора шифрования
zh_cn: 定义第二个密码转子的类型

# CipherRotor3Caption
source: Cipher Rotor 3
ru: Шифратор 3
zh_cn: 密码转子3

# CipherRotor3ToolTip
source: Defines the type of the third cipher rotor
ru: Определяет тип третьего ротора шифрования
zh_cn: 定义第三个密码转子的类型

# CipherRotor4Caption
source: Cipher Rotor 4
ru: Шифратор 4
zh_cn: 密码转子4

# CipherRotor4Tooltip
source: Defines the type of the fourth cipher rotor
ru: Определяет тип четвертого ротора шифрования
zh_cn: 定义第四个密码转子的类型

# CipherRotor5Caption
source: Cipher Rotor 5 (most right)
ru: Шифр Ротор 5 (самый правый)
zh_cn: 密码转子5（最右侧）

# CipherRotor5Tooltip
source: Defines the type of the fith cipher rotor
ru: Определяет тип ротора fith cipher
zh_cn: 定义合适的密码转子的类型

# ControlGroup
source: Stepping maze
ru: Шаговый лабиринт
zh_cn: 迷宫

# ControlKeyCaption
source: Control key
ru: Клавиша управления
zh_cn: 控制键

# ControlKeyTooltip
source: Defines the positions of the control rotors
ru: Определяет положения управляющих роторов
zh_cn: 定义控制转子的位置

# ControlRotor1Caption
source: Control rotor 1 (most right)
ru: Управляющий ротор 1 (самый правый)
zh_cn: 控制转子1（最右侧）

# ControlRotor1ReverseCaption
source: Reverse
ru: Задний ход
zh_cn: 逆转

# ControlRotor1Tooltip
source: Defines the typ of the first control rotor
ru: Определяет тип первого управляющего ротора
zh_cn: 定义第一个控制转子的类型

# ControlRotor2Caption
source: Control rotor 2
ru: Управляющий ротор 2
zh_cn: 控制转子2

# ControlRotor2ReverseTooltip
source: Click for plug in the rotor heads up
ru: Нажмите, чтобы подключить головки ротора вверх
zh_cn: 单击以插入转子头

# ControlRotor2Tooltip
source: Defines the typ of the second control rotor
ru: Определяет тип второго управляющего ротора
zh_cn: 定义第二个控制转子的类型

# ControlRotor3Caption
source: Control rotor 3
ru: Управляющий ротор 3
zh_cn: 控制转子3

# ControlRotor3Tooltip
source: Defines the type of the third control rotor
ru: Определяет тип третьего управляющего ротора
zh_cn: 定义第三个控制转子的类型

# ControlRotor4Caption
source: Control rotor 4
ru: Управляющий ротор 4
zh_cn: 控制转子4

# ControlRotor4ToolTip
source: Defines the type of the fourth control rotor
ru: Определяет тип четвертого управляющего ротора
zh_cn: 定义第四个控制转子的类型

# ControlRotor5Caption
source: Control rotor 5 (most left)
ru: Управляющий ротор 5 (самый левый)
zh_cn: 控制转子5（最左侧）

# ControlRotor5ToolTip
source: Defines the type of the fith control rotor
ru: Определяет тип управляющего ротора fith
zh_cn: 定义合适的控制转子类型

# IndexGroup
source: Index maze
ru: Лабиринт индекса
zh_cn: 索引迷宫

# IndexKeyCaption
source: Index key
ru: Ключ индекса
zh_cn: 索引键

# IndexKeyTooltip
source: Defines the positions of the index rotors
ru: Определяет положения индексных роторов
zh_cn: 定义分度转子的位置

# IndexRotor1Caption
source: Index Rotor 1 (most left)
ru: Индекс Ротор 1 (самый левый)
zh_cn: 索引转子1（最左侧）

# IndexRotor1Tooltip
source: Defines the type of the first index rotor
ru: Определяет тип первого ротора индекса
zh_cn: 定义第一个分度转子的类型

# IndexRotor2Caption
source: Index Rotor 2
ru: Индексный ротор 2
zh_cn: 索引转子2

# IndexRotor2Tooltip
source: Defines the type of the second index rotor
ru: Определяет тип второго ротора индекса
zh_cn: 定义第二个分度转子的类型

# IndexRotor3Caption
source: Index Rotor 3
ru: Индексный ротор 3
zh_cn: 索引转子3

# IndexRotor3Tooltip
source: Defines the type of the third index rotor
ru: Определяет тип третьего ротора индекса
zh_cn: 定义第三分度转子的类型

# IndexRotor4Caption
source: Index Rotor 4
ru: Индексный ротор 4
zh_cn: 索引转子4

# IndexRotor4Tooltip
source: Defines the type of the fourth index rotor
ru: Определяет тип четвертого ротора индекса
zh_cn: 定义第四分度转子的类型

# IndexRotor5Caption
source: Index Rotor 5 (most right)
ru: Index Rotor 5 (самый правый)
zh_cn: 索引转子5（最右侧）

# IndexRotor5Tooltip
source: Defines the type of the fith index rotor
ru: Определяет тип ротора индекса fith
zh_cn: 定义菲斯指数转子的类型

# KeyspaceCaption
source: Keyspace:
ru: пространство ключей:
zh_cn: 键空间：

# PluginCaption
source: SigabaBruteforce
zh_cn: 科目蛮力

# PluginToolTip
source: Analyzing tool for the American rotor cipher machine SIGABA
ru: Аналитический инструмент для американской роторной шифровой машины SIGABA
zh_cn: 美国转子密码机SIGABA的分析工具

# SigabaSettings_SigabaSettings_Cipher
source: Encrypt
ru: шифровать
zh_cn: 加密

# SigabaSettings_SigabaSettings_Decipher
source: Decrypt
ru: расшифровывать
zh_cn: 解密

# TextOptionsGroup
source: Text options
ru: Параметры текста
zh_cn: 文字选项

# ToCaption
source: To
ru: к
zh_cn: 至

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
ru: Неизвестная обработка символов
zh_cn: 未知符号处理

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
ru: Игнорировать (оставить без изменений)
zh_cn: 忽略（保留未修改的内容）

# UnknownSymbolHandlingList2
source: Remove
ru: Удалить
zh_cn: 去掉

# UnknownSymbolHandlingList3
source: Replace with 'X'
ru: Заменить на «X»
zh_cn: 替换为“ X”

# UnknownSymbolHandlingTooltip
source: What should be done with input characters that are not in the alphabet?
ru: Что делать с входными символами, которые не находятся в алфавите?
zh_cn: 字母以外的输入字符应该怎么办？

# CipherKeyHeader
source: Cipher key
ru: Ключ шифрования
zh_cn: 密码键

# CipherRotorsHeader
source: Cipher wheels
ru: Шины для шифрования
zh_cn: 密码轮

# Control1AnalysisOptionsGroup
source: Choose control rotor 1 from
ru: Выберите управляющий ротор 1 из
zh_cn: 从中选择控制转子1

# Control2AnalysisOptionsGroup
source: Choose control rotor 2 from
ru: Выберите управляющий ротор 2 из
zh_cn: 从中选择控制转子2

# Control3AnalysisOptionsGroup
source: Choose control rotor 3 from
ru: Выберите управляющий ротор 3 из
zh_cn: 从中选择控制转子3

# Control4AnalysisOptionsGroup
source: Choose control rotor 4 from
ru: Выберите управляющий ротор 4 из
zh_cn: 从中选择控制转子4

# Control5AnalysisOptionsGroup
source: Choose control rotor 5 from
ru: Выберите управляющий ротор 5 из
zh_cn: 从中选择控制转子5

# ControlKeyHeader
source: Control key
ru: Клавиша управления
zh_cn: 控制键

# ControlRotorsHeader
source: Control wheels
ru: Контрольные колеса
zh_cn: 控制轮

# ElapsedLabel
source: Elapsed:
ru: Прошедшее:
zh_cn: 过去：

# EndLabel
source: End:
ru: Конец:
zh_cn: 结束：

# IndexAnalysisUseRotor1Caption
source: Index rotor 1
ru: Индексный ротор 1
zh_cn: 分度转子1

# IndexAnalysisUseRotor2Caption
source: Index rotor 2
ru: Индексный ротор 2
zh_cn: 分度转子2

# IndexAnalysisUseRotor3Caption
source: Index rotor 3
ru: Индексный ротор 3
zh_cn: 分度转子3

# IndexAnalysisUseRotor4Caption
source: Index rotor 4
ru: Индексный ротор 4
zh_cn: 分度转子4

# IndexAnalysisUseRotor5Caption
source: Index rotor 5
ru: Индексный ротор 5
zh_cn: 分度转子5

# IndexKeyHeader
source: Index key
ru: Ключ индекса
zh_cn: 索引键

# IndexRotorHeader
source: Index wheels
ru: Индексные колеса
zh_cn: 索引轮

# Keys_secLabel
source: Keys/Second:
ru: Ключи / Second:
zh_cn: 按键/第二个：

# RemainingLabel
source: Remaining:
ru: Осталось:
zh_cn: 剩余的：

# StartLabel
source: Start:
ru: Начало:
zh_cn: 开始：

# TextHeader
source: Text
ru: Текст
zh_cn: 文本

# ValueHeader
source: Value
ru: Стоимость
zh_cn: 值

# RevCaption
source: Rotor orientation
ru: Ориентация ротора
zh_cn: 转子方向

# OriNormalCaption
source: normal
ru: нормальный
zh_cn: 正常

# OriReverseCaption
source: reverse
ru: задний ход
zh_cn: 逆转

# OriBothCaption
source: both
ru: и то и другое
zh_cn: 都

# LocalLabel
source: Main
ru: Главный
zh_cn: 主要

# TopTenLabel
source: Top Ten
ru: Топ десять
zh_cn: 前十

# CipherRotor3FromCaption
source: Cipher rotor 3: From
ru: Шифр 3: От
zh_cn: 密码转子3：从

# CipherRotor4FromCaption
source: Cipher rotor 4: From
ru: Шифр 4: От
zh_cn: 密码转子4：从

# CipherRotor5FromCaption
source: Cipher rotor 5: From
ru: Шифр 5: От
zh_cn: 密码转子5：从

# ControlRotor1FromCaption
source: Control rotor 1: From
ru: Управляющий ротор 1: От
zh_cn: 控制转子1：从

# ControlRotor2FromCaption
source: Control rotor 2: From
ru: Управляющий ротор 2: От
zh_cn: 控制转子2：从

# ControlRotor3FromCaption
source: Control rotor 3: From
ru: Управляющий ротор 3: От
zh_cn: 控制转子3：从

# ControlRotor4FromCaption
source: Control rotor 4: From
ru: Управляющий ротор 4: От
zh_cn: 控制转子4：从

# ControlRotor5FromCaption
source: Control rotor 5: From
ru: Управляющий ротор 5: От
zh_cn: 控制转子5：从

# FromTooltip
source: Select the first letter of the search interval
ru: Выберите первую букву интервала поиска
zh_cn: 选择搜索间隔的首字母

# IndexRotor1FromCaption
source: Index rotor 1: From
ru: Индексный ротор 1: От
zh_cn: 索引转子1：从

# IndexRotor2FromCaption
source: Index rotor 2: From
ru: Индексный ротор 2: От
zh_cn: 索引转子2：从

# IndexRotor3FromCaption
source: Index rotor 3: From
ru: Индексный ротор 3: От
zh_cn: 索引转子3：从

# IndexRotor4FromCaption
source: Index rotor 4: From
ru: Индексный ротор 4: От
zh_cn: 索引转子4：从

# IndexRotor5FromCaption
source: Index rotor 5: From
ru: Индексный ротор 5: От
zh_cn: 索引转子5：从

# PositionOptionsGroup
source: Rotor start positions
ru: Позиции запуска ротора
zh_cn: 转子起始位置

# RotorAnalysisGroup
source: Show analysis options for
ru: Показать параметры анализа для
zh_cn: 显示分析选项

# ToTooltip
source: Select the last letter of the search interval
ru: Выберите последнюю букву интервала поиска
zh_cn: 选择搜索间隔的最后一个字母

# AnalyzeRotorsTooltip
source: Show/hide options for this rotor.
ru: Показать / скрыть параметры для этого ротора.
zh_cn: 显示/隐藏此转子的选项。

# Cipher10AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 10.
ru: Попробуйте этот ротор в качестве ротора шифрования 10.
zh_cn: 尝试将此转子用作密码转子10。

# Cipher1AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 1.
ru: Попробуйте этот ротор в качестве ротора шифрования 1.
zh_cn: 尝试将此转子用作密码转子1。

# Cipher2AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 2.
ru: Попробуйте этот ротор в качестве шифратора 2.
zh_cn: 尝试将此转子用作密码转子2。

# Cipher3AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 3.
ru: Попробуйте этот ротор в качестве шифра 3.
zh_cn: 尝试将此转子作为密码转子3。

# Cipher4AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 4.
ru: Попробуйте этот ротор в качестве шифратора 4.
zh_cn: 尝试将此转子作为密码转子4。

# Cipher5AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 5.
ru: Попробуйте этот ротор в качестве шифра 5.
zh_cn: 尝试将此转子用作密码转子5。

# Cipher6AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 6.
ru: Попробуйте этот ротор в качестве шифратора 6.
zh_cn: 尝试将此转子用作密码转子6。

# Cipher7AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 7.
ru: Попробуйте этот ротор в качестве шифратора 7.
zh_cn: 尝试将此转子用作密码转子7。

# Cipher8AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 8.
ru: Попробуйте этот ротор в качестве шифратора 8.
zh_cn: 尝试将此转子用作密码转子8。

# Cipher9AnalysisUseRotorTooltip
source: Try this rotor as cipher rotor 9.
ru: Попробуйте этот ротор в качестве шифратора 9.
zh_cn: 尝试将此转子用作密码转子9。

# Control10AnalysisUseRotorTooltip
source: Try this rotor as control rotor 10.
ru: Попробуйте этот ротор в качестве управляющего ротора 10.
zh_cn: 尝试将此转子作为控制转子10。

# Control1AnalysisUseRotorTooltip
source: Try this rotor as control rotor 1.
ru: Попробуйте этот ротор в качестве управляющего ротора 1.
zh_cn: 尝试将此转子作为控制转子1。

# Control2AnalysisUseRotorTooltip
source: Try this rotor as control rotor 2.
ru: Попробуйте этот ротор в качестве управляющего ротора 2.
zh_cn: 尝试将此转子作为控制转子2。

# Control3AnalysisUseRotorTooltip
source: Try this rotor as control rotor 3.
ru: Попробуйте этот ротор в качестве управляющего ротора 3.
zh_cn: 尝试将此转子作为控制转子3。

# Control4AnalysisUseRotorTooltip
source: Try this rotor as control rotor 4.
ru: Попробуйте этот ротор в качестве управляющего ротора 4.
zh_cn: 尝试将此转子作为控制转子4。

# Control5AnalysisUseRotorTooltip
source: Try this rotor as control rotor 5.
ru: Попробуйте этот ротор в качестве управляющего ротора 5.
zh_cn: 尝试将此转子作为控制转子5。

# Control6AnalysisUseRotorTooltip
source: Try this rotor as control rotor 6.
ru: Попробуйте этот ротор в качестве управляющего ротора 6.
zh_cn: 尝试将此转子作为控制转子6。

# Control7AnalysisUseRotorTooltip
source: Try this rotor as control rotor 7.
ru: Попробуйте этот ротор в качестве управляющего ротора 7.
zh_cn: 尝试将此转子作为控制转子7。

# Control8AnalysisUseRotorTooltip
source: Try this rotor as control rotor 8.
ru: Попробуйте этот ротор в качестве управляющего ротора 8.
zh_cn: 尝试将此转子作为控制转子8。

# Control9AnalysisUseRotorTooltip
source: Try this rotor as control rotor 9.
ru: Попробуйте этот ротор в качестве управляющего ротора 9.
zh_cn: 尝试将此转子作为控制转子9。

# Index1AnalysisOptionsGroup
source: Choose index rotor 1 from
ru: Выберите индексный ротор 1 из
zh_cn: 从中选择分度转子1

# Index1AnalysisUseRotorTooltip
source: Try this rotor as index rotor 1.
ru: Попробуйте этот ротор как индексный ротор 1.
zh_cn: 尝试将此转子用作分度转子1。

# Index2AnalysisOptionsGroup
source: Choose index rotor 2 from
ru: Выберите индексный ротор 2 из
zh_cn: 从中选择分度转子2

# Index2AnalysisUseRotorTooltip
source: Try this rotor as index rotor 2.
ru: Попробуйте этот ротор в качестве указателя ротора 2.
zh_cn: 尝试将此转子用作分度转子2。

# Index3AnalysisOptionsGroup
source: Choose index rotor 3 from
ru: Выберите индексный ротор 3 из
zh_cn: 从中选择索引转子3

# Index3AnalysisUseRotorTooltip
source: Try this rotor as index rotor 3.
ru: Попробуйте этот ротор как индексный ротор 3.
zh_cn: 尝试将此转子用作分度转子3。

# Index4AnalysisOptionsGroup
source: Choose index rotor 4 from
ru: Выберите индексный ротор 4 из
zh_cn: 从中选择分度转子4

# Index4AnalysisUseRotorTooltip
source: Try this rotor as index rotor 4.
ru: Попробуйте этот ротор как индексный ротор 4.
zh_cn: 尝试将此转子用作分度转子4。

# Index5AnalysisOptionsGroup
source: Choose index rotor 5 from
ru: Выберите индексный ротор 5 из
zh_cn: 从中选择分度转子5

# Index5AnalysisUseRotorTooltip
source: Try this rotor as index rotor 5.
ru: Попробуйте этот ротор как индексный ротор 5.
zh_cn: 尝试将此转子用作分度转子5。

# InputCaption
source: Input
ru: вход
zh_cn: 输入值

# InputTooltip
source: Input
ru: вход
zh_cn: 输入值

# KeyspaceTooltip
source: Calculate the size of the key space (in bits) resulting from the given settings.
ru: Вычислите размер пространства ключа (в битах) в результате заданных настроек.
zh_cn: 计算从给定设置得到的密钥空间的大小（以位为单位）。

# OutputCaption
source: Output
ru: Вывод
zh_cn: 输出量

# OutputTooltip
source: Output
ru: Вывод
zh_cn: 输出量

# RevTooltip
source: Choose the orientation(s) in which to use this rotor.
ru: Выберите ориентацию (ы), в которой следует использовать этот ротор.
zh_cn: 选择使用该转子的方向。
