Repository: CrypToolProject/CrypTool-2
Catalog: WorkspaceManagerModel/Properties/Resources.*.resx
Languages: de, zh_cn

# ExecutionEngine_Execute_Exception_occured_during_startup_of_Workspace___0_
source: Exception occured during startup of Workspace: {0}
de: Ein Fehler trat während des Startens der Arbeitsfläche auf: {0}
zh_cn: 工作空间启动期间发生异常：{0}

# ExecutionEngine_BenchmarkTimeout_Executing_at__0_0_0__Plugins_sec_
source: Executing at {0:0,0} Plugins\sec.
de: Führe {0:0,0} Plugins\Sekunde aus.
zh_cn: 在{0：0,0} Plugins \ sec处执行。

source: Exception occured during update of GUI of Workspace: {0}
de: Ein Fehler trat während des Updates der Oberfläche des Editors auf: {0}
zh_cn: 更新工作区的GUI期间发生异常：{0}

# ExecutionEngine_Stop_Start_stopping_ExecutionEngine
source: Start stopping ExecutionEngine
de: Beginne das Stoppen der Ausführungsmaschine
zh_cn: 开始停止ExecutionEngine

# ExecutionEngine_Stop_Waiting_for_all_threads_to_stop
source: Waiting for all threads to stop
de: Warte auf das Stoppen aller Threads
zh_cn: 等待所有线程停止

source: Thread {0} did not stop in {1} miliseconds and will be aborted now.
de: Thread {0} beendete sich nicht selbstständig innerhalb {1} Millisekunden und wird nun hart beendet
zh_cn: 线程{0}在{1}毫秒内没有停止，现在将被中止。

# ExecutionEngine_Stop_Exception_during_waiting_for_thread___0___to_stop___1_
source: Exception during waiting for thread '{0}' to stop: {1}
de: Ein Fehler trat während des Wartens auf die Beendigung von '{0}' auf: {1}
zh_cn: 等待线程“ {0}”停止期间发生异常：{1}

# ExecutionEngine_Stop_All_threads_stopped
source: All threads stopped
de: Alle Threads wurden angehalten
zh_cn: 所有线程停止

# ExecutionEngine_Stop_WorkspaceModel_states_resetted
source: WorkspaceModel states resetted
de: WorkspaceModel Stati wiederhergestellt
zh_cn: 已重置WorkspaceModel状态

# ExecutionEngine_Stop_ExecutionEngine_successfully_stopped
source: ExecutionEngine successfully stopped
de: Ausführungsmaschine erfolgreich gestoppt
zh_cn: ExecutionEngine成功停止

# ExecutionEngine_Stop_Exception_occured_during_stopping_of_Workspace___0__
source: Exception occured during stopping of Workspace: {0}
de: Ein Fehler trat während des Stoppens der Arbeitsfläche auf: {0}
zh_cn: 停止工作区期间发生异常：{0}

# ExecutionEngine_Stop_Aborting___0___now
source: Aborting '{0}' now
de: Beende '{0}' nun
zh_cn: 现在正在中止“ {0}”

source: Error occured during propagating of new value of '{0}' of Output '{1}': {2}
de: Ein Fehler trat bei der Weitergabe eines neuen Wertes des Plugins '{0}' des Outputs '{1}' auf: {2}
zh_cn: 传播输出&#39;{1}&#39;的新值&#39;{0}&#39;时发生错误：{2}

# PluginModel_Execute_Number_of__0__too_big_for__1____2_
source: Number of {0} too big for {1}: {2}
de: Die Zahl {0} ist zu groß für {1}: {2}
zh_cn: {0}的数量对{1}而言太大：{2}

source: An error occured while setting value of connector '{0}' of '{1}': {2}
de: Ein Fehler trat während der Belegung mit Daten des Konnektors '{0}' der Komponente '{1}' auf: {2}
zh_cn: 将连接器“ {0}”的值设置为“ {1}”时发生错误：{2}

# PluginModel_Execute_An_error_occured_while_executing____0______1__
source: An error occured while executing '{0}': {1}
de: Ein Fehler trat während der Ausführung von '{0}' auf: {1}
zh_cn: 执行&#39;{0}&#39;时发生错误：{1}

# PluginModel_Execute_An_error_occured_while_executing___0______1_
source: An error occured while executing '{0}': {1}
de: Ein Fehler trat während der Ausführung von '{0}' auf : {1}
zh_cn: 执行&#39;{0}&#39;时发生错误：{1}

# CopyOperation_Execute_Could_not_restore_the_setting___0___of_plugin___1__
source: Could not restore the setting '{0}' of plugin '{1}'
de: Konnte die Einstellung '{0}' des Plugins '{1}' nicht wiederherstellen
zh_cn: 无法恢复插件“ {1}”的设置“ {0}”

# CopyOperation_Execute_Error_while_initializing___0__
source: Error while initializing '{0}'
de: Ein Fehler trat während der Initialisierung von '{0}' auf
zh_cn: 初始化“ {0}”时出错

source: Error while restoring IControl Connection between '{0}' to '{1}'. Workspace surely will not work well.
de: Ein Fehler trat während der Erstellung der IControl-Verbindung zwischen '{0}' und '{1}' auf. Die Arbeitsfläche wird nicht richtig funktionieren.
zh_cn: 恢复“ {0}”到“ {1}”之间的IControl连接时出错。工作区肯定无法正常工作。

source: Could not restore the setting '{0}' of plugin '{1}'
de: Konnte die Einstellung '{0}' des Plugins '{1}' nicht wiederherstellen
zh_cn: 无法恢复插件“ {1}”的设置“ {0}”

source: A property with name '{0}' of type '{1}' does not exist in '{2}:{3}' but a ConnectorModel exists in the PluginModel. Delete the ConnectorModel now.
de: Kein Property mit Namen '{0}' des Typs '{1}' existiert in '{2}:{3}' aber das PluginModel besitzt ein entsprechendes ConnectorModel. Lösche das ConnectorModel jetzt.
zh_cn: 类型&#39;{1}&#39;的名称&#39;{0}&#39;的属性在&#39;{2}：{3}&#39;中不存在，但是PluginModel中存在ConnectorModel。立即删除ConnectorModel。

source: A ConnectorModel for the plugins property '{0}' of type '{1}' does not exist in the PluginModel of '{2}:{3}'. Create a ConnectorModel now.
de: Für das Plugin Property '{0}' des Typs '{1}' existiert im PluginModel '{2}:{3}' kein ConnectorModel. Dieses wird nun erstellt.
zh_cn: 类型&#39;{1}&#39;的插件属性&#39;{0}&#39;的ConnectorModel在&#39;{2}：{3}&#39;的PluginModel中不存在。现在创建一个ConnectorModel。

# ModelPersistance_restoreSettings_Error_while_initializing____0__
source: Error while initializing '{0}'
de: Ein Fehler trat während der Initialisierung von '{0}' auf
zh_cn: 初始化“ {0}”时出错

source: Error while restoring IControl Connection between '{0}' to '{1}'. Workspace surely will not work well.
de: Ein Fehler trat während der Erstellung der IControl-Verbindung zwischen '{0}' und '{1}' auf. Die Arbeitsfläche wird nicht richtig funktionieren.
zh_cn: 恢复“ {0}”到“ {1}”之间的IControl连接时出错。工作区肯定无法正常工作。

# ModelPersistance_restoreSettings_
source: An ImageModel without data (byte array == null || byte array is empty) cannot be restored. Delete it now.
de: Ein ImageModel ohne Daten (byte array == null || byte array ist leer) kann nicht wiederhergestellt werden. Dies wird nun gelöscht
zh_cn: 没有数据的ImageModel（字节数组== null ||字节数组为空）无法还原。立即删除。

# ModelPersistance_restoreSettings_TextModel
source: A TextModel without data (byte array == null || byte array is empty) cannot be restored. Delete it now.
de: Ein TextModel ohne Daten (byte array == null || byte array ist leer) kann nicht wiederhergestellt werden. Dies wird nun gelöscht
zh_cn: 没有数据（字节数组== null ||字节数组为空）的TextModel无法还原。立即删除。

# ModelPersistance_restoreSettings_ImageModel
source: An ImageModel without data (byte array == null || byte array is empty) cannot be restored. Delete it now.
de: Ein ImageModel ohne Daten (byte array == null || byte array ist leer) kann nicht wiederhergestellt werden. Dies wird nun gelöscht
zh_cn: 没有数据的ImageModel（字节数组== null ||字节数组为空）无法还原。立即删除。

# XMLSerialization_Deserialize_Could_not_create_instance_of___0_
source: Could not create instance of: {0}
de: Konnte keine Instanz erstellen: {0}
zh_cn: 无法创建以下实例：{0}

# XMLSerialization_Deserialize_Can_not_create_a_Color_with__0__Channels_
source: Can not create a Color with {0} Channels!
de: Eine Farbe mit {0} Kanälen kann nicht erstellt werden!
zh_cn: 无法创建具有{0}个通道的颜色！

# XMLSerialization_Deserialize_Expected_1_or_2_types_for_list__But_found___0_
source: Expected 1 or 2 types for list; But found: {0}
de: Erwartete 1 oder 2 Typen für die Liste; Fand aber: {0}
zh_cn: 清单应为1或2种类型；但发现：{0}

# XMLSerialization_Deserialize_Can_not_create_a_Point_with__0__Coordinates_
source: Can not create a Point with {0} Coordinates!
de: Ein Punkt mit {0} Koordinaten kann nicht erstellt werden!
zh_cn: 无法使用{0}坐标创建点！

source: Could not deserialize model element '{0}' of type '{1}'
de: Konnte Modelelement '{0}' mit Typ '{1}' deserialisieren
zh_cn: 无法反序列化类型为“ {1}”的模型元素“ {0}”

# XMLSerialization_Deserialize_Can_not_find_list_field___0___of___1__
source: Can not find list field '{0}' of '{1}'
de: Konnte Listenfeld '{0}' von '{1}' nicht finden
zh_cn: 找不到“ {1}”的列表字段“ {0}”

# XMLSerialization_Deserialize_Can_not_find_field___0___of___1__
source: Can not find field '{0}' of '{1}'
de: Konnte Feld '{0}' von '{1}' nicht finden
zh_cn: 找不到“ {1}”的字段“ {0}”

source: Could not restore reference beteen model element '{0}' and its reference with id '{1}
de: Konnte die Referenz zwischen dem Modelelement '{0}' und seinem referenzierten Objekt mit ID '{1}' erstellen
zh_cn: 无法还原参考beteen模型元素“ {0}”及其ID为“ {1}”的参考

source: An Error occured while stopping '{0}': {1}
zh_cn: 停止“ {0}”时发生错误：{1}

# An_Error_occured_while_post_0_1
source: An error occured while executing PostExecution of '{0}': {1}
de: Ein Fehler trat bei der Ausführung von PostExecution von {0} auf: {1}
zh_cn: 执行&#39;{0}&#39;的PostExecution时发生错误：{1}

# An_Error_occured_while_pre_0_1
source: An error occured while executing PreExecution of '{0}': {1}
de: Ein Fehler trat bei der Ausführung von PreExecution von {0} auf: {1}
zh_cn: 执行&#39;{0}&#39;的预执行时发生错误：{1}
