Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/DESVisualization/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# DESVisualizationCaption
source: DESVisualization
de: DES-Visualisierung
zh_cn: 可视化

# DESVisualizationTooltip
source: Visualization of DES encryption
de: Visualisierung der DES-Verschlüsselung
ru: Визуализация шифрования DES
zh_cn: 可视化的DES加密

# inputKeyDescription
source: Input the key used for encryption
de: Eingabe des Schlüssels für die Verschlüsselung
ru: Введите ключ, используемый для шифрования
zh_cn: 输入用于加密的密钥

# inputKeyName
source: Key input
de: Schlüsseleingabe
ru: Ввод ключа
zh_cn: 按键输入

# inputTextDescription
source: Input the text to be encrypted
de: Eingabe des Klartextes, der verschlüsselt werden soll
ru: Введите текст для шифрования
zh_cn: 输入要加密的文字

# inputTextName
source: Plaintext input
de: Klartexteingabe
ru: Вход в обычный текст
zh_cn: 纯文本输入

# institute
source: University of Mannheim
de: Universität Mannheim
ru: Университет Мангейма
zh_cn: 曼海姆大学

# IntroBottom
source: Block Cipher Visualization
de: Blockchiffre-Visualisierung
ru: Визуализация блочного шифрования
zh_cn: 块密码可视化

# outputCiphertextDescription
source: Output the Ciphertext after encryption with the DES algorithm
de: Ausgabe des Geheimtextes nach Anwendung der DES-Verschlüsselung
ru: Вывод шифрованного текста после шифрования с помощью алгоритма DES
zh_cn: 使用DES算法加密后输出密文

# outputCiphertextName
source: Ciphertext output
de: Geheimtextausgabe
ru: Вывод шифротекста
zh_cn: 密文输出

source: active
de: aktiv
ru: активный
zh_cn: 活性

# Bit32
source: 32 bit
ru: 32-битный
zh_cn: 32位

# Bit48
source: 48 bit
ru: 48 бит
zh_cn: 48位

# Bit6
source: 6 bit
ru: 6 бит
zh_cn: 6位

source: Ciphertext
de: Geheimtext
ru: зашифрованный
zh_cn: 密文

source: Clear
de: Löschen
ru: Очистить
zh_cn: 明确

source: Column:
de: Spalte:
ru: Колонка:
zh_cn: 柱：

source: Data
de: Daten
ru: Данные
zh_cn: 数据

# DataKey
source: Key (64 bit):
de: Schlüssel (64 bit):
ru: Ключ (64 бит):
zh_cn: 密钥（64位）：

# DataMessage
source: Message (64 bit):
de: Nachricht (64 bit):
ru: Сообщение (64 бит):
zh_cn: 消息（64位）：

# DiffInfo
source: Click Ok to flip the checked bits
de: Klick Ok zum Flippen markierter Bits
ru: Нажмите «ОК», чтобы перевернуть отмеченные биты
zh_cn: 单击确定翻转选中的位

# DiffusionVisualizer
source: Show Diffusion Visualizer
de: Zeige Diffusionsanzeige
ru: Показать иллюстратор диффузии
zh_cn: 显示扩散可视化器

# FinalCiphertext
source: Ciphertext (64 bit):
de: Geheimtext (64 bit):
ru: Шифрованный текст (64 бит):
zh_cn: 密文（64位）：

# FunctionLabel
source: Function f(K ,R ) Round /16
de: Funktion f(K ,R ) Runde /16
ru: Функция f (K, R) Round / 16
zh_cn: 函数f（K，R）舍入/ 16

# HistoryText
source: - In 1973 the NBS (National Bureau of Standards) started to develop or search for an official standard algorithm for data encryption and decryption. One of the possible candidates was an algorithm based on IBM's "Lucifer". - To check and verify the security of this algorithm the NSA (National Security Agency) was asked for help. - After changes of the key length and the used S-boxes this algorithm became the official Data Encryption Standard on 23 November 1976. - On 2 October 2000 DES was replaced by a Belgian algorithm called "Rijndael" which became the AES (Advanced Encryption Standard).
de: - 1972 begann das NBS (National Bureau of Standards) einen für jeden zugänglichen Verschlüsselungsstandard zu suchen bzw. entwickeln. Darunter war ein Algorithmus, der auf dem IBM-Projekt "Lucifer" basierte. - Um die Sicherheit des Algorithmus zu testen wurde die NSA (National Security Agency) um Hilfe gebeten. - Nach Änderungen an der Schlüssellänge und den S-Boxen wurde dieser Algorithmus am 23. November 1976 zum Data Encryption Standard. - Am 2. Oktober 2000 wurde der DES durch den belgischen Algorithmus "Rijndael" ersetzt, der den AES (Advanced Encryption Standard) darstellt.
ru: - В 1973 году НБС (Национальное бюро стандартов) начало разработку или поиск официального стандартного алгоритма шифрования и дешифрования данных. Одним из возможных кандидатов был алгоритм, основанный на IBM Lucifer. - Чтобы проверить и проверить безопасность этого алгоритма, NSA (Агентство национальной безопасности) попросили о помощи. - После изменения длины ключа и используемых S-блоков этот алгоритм стал официальным стандартом шифрования данных 23 ноября 1976 года. - 2 октября 2000 года DES был заменен бельгийским алгоритмом под названием «Rijndael», который стал AES (Advanced Encryption Standard ).
zh_cn: -1973年，国家标准局（NBS）开始开发或搜索用于数据加密和解密的官方标准算法。一种可能的候选者是基于IBM的“ Lucifer”的算法。 -为了检查和验证此算法的安全性，向国家安全局（NSA）寻求帮助。 -更改密钥长度和使用的S-box之后，该算法于1976年11月23日成为正式的数据加密标准。-2000年10月2日，DES被比利时的“ Rijndael”算法取代，该算法成为AES（高级加密标准） ）。

# InfoText
source: DES is a modern symmetric-key block cipher which encrypts one message block of 64 bit with a 64 bit key into a 64 bit ciphertext. Each 8th bit (least significant bit) is used solely for checking parity and is thereafter discarded. These 8 least significant bits aren't actually used by the algorithm and so the effective key length for encryption is only 56 bits. The overall structure of the algorithm has 16 identical stages of processing, termed rounds. These rounds are organized in a Feistel network (a series of linked mathematical operations similar to a substitution-permutation network). This ensures that decryption and encryption are very similar processes.
de: DES ist ein Blockchiffrieralgorithmus, der 64 bit-Klartextblöcke mit einem 64 bit-Schlüssel ver- bzw. entschlüsselt. Jedes 8. bit (least significant bit) im Schlüssel wird als Paritätsbit genutzt. Diese acht Bits werden vom Algorithmus nicht verwendet. Daraus ergibt sich eine effektive Schlüssellänge von nur 56 bit. Der Algorithmus besteht nur aus Permutationen und Substitutionen. Der gesamte Ablauf benötigt insgesamt 16 Runden, die in einem Feistel-Netzwerk organisiert sind. Damit sind Ver- und Entschlüsselung sehr ähnliche Prozesse.
ru: DES - это современный блочный шифр с симметричным ключом, который шифрует один блок сообщений из 64 бит с помощью 64-битного ключа в 64-разрядный зашифрованный текст. Каждый 8-й бит (младший значащий бит) используется исключительно для проверки четности и затем отбрасывается. Эти 8 младших битов фактически не используются алгоритмом, поэтому эффективная длина ключа для шифрования составляет всего 56 бит. Общая структура алгоритма имеет 16 идентичных этапов обработки, называемых раундами. Эти раунды организованы в сети Фейстеля (серия связанных математических операций, аналогичных сети подстановочно-перестановочных). Это гарантирует, что дешифрование и шифрование являются очень похожими процессами.
zh_cn: DES是一种现代的对称密钥块密码，它使用64位密钥将一个64位消息块加密为64位密文。每个第8位（最低有效位）仅用于检查奇偶校验，然后将其丢弃。该算法实际上并没有使用这8个最低有效位，因此加密的有效密钥长度仅为56位。该算法的整体结构具有16个相同的处理阶段，称为回合。这些回合在Feistel网络中进行组织（一系列与替代置换网络相似的链接数学运算）。这确保了解密和加密是非常相似的过程。

source: Input:
de: Eingabe:
ru: Входные данные:
zh_cn: 输入：

source: Intro
de: Einführung
ru: вступление
zh_cn: 介绍

source: Key
de: Schlüssel
ru: ключ
zh_cn: 键

source: Key Addition
de: Schlüsseladdition
ru: Ключевое дополнение
zh_cn: 按键添加

source: Message
de: Nachricht
ru: Сообщение
zh_cn: 信息

source: Output:
de: Ausgabe:
ru: Вывод:
zh_cn: 输出：

# OutputAll
source: Output all S-boxes:
de: Ausgabe aller S-Boxen:
ru: Вывод всех S-блоков:
zh_cn: 输出所有S盒：

source: Prev. Step
de: Schritt zurück
ru: Пред. шаг
zh_cn: 上一个步

source: Round
de: Runde
ru: Круглый
zh_cn: 回合

source: Round 1
de: Runde 1
ru: Раунд 1
zh_cn: 第1轮

source: Round 16
de: Runde 16
ru: Круглый 16
zh_cn: 第16回合

# RoundData
source: Round L R
de: Runde L R
ru: Круглый LR
zh_cn: 圆LR

source: Round function
de: Rundenfunktion
ru: Круглые функции
zh_cn: 圆形功能

source: Round Key
de: Rundenschlüssel
ru: Круглый ключ
zh_cn: 圆键

# RoundKeyData
source: Round Round Key
de: Runde Rundenschlüssel
ru: Круглый круглый ключ
zh_cn: 一轮一轮钥匙

# RoundShift
source: Round: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Shifts: 1 1 2 2 2 2 2 2 1 2 2 2 2 2 2 1
de: Runde: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Shifts: 1 1 2 2 2 2 2 2 1 2 2 2 2 2 2 1
ru: Раунд: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 Сдвиги: 1 1 2 2 2 2 2 2 1 2 2 2 2 2 2 1
zh_cn: 回合：1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16班次：1 1 2 2 2 2 2 2 2 1 2 2 2 2 2 2 1

source: Row:
de: Reihe:
ru: Ряд:
zh_cn: 行：

# Runde_16
source: Round {0}/16
de: Runde {0}/16
ru: Круглый {0} / 16
zh_cn: 回合{0} / 16

# SBoxesLabel
source: S-Boxes
de: S-Boxen
ru: S-коробки
zh_cn: S盒

source: Skip Step
de: Überspringe Schritt
ru: Пропустить шаг
zh_cn: 跳过步骤

source: Summary
de: Zusammenfassung
ru: Резюме
zh_cn: 概要

source: Background
de: Hintergrund
ru: Задний план
zh_cn: 背景

source: Bitwise XOR Operation
de: Bitweise XOR-Operation
ru: Побитовая операция XOR
zh_cn: 按位异或运算

source: Cyclic Shift
de: Zyklischer Shift
ru: Циклический сдвиг
zh_cn: 循环移位

source: DES Encryption
de: DES-Verschlüsselung
ru: DES шифрование
zh_cn: DES加密

# DiffusionVisualizerHide
source: Hide Diffusion Visualizer
de: Verstecke Diffusionsanzeige
ru: Скрыть диффузный визуализатор
zh_cn: 隐藏扩散可视化器

source: General Information
de: Allgemeine Informationen
ru: Главная Информация
zh_cn: 一般信息

source: General Structure
de: Allgemeine Struktur
ru: Общая структура
zh_cn: 总体结构

source: Input Data
de: Eingabedaten
ru: Входные данные
zh_cn: 输入数据

source: Introduction
de: Einführung
ru: Введение
zh_cn: 介绍

source: Key Schedule
de: Key-Schedule-Algorithmus
ru: Расписание
zh_cn: 关键时间表

source: Permutation Function
de: Permutationsfunktion
ru: Функция перестановки
zh_cn: 排列功能

source: Skip Round
de: Überspringe Runde
ru: Пропустить раунд
zh_cn: 跳过回合

source: Next Step
de: Nächster Schritt
ru: Следующий шаг
zh_cn: 下一步

# DiffOkLabel
source: Confirm flipping of selected bits.
de: Bestätige das Flippen der ausgewählten Bits.
ru: Подтвердите переброс выбранных битов.
zh_cn: 确认翻转所选位。

# SBoxResultLong
source: → Result for S-box application
de: → Ergebnis für die S-Box-Anwendung
ru: → Результат для применения S-box
zh_cn: →S-box申请结果

# SBoxJumpButton
source: Jump to end of current operation
de: Springe zum Operationsende
ru: Перейти к концу текущей операции
zh_cn: 跳转到当前操作的结尾

# Switch
source: Switch Hex-Binary
de: Tausche Hex-Binär
ru: Переключатель Hex-Binary
zh_cn: 开关十六进制

# ChapterTextDES
source: - The "DES Encryption" is the 2nd main part of the algorithm: Here the message is encrypted during 16 rounds. - The buttons in the two lines at the bottom also show where you are: As long as you are in this 2nd main part of DES, either one of the buttons "IP", "DES", or "FP" is blue.
de: - Die "DES-Verschlüsselung" ist der zweite Hauptteil des Algorithmus: Hier wird die Nachricht innerhalb von 16 Runden verschlüsselt. - Die Knöpfe in den untersten beiden Reihen zeigen dir zusätzlich, wo du dich gerade befindest: Solange du dich in diesem zweiten Hauptteil des DES befindest, ist einer der Knöpfe "IP", "DES" oder "FP" blau hinterlegt.
ru: - «Шифрование DES» является второй основной частью алгоритма: здесь сообщение зашифровывается в течение 16 раундов. - Кнопки в двух строках внизу также показывают, где вы находитесь: пока вы находитесь в этой второй части DES, либо одна из кнопок «IP», «DES» или «FP» является синей.
zh_cn: -“ DES加密”是算法的第二个主要部分：此处，消息在16个回合中被加密。 -底部两行中的按钮也显示您的位置：只要您在DES的第二个主要部分中，按钮“ IP”，“ DES”或“ FP”之一就是蓝色。

# ChapterTextKS
source: - The "Key Schedule" is the 1st main part of the algorithm: Here the given key is used to generate a key for each round of DES (these round keys are then used in the 2nd main part of DES which is the actual encryption process). - The buttons in the two lines at the bottom have two purposes: They show where you are, and they allow a direct navigation. - As long as you are in this 1st main part of DES, the button "Key Schedule" in the 2nd line is blue (to show you, where you are).
de: - Der "Key Schedule" ist der erste Hauptteil des Algorithmus: Hier wird aus dem gegebenen Schlüssel ein Schlüssel für jede Runde des DES generiert (diese Rundenschlüssel werden im zweiten Hauptteil des DES, der den eigentlichen Verschlüsselungsprozess darstellt, benutzt). - Die Knöpfe in den untersten beiden Reihen haben zwei Aufgaben: Sie geben an, wo du dich gerade befindest, und sie erlauben eine direkte Navigation: Solange du dich in diesem ersten Hauptteil des DES befindest, ist der Knopf "Key Schedule" in der zweituntersten Reihe blau hinterlegt.
ru: - «Ключевое расписание» является первой основной частью алгоритма: здесь данный ключ используется для генерации ключа для каждого раунда DES (эти круглые клавиши затем используются во второй части DES, которая является фактическим процессом шифрования ). - Кнопки в двух строках внизу имеют две цели: они показывают, где вы находитесь, и они позволяют осуществлять прямую навигацию. - Пока вы находитесь в этой первой части DES, кнопка «Key Schedule» во второй строке синяя (чтобы показать вам, где вы находитесь).
zh_cn: -“密钥时间表”是算法的第一个主要部分：此处，给定的密钥用于为每一轮DES生成一个密钥（然后，这些轮密钥在DES的第二个主要部分中使用，这是实际的加密过程）。 -底部两行中的按钮有两个用途：它们显示您的位置，并允许直接导航。 -只要您在DES的第一个主要部分中，第二行中的“密钥计划”按钮就会为蓝色（以向您显示您的位置）。
