Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Primes/Primes/Resources/lang/WpfControls/Distribution/Distribution.*.resx
Languages: de

# graph_btnResume
source: Resume
de: Weiter

# graph_contextmenucopy
source: copy
de: kopieren

# graph_gausscountinfo
source: Number of primes according to the Prime Number Theorem:
de: Die Anzahl der Primzahlen nach dem Primzahlsatz beträgt:

# graph_gausscountinfoCalculating
source: Calculating the number of primes according to the Prime Number Theorem:
de: Die Anzahl der Primzahlen nach dem Primzahlsatz wird berechnet:

# graph_gaussname
source: Prime Number Theorem
de: Primzahlsatz

# graph_groupboxheader
source: Available functions for calculating the number of primes Y in a given range X
de: Verfügbare Funktionen zur Berechnung der Anzahl der Primzahlen Y in einem gegebenen Bereich X

# graph_lincountinfo
source: Number of primes according to the logarithmic integral:
de: Die Anzahl der Primzahlen nach dem logarithmischen Integral beträgt:

# graph_lincountinfoCalculating
source: Calculating the number of primes according to the logarithmic integral:
de: Die Anzahl der Primzahlen nach dem logarithmischen Integral wird berechnet:

# graph_linname
source: The logarithmic integral
de: Das logarithmische Integral

# graph_pincountinfo
source: The actual number of primes is:
de: Die tatsächliche Anzahl der Primzahlen beträgt:

# graph_pincountinfoCalculating
source: Calclulating the actual number of primes:
de: Die tatsächliche Anzahl der Primzahlen wird berechnet:

# graph_pinname
source: Exact step function π
de: Exakte Treppenfunktion π

# graph_validatorrangemessage
source: The difference between "from" and "to" must be at least {0}.
de: Der Abstand zwischen "von" und "bis" muss mindestens {0} betragen.

# numbergrid_actualnumber
source: Current number:
de: Aktuelle Zahl:

# numbergrid_btnExecute
source: Execute
de: Ausführen

# numbergrid_height
source: Height
de: Höhe

# numbergrid_input
source: Input
de: Eingabe

# numbergrid_scroll
source: Scroll rowwise in the number grid
de: Zeilenweise im Zahlengitter scrollen

# numbergrid_start
source: Start
de: Startwert

# numbergrid_tooltipscrolldown
source: Click here to scroll down one row.
de: Mit Klick hierauf scrollen Sie eine Zeile nach unten.

# numbergrid_tooltipscrolldownfast
source: Click here to scroll down two rows.
de: Mit Klick hierauf scrollen Sie zwei Zeilen nach unten.

# numbergrid_tooltipscrollup
source: Click here to scroll up one row.
de: Mit Klick hierauf scrollen Sie eine Zeile nach oben.

# numbergrid_tooltipscrollupfast
source: Click here to scroll up two rows.
de: Mit Klick hierauf scrollen Sie zwei Zeilen nach oben.

# numbergrid_width
source: Width
de: Breite

# numbergrid_zoom
source: Zoom the number grid
de: Das Zahlengitter zoomen

# numberline_actualnumber
source: Current number n =
de: Aktuelle Zahl n =

# numberline_calculating
source: (calculating)
de: (wird berechnet)

# numberline_cancelcalculations
source: Cancel calculations
de: Berechnungen abbrechen

# numberline_countprimesgauss
source: The number of primes according to the estimate of Gauss' prime number theorem is {0}.
de: Nach der Abschätzung durch den Gaußschen Primzahlsatz beträgt die Anzahl {0}.

# numberline_countprimespin
source: The actual number of primes in this range is {0}.
de: Die tatsächliche Anzahl der Primzahlen in diesem Bereich beträgt {0}.

# numberline_divcount
source: Number of divisors
de: Anzahl der Teiler

# numberline_divsum
source: Sum of the divisors
de: Summe der Teiler

# numberline_eulerphi
source: Euler's φ-function
de: Eulersche φ-Funktion

# numberline_eulerphifoundresult
source: Found {0} coprime numbers for the current number {1}.
de: {0} teilerfremde Zahlen zur aktuellen Zahl {1} gefunden.

# numberline_eulerphiisprime
source: {0} is a prime. Therefore the number of coprime numbers to {1} is {2} - 1 = {3}.
de: {0} ist eine Primzahl. Darum ist die Anzahl der zu {1} teilerfremden Zahlen {2} - 1 = {3}

# numberline_eulerphisum
source: Sum of divisor totients
de: Teilersummenformel

# numberline_eulerphisuminfo
source: For the current number {0} the formula evaluates to {1}.
de: Die Formel liefert für die aktuelle Zahl {0} den Wert {1}.

# numberline_factorization
source: Factorization
de: Faktorisierung

# numberline_factorizationcalculating
source: (calculating factorization)
de: (wird faktorisiert)

# numberline_from
source: from
de: von

# numberline_header
source: Move with the mouse along the number line to get number-theoretic statements of the selected number. The number line acts as a sliding window over the integers with a display range between 10 to 90 numbers. You can adjust the range with the slider, which determines the upper limit of the range.
de: Bewegen Sie die Maus über die Zahlengerade, um zahlentheoretische Aussagen der gewählten Zahl zu erhalten. Die Zahlengerade fungiert als Schiebefenster über Ganzzahlen mit einer Anzeige-Intervallbreite zwischen 10 und 90 Zahlen. Die Intervallbreite wird mit dem Schieberegler festgelegt, indem die Obergrenze angepasst wird.

# numberline_headercoutprimes
source: Number of primes in the selected range
de: Anzahl der Primzahlen im ausgewählten Bereich

# numberline_isodd
source: The Goldbach conjecture only holds for even numbers. {0} is odd.
de: Die Goldbach-Vermutung gilt nur für gerade Zahlen. {0} ist ungerade.

# numberline_isprime
source: is prime
de: ist eine Primzahl

# numberline_isquadtrupletprime
source: ({0}, {1}, {2}, {3}) is a prime quadruplet.
de: ({0}, {1}, {2}, {3}) ist ein Primzahlvierling.

# numberline_issixtupletprime
source: ({0}, {1}, {2}, {3}, {4}, {5}) is a prime sixtuplet.
de: ({0}, {1}, {2}, {3}, {4}, {5}) ist ein Primzahlsechsling.

# numberline_istwinprime
source: ({0}, {1}) is a prime twin.
de: ({0}, {1}) ist ein Primzahlzwilling.

# numberline_maxinterval
source: The lower boundary of the interval is 2, the upper boundary is 10^9. With the arrow keys, you can move left and right through the interval in steps of size 1 or 10.
de: Die Untergrenze des Intervalls beträgt 2, die Obergrenze 10^9. Mit den Pfeilen können Sie das ganze Intervall in Einer- und Zehnerschritten nach links oder rechts schieben.

# numberline_nextprime
source: Next bigger prime number
de: Nächstgrößere Primzahl

# numberline_nexttwinprime
source: The next bigger prime twin is ({0}, {1}).
de: Der nächstgrößere Primzahlzwilling ist ({0}, {1}).

# numberline_numberofprimeinterval
source: Number of primes in the selected range ({0}, {1})
de: Anzahl der Primzahlen im ausgewählten Bereich ({0}, {1})

# numberline_numberofprimes
source: Number of primes <= n
de: Anzahl der Primzahlen <= n

# numberline_pointsdisplayed
source: Sliding window display range:
de: Schiebefenster Anzeige-Intervallbreite:

# numberline_priorprime
source: Next smaller prime number
de: Nächstkleinere Primzahl

# numberline_priortwinprime
source: The next smaller prime twin is ({0}, {1}).
de: Der nächstkleinere Primzahlzwilling ist ({0}, {1}).

# numberline_progress
source: Progress
de: Fortschritt

# numberline_quadtuplet
source: Prime quadruplets
de: Primzahlvierlinge

# numberline_rhoinfo
source: The sum of the divisors of the current number {0} is {1}.
de: Die Summe der Teiler der aktuellen Zahl {0} beträgt {1}.

# numberline_sixtuplet
source: Prime sixtuplets
de: Primzahlsechslinge

# numberline_tauinfo
source: Found {0} divisors for the current number {1}.
de: {0} Teiler zur aktuellen Zahl {1} gefunden.

# numberline_to
source: to
de: bis

# numberline_tooltipscrollleft
source: Reduce range in increments of 1
de: Verringert den Zahlenbereich in 1-er Schritten

# numberline_tooltipscrollleftfast
source: Reduce range in increments of 10
de: Verringert den Zahlenbereich in 10-er Schritten

# numberline_tooltipscrollright
source: Increase range in increments of 1
de: Erhöht den Bereich in 1-er Schritten

# numberline_tooltipscrollrightfast
source: Increase range in increments of 10
de: Erhöht den Bereich in 10-er Schritten

# numberline_twinprime
source: Prime twins
de: Primzahlzwillinge

# tabitemnumbergrid
source: Number grid
de: Zahlengitter

# tabitemnumberline
source: Number line
de: Zahlengerade

# tabitemulam
source: Ulam's spiral
de: Ulam-Spirale

# ulam_btnCancel
source: Cancel
de: Abbrechen

# ulam_btnExecute
source: Execute
de: Ausführen

# ulam_input
source: Beginning and end of the spiral
de: Start- und Endwert der Spirale

# ulam_rotate
source: Rotate the spiral
de: Die Spirale drehen

# ulam_zoom
source: Zoom the spiral
de: Die Spirale zoomen

# tabitemgraph
source: Number of primes
de: Anzahl der Primzahlen

# ulam_calculating
source: Calculating the spiral
de: Spirale wird berechnet

# ulam_validatorrangemessage
source: The difference between "from" and "to" must be at least {0} and at most {1}.
de: Der Abstand zwischen "von" und "bis" muss mindestens {0} und höchstens {1} sein.

# numberline_istwo
source: The Goldbach conjecture only holds for even numbers > 2.
de: Die Goldbach-Vermutung gilt nur für gerade Zahlen > 2.

# numberline_eulerphimaxlines
source: Only the first {0} of {1} values are displayed.
de: Nur die ersten {0} von {1} Werten werden angezeigt.

# numberline_insidetwinprime
source: {0} lies inside the prime twins ({1}, {2}).
de: {0} liegt innerhalb des Primzahlzwillings ({1}, {2}).

# numberline_tooltipdecrange
source: Reduce range to at least 10 numbers
de: Verringert den Zahlenbereich bis auf mindestens 10 Zahlen

# numberline_tooltipincrange
source: Increase range to at most 90 numbers
de: Vergrößert den Zahlenbereich bis auf höchstens 90 Zahlen

# numberline_goldbach
source: Goldbach's conjecture
de: Goldbach-Vermutung

# numberline_goldbachfoundsum
source: Found {0} prime number sum for the current number {1}.
de: {0} Primzahlsumme zur aktuellen Zahl {1} gefunden.

# numberline_goldbachfoundsums
source: Found {0} prime number sums for the current number {1}.
de: {0} Primzahlsummen zur aktuellen Zahl {1} gefunden.

# numberline_goldbachinfo
source: (Every even number > 2 can be expressed as a sum of 2 prime numbers.)
de: (Jede gerade Zahl > 2 kann als Summe von 2 Primzahlen geschrieben werden.)

# numberline_goldbachmaxlines
source: Only the first {0} sums are displayed.
de: Nur die ersten {0} Summen werden angezeigt.
