Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/SATSolver/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AppendStr
source: Append
de: Zufügen
ru: присоединять
zh_cn: 附加

# BasicStr
source: Basic
de: Normal
ru: основной
zh_cn: 基本的

# CCMinCaption
source: Conflict clause minimization
de: Minimierung von Konfliktklauseln
ru: Свернуть эту таблицу
zh_cn: 冲突条款最小化

# CCMinTooltip
source: Reduces the size of the learnt conflict clause
de: Reduziert die Größe einer gelernten Konfliktklausel
ru: Уменьшает размер объявленного положения о конфликте
zh_cn: 减小学习到的冲突条款的大小

# ClauseDecayCaption
source: Clause activity decay factor
de: Klauselaktivität Abfall
ru: Коэффициент распада активности
zh_cn: 子句活动衰减因子

# ClauseDecayTooltip
source: Set the decay factor for clause activity (must be between 0.0 and 1.0, default=0.999)
de: Faktor für den Abfall der Variablenaktivität
ru: Задайте коэффициент затухания для активности предложения (должно быть между 0.0 и 1.0, по умолчанию = 0.999)
zh_cn: 设置子句活动的衰减因子（必须在0.0到1.0之间，默认值= 0.999）

# ClearOutputCaption
source: Clear output
de: Ausgabe löschen
ru: Очистить выход
zh_cn: 清除输出

# ClearOutputTooltip
source: Set if console output should be cleared after every execution
de: Festlegen, ob die Konsolenausgabe vor erneuter Ausführung gelöscht werden soll
ru: Установите, если вывод консоли должен быть очищен после каждого выполнения
zh_cn: 设置是否在每次执行后清除控制台输出

# CoreOptionsGroup
source: Solver options
de: Solver-Optionen
ru: Параметры Solver
zh_cn: 求解器选项

# DeepStr
source: Deep
de: Tiefgehend
ru: глубоко
zh_cn: 深

# DimacsCaption
source: Dimacs
zh_cn: 迪马克斯

# DimacsTooltip
source: Do not solve, just simplify CNF
de: CNF nur vereinfachen anstatt zu lösen
ru: Не решайте, просто упростите CNF
zh_cn: 不解决，只是简化CNF

# ElimCaption
source: Eliminate variables
de: Eliminiere Variablen
ru: Устранить переменные
zh_cn: 消除变量

# ElimTooltip
source: Perform variable elimination
de: Führe Eliminierung von Variablen durch
ru: Выполнение исключения переменных
zh_cn: 执行变量消除

# FullStr
source: Full
de: Vollständig
ru: Полный
zh_cn: 充分

# InputCaption
source: Input
de: Eingabe
ru: вход
zh_cn: 输入值

# InputTooltip
source: Input CNF as text
de: CNF in Textform
ru: Введите CNF как текст
zh_cn: 输入CNF作为文本

# LimitedStr
source: Limited
de: Eingeschränkt
ru: Ограниченное
zh_cn: 有限

# LubyCaption
source: Luby sequence
de: Luby-Sequenz
ru: Последовательность Luby
zh_cn: 鲁比序列

# LubyTooltip
source: Use the luby restart sequence
de: Benutze die Luby-Neustartsequenz
ru: Использовать последовательность перезапуска luby
zh_cn: 使用luby重新启动序列

# MoreStr
source: Detailed
de: Detailliert
ru: детализированный
zh_cn: 详细

# NoneStr
source: None
de: Aus
ru: Никто
zh_cn: 没有

# OffStr
source: Off
de: Aus
ru: от
zh_cn: 关

# OnStr
source: On
de: An
ru: На
zh_cn: 上

# OutputatResultTooltip
source: The solver's result output
de: Die Ergebnisausgabe des Solvers
ru: Результат результата решателя
zh_cn: 求解器的结果输出

# OutputConsoleCaption
source: Output console stream
de: Konsolenausgabestrom
ru: Консольный поток вывода
zh_cn: 输出控制台流

# OutputConsoleTooltip
source: The solver's console output
de: Die Konsolenausgabe des Solvers
ru: Консольный выход решателя
zh_cn: 求解器的控制台输出

# OutputOptionsGroup
source: Output options
de: Ausgabeoptionen
ru: Параметры вывода
zh_cn: 输出选项

# OutputResultCaption
source: Output result stream
de: Ergebnisausgabestrom
ru: Выходной поток результата
zh_cn: 输出结果流

# PhaseSavingCaption
source: Level of phase saving
de: Stufe des 'phase saving'
ru: Уровень сохранения фазы
zh_cn: 阶段保存水平

# PhaseSavingTooltip
source: Assigns each decision variable to the value last forced by boolean constraint propagation
de: Weist jeder Entscheidungsvariable ihren zuletzt durch die 'boolean constraint propagation' zugewiesenen Wert zu.
ru: Присваивает каждой переменной решения значение, последнему принудительно используемое при булевом распространении ограничений
zh_cn: 将每个决策变量分配给布尔约束传播最后强制的值

# PluginCaption
source: SAT Solver
zh_cn: SAT解算器

# PluginDescription
source: Test the satisfiability of a boolean formula
de: Testet die Erfüllbarkeit einer booleschen Formel
ru: Проверьте выполнимость булевой формулы
zh_cn: 测试布尔公式的可满足性

# PreprocessCaption
source: Preprocessor
de: Präprozessor
ru: препроцессор
zh_cn: 预处理器

# PreprocessorOptionsGroup
source: Preprocessor Options
de: Präprozessor-Optionen
ru: Параметры препроцессора
zh_cn: 预处理选项

# PreprocessTooltip
source: Turn preprocessing (simplification of CNF) on / off
de: Vorbearbeitung ein-/ausschalten (Vereinfachung der CNF)
ru: Включить / выключить предварительную обработку (упрощение CNF)
zh_cn: 开启/关闭预处理（简化CNF）

# RandomFreqCaption
source: Random frequency
de: Zufallsrate
ru: Случайная частота
zh_cn: 随机频率

# RandomFreqTooltip
source: The frequency with which the variable decision heuristic tries to choose a random variable (must be between 0.0 and 1.0, default=0)
de: Rate, mit der die Entscheidungsheuristik eine zufällige Variable wählt (muss zwischen 0.0 und 1.0 liegen, default=0)
ru: Частота, с которой эвристика с переменным решением пытается выбрать случайную переменную (должна быть между 0.0 и 1.0, по умолчанию = 0)
zh_cn: 变量决策启发式尝试选择随机变量的频率（必须在0.0到1.0之间，默认为0）

# RandomInitCaption
source: Randomize initial activity
de: Randomisiere Anfangsaktivität
ru: Рандомизировать начальную активность
zh_cn: 随机化初始活动

# RandomInitTooltip
source: Initialize all variables to random values
de: Initialisiere alle Variablen mit zufälligen Aktivitätswerten
ru: Инициализировать все переменные до случайных значений
zh_cn: 将所有变量初始化为随机值

# RCheckCaption
source: Clause checking
de: Klauselprüfung
ru: Проверка условий
zh_cn: 条款检查

# RCheckTooltip
source: Check if a clause is already implied
de: Prüfe, ob eine Klausel bereits impliziert ist
ru: Проверьте, не указано ли предложение
zh_cn: 检查子句是否已经隐含

# RFirstCaption
source: Base restart interval
de: Neustartintervall
ru: Базовый интервал перезапуска
zh_cn: 基本重启间隔

# RFirstTooltip
source: Base interval after how many conflicts the solver performs its first restart (0 - maxint, default=100)
de: Grundintervall, nach wie vielen Konflikten der Solver das erste Mal neu startet (0 - maxint, default=100)
ru: Базовый интервал после того, сколько конфликтов решатель выполняет свой первый перезапуск (0 - maxint, default = 100)
zh_cn: 求解程序执行了多少次冲突后的基本间隔（0-maxint，默认= 100）

# RIncCaption
source: Restart interval increase factor
de: Neustartintervall Anstiegsfaktor
ru: Фактор увеличения интервала перезапуска
zh_cn: 重新启动间隔增加系数

# RIncTooltip
source: Factor by which the restart interval is multiplied after a restart (must be greater than 1.0, default=2)
de: Faktor, mit dem das Neustartintervall nach einem Neustart multipliziert wird (muss größer als 1.0 sein, default=2)
ru: Фактор, по которому интервал перезапуска умножается после перезапуска (должен быть больше 1,0, по умолчанию = 2)
zh_cn: 重新启动后重新启动间隔乘以的因子（必须大于1.0，默认值= 2）

# SilentStr
source: Silent
de: Still
ru: бесшумный
zh_cn: 无声

# SomeStr
source: Normal
ru: Нормальный
zh_cn: 正常

# SubLimitCaption
source: Subsumption limit
de: Subsumptionsgrenze
ru: Предел пресечения
zh_cn: 纳入限制

# SubLimitTooltip
source: Do not check if subsumption against a clause larger than this (-1 - maxint, default=1000, -1 means no limit)
de: Prüfe nicht auf Subsumption bei Klauseln größer als diesem Wert (-1 - maxint, default=1000, -1 bedeutet keine Grenze)
ru: Не проверяйте, является ли надбавка к предложению больше этого (-1 - maxint, по умолчанию = 1000, -1 означает без ограничений)
zh_cn: 不要检查是否包含大于此子句的子句（-1-maxint，default = 1000，-1表示没有限制）

# VarDecayCaption
source: Variable activity decay factor
de: Variablenaktivität Abfall
ru: Коэффициент затухания переменной активности
zh_cn: 可变活动衰减因子

# VarDecayTooltip
source: Set the decay factor for variable activity (must be between 0.0 and 1.0, default=0.95)
de: Faktor für den Abfall der Variablenaktivität
ru: Установите коэффициент затухания для переменной активности (должен быть между 0.0 и 1.0, по умолчанию = 0.95)
zh_cn: 设置可变活动的衰减因子（必须在0.0到1.0之间，默认值= 0.95）

# VerbosityCaption
source: Verbosity
de: Ausführlichkeit
ru: многословие
zh_cn: 细度

# VerbosityTooltip
source: Set the level of verbosity
de: Grad der Ausführlichkeit
ru: Задайте уровень детализации
zh_cn: 设置详细程度

# NoStr
source: No
de: Nein
ru: нет
zh_cn: 没有

# YesStr
source: Yes
de: Ja
ru: да
zh_cn: 是
