Repository: CrypToolProject/CrypTool-2
Catalog: Experimental/CrypPlugins/SATAttack/Properties/Resources.*.resx
Languages: de

# AttackModeCaption
source: Attack type
de: Angriffs-Modus

# AttackModeTooltip
source: Specify the type of attack.
de: Wählen Sie den Angriffs-Modus aus.

# BinaryString
source: (Binary): 0b
de: (Binär): 0b

# BinaryStringError
source: When using the prefix "0b", ensure the string only contains bit values (0 and 1).
de: Stellen Sie sicher, dass die Zeichenfolge nur Bitwerte enthält (0 oder 1), wenn das Präfix "0b" benutzt wird.

# BitNumberParseError
source: Failed to parse the bit number for {0} variable {1}: {2}.
de: Parsen der Bitnummer der {0} Variable {1}: {2} fehlgeschlagen.

# CallingCbmcProcessString
source: Calling CBMC process...
de: Ruft den CBMC-Prozess…

# CallingSatSolverString
source: Calling SAT solver process...
de: Ruft den SAT-Solver-Prozess…

# CallingSatSolverWithParametersString
source: Calling SAT solver at {0} with parameters {1}.
de: Ruft SAT-Solver bei {0} mit den Parametern {1}.

# CbmcOutputStreamCaption
source: CBMC output stream
de: CBMC-Ausgabestrom

# CbmcOutputStreamTooltip
source: Redirect the output of the CBMC process.
de: Leitet die Ausgabe des CBMC-Prozesses um.

# CbmcProcessError
source: CBMC process returned with an error.
de: Der CBMC-Prozess gab einen Fehler zurück.

# CbmcProcessKillException
source: Killing CBMC process threw an exception: {0} {1}.
de: Beendigung des CBMC-Prozesses löste eine Ausnahme aus: {0} {1}.

# CbmcProcessKillSuccess
source: Successfully killed CBMC process.
de: Der CBMC-Prozess wurde erfolgreich beendet.

# CbmcProcessReturnedSuccessfully
source: CBMC process returned successfully after {0} seconds.
de: Der CBMC-Prozess wurde nach {0} Sekunden erfolgreich beendet.

# CbmcProcessReturnedWithExitcode
source: CBMC process returned with exitcode {0}.
de: Der CBMC-Prozess wurde mit dem Exitcode {0} beendet.

# CiphertextCaption
source: Ciphertext
de: Geheimtext

# CiphertextEncodingError
source: Encoding of the ciphertext bits returned with an error.
de: Beim Kodieren der Geheimtext-Bits gab es einen Fehler.

# CiphertextTooltip
source: Enter the ciphertext.
de: Geben Sie den Geheimtext ein.

# ClearFileNameCaption
source: Clear file name
de: Dateiname zurücksetzen

# ClearFileNameTooltip
source: Forget the output file name
de: Dateiname zurücksetzen

# CnfFileCaption
source: Save CNF in file
de: CNF in Datei speichern

# CnfFileNotFoundError
source: CNF file not found at {0}.
de: Die CNF-Datei konnte nicht gefunden werden bei {0}.

# CnfFileTooltip
source: Choose filename for saving the resulting CNF.
de: Wählen Sie eine Datei aus, in der die generierte CNF gespeichert wird.

# CodefileNotFoundString
source: C-Code file not found at {0}.
de: Die Datei mit dem Programmcode konnte nicht gefunden werden bei {0}.

# CopyingCnfString
source: Copying CNF to {0}…
de: Kopiert die CNF nach {0}…

# EncodingInputBitsString
source: Encoding input bits in CNF…
de: Kodiert die Eingabe-Bits in der CNF…

# EncodingOutputBitsString
source: Encoding output bits in CNF…
de: Kodiert die Ausgabe-Bits in der CNF…

# FailedString
source: failed
de: fehlgeschlagen

# FileBigWarning
source: File {0} is very big: {1} bytes.
de: Datei {0} ist sehr groß: {1} Bytes.

# FileInputCaption
source: File
de: Datei

# FileInputTooltip
source: Select the input file.
de: Wählen Sie die Eingabedatei aus.

# FixBitsCaption
source: Fix input bits
de: Eingabebits festlegen

source: Fix bits options
de: Optionen zum Festlegen der Bits

# FixBitsTooltip
source: Check for the option to fix some bits.
de: Ankreuzen, um die Optionen für das Festlegen von Bits einzublenden.

# FixedBitsCaption
source: Fixed bits
de: Festgelegte Bits

# FixedBitsEncoding
source: Encoding fixed bits in CNF...
de: Kodiert festgelegte Bits in der CNF…

# FixedBitsEncodingError
source: Encoding of the fixed bits returned with an error.
de: Das Kodieren der festgelegten Bits gab einen Fehler zurück.

# FixedBitsEncodingHint
source: Only use the characters '0', '1' and '*' to fix bits, the character {0} is not allowed.
de: Das Zeichen {0} ist nicht erlaubt. Benutzen Sie nur die Zeichen '0', '1' und '*', um Bits festzulegen.

# FixedBitsEncodingStrangeError
source: Something went wrong in the function encodeFixedBitsInCnf (this code should never be reached).
de: In der Funktion encodeFixedBitsInCnf ist etwas schief gelaufen (dieser Code sollte nie erreicht werden).

# FixedBitsError
source: Error retrieving fixed Bits.
de: Fehler beim Abrufen der festgelegten Bits.

# FixedBitsSizeError
source: The amount of fixed bits should be less or equal to the amount of input bits{0}Fixed bits: {1} bits{0}Input bits: {2} bits{0}The fixed bits are truncated to the size of the input bits from least significant bit to most significant bit.
de: Die Anzahl der festgelegten Bits sollte kleiner oder gleich der Anzahl der Eingabebits sein{0}Festgelegte Bits: {1} Bits{0}Eingabebits: {2} Bits{0}Die festgelegten Bits werden vom niederwertigsten zum höchstwertigsten Bit auf die Größe der Eingabebits gekürzt.

# FixedBitsTooltip
source: Fix an arbitrary number of input bits.
de: Legen Sie eine beliebige Anzahl an Eingabebits fest.

# FixedBitsWarning
source: The fix bits option was selected but no bits were fixed.
de: Die Option zum Festlegen von Bits wurde ausgewählt, aber es wurden keine Bits festgelegt.

# HashEncodingError
source: Hash encoding returned with an error.
de: Das Kodieren des Hashwertes gab einen Fehler zurück.

# HexadecimalString
source: (Hexadecimal): 0x
de: (Hexadezimal): 0x

# HexStringError
source: When using the prefix "0x", ensure the string is an even amount of regular hexadecimal characters.
de: Stellen Sie sicher, dass die Zeichenfolge aus einer geraden Anzahl an regulären Hexadezimalzeichen besteht, wenn das Präfix "0x" benutzt wird.

# InputFoundString
source: Input found!
de: Eingabe gefunden!

# InputHashValueCaption
source: Hash value
de: Hashwert

# InputHashValueTooltip
source: Enter hash value for a preimage or second preimage attack (prefix "0x" for hexadecimal, "0b" for binary).
de: Geben Sie den Hashwert für einen First-Preimage- oder Second-Preimage-Angriff ein (Präfix "0x" für hexadezimal, "0b" für binär).

# InputMappingError
source: Error retrieving input mapping.
de: Fehler beim Abrufen des Eingabe-Mappings.

# InputMessageCaption
source: First preimage
de: Erstes Urbild

# InputMessageTooltip
source: Provide a first preimage for a second preimage attack (prefix "0x" for hexadecimal, "0b" for binary).
de: Geben Sie ein erstes Urbild für den Second-Preimage-Angriff an (Präfix "0x" für hexadezimal, "0b" für binär).

# InputSelectionCaption
source: Input selection
de: Eingabe-Auswahl

# InputSelectionFileInput
source: File input
de: Dateieingabe

# InputSelectionTextInput
source: Text input
de: Texteingabe

# InputSelectionTooltip
source: Select how the ANSI-C code is passed to the SAT Attack component.
de: Wählen Sie aus, wie der ANSI-C-Code an die SAT-Attack-Komponente übergeben wird.

# InputStreamCaption
source: Input stream
de: Eingabestrom

# InputStreamTooltip
source: Connect the input stream to a text input component which contains the ANSI-C code of a cryptographic function.
de: Verbinden Sie den Eingabestrom mit einer Texteingabe-Komponente, in der der ANSI-C-Code einer kryptografischen Funktion steht.

# InputVariablesSizeFailureString
source: Failed to get the size of input variables.
de: Die Ermittlung der Größe der Eingabevariablen ist fehlgeschlagen.

source: Key-recovery attack
de: Key-Recovery-Angriff

source: Key-recovery attack options
de: Optionen für den Key-Recovery-Angriff

# LiteralParseError
source: Failed to parse the literal for {0} variable {1}:{2}.
de: Das Parsen des Literals für {0} Variable {1}:{2} ist fehlgeschlagen.

# LiteralParseError2
source: Failed to parse the literal {0}.
de: Das Parsen des Literals {0} ist fehlgeschlagen.

# MainFunctionCaption
source: Main function name
de: Name der main-Funktion

# MainFunctionTooltip
source: Specify the name of the main function if it is not "main()".
de: Geben Sie den Namen der main-Funktion ein, falls dieser nicht "main()" ist.

# MappingFileNotFoundString
source: Mapping file not found at {0}.
de: Die Mapping-Datei konnte unter {0} nicht gefunden werden.

# NotAHexCharError
source: The character {0} is not a valid hexadecimal character.
de: Das Zeichen {0} ist kein gültiges Hexadezimalzeichen.

# OnlyCnfOutputCaption
source: CNF output only
de: Nur CNF-Ausgabe

# OnlyCnfOutputTooltip
source: Only translate ANSI-C code to CNF and encode the selected attack; do not solve with the SAT solver.
de: Übersetze den ANSI-C-Code in eine CNF und kodiere den gewählten Angriff; der SAT-Solver wird nicht ausgeführt.

# OutputBitsError
source: Error retrieving output bits.
de: Fehler beim Abrufen der Ausgabebits.

# OutputMappingError
source: Error retrieving output mapping.
de: Fehler beim Abrufen des Ausgabe-Mappings.

# OutputSizeError
source: Ensure the specified output has the correct length{0}Hash value / ciphertext: {1} bits{0}Output: {2} bits.
de: Stellen Sie sicher, dass die vorgegebene Ausgabe die korrekte Länge hat{0}Hashwert / Geheimtext: {1} Bits{0}Ausgabe: {2} Bits.

# OutputStreamCaption
source: Output stream
de: Ausgabestrom

# OutputStreamTooltip
source: Writes status information and the result of the attack, if the attack was successful.
de: Gibt Statusinformationen und das Ergebnis des Angriffs aus, falls der Angriff erfolgreich war.

# PlaintextCaption
source: Plaintext
de: Klartext

# PlaintextEncodingError
source: Encoding of the plaintext bits returned with an error.
de: Das Kodieren der Klartextbits gab einen Fehler zurück.

# PlaintextPrefixInfoString
source: Ensure that the provided plaintext has the prefix "0x" or "0b".
de: Stellen Sie sicher, dass der angegebene Klartext entweder das Präfix "0x" oder "0b" hat.

# PlaintextSizeError
source: Ensure the specified plaintext has the correct length (the amount of input bits must be larger than the amount of plaintext bits){0}Plaintext: {1} bits{0}Input: {2} bits.
de: Stellen Sie sicher, dass der angegebene Klartext die korrekte Länge hat (die Anzahl an Eingabebits muss größer als die Anzahl an Klartextbits sein){0}Klartext: {1} Bits{0}Eingabe: {2} Bits.

# PlaintextTooltip
source: Enter the plaintext.
de: Geben Sie den Klartext ein.

# PluginCaption
source: SAT Attack
de: SAT-Angriff

# PluginDescription
source: A tool for SAT-based cryptanalysis
de: Ein Tool für SAT-basierte Kryptoanalyse

# PrefixError
source: Use the prefix "0x" for hexadecimal value or the prefix "0b" for binary value.
de: Benutzen Sie das Präfix "0x" für einen hexadezimalen Wert oder "0b" für einen binären Wert.

source: Preimage attack
de: Preimage-Angriff

source: Preimage attack options
de: Optionen für einen Preimage-Angriff

# SatOutputProcessError
source: Processing of SAT solver output returned an error.
de: Die Bearbeitung der SAT-Solver-Ausgabe gab einen Fehler zurück.

# SatProcessKillException
source: Killing SAT solver process threw an exception: {0} {1}.
de: Die Beendigung des SAT-Solver-Prozesses löste eine Ausnahme aus: {0} {1}.

# SatProcessKillSuccess
source: Successfully killed SAT solver process.
de: Der SAT-Solver-Prozess wurde erfolgreich beendet.

# SatProcessReturnedSuccessful
source: SAT solver process returned successfully after {0} seconds.
de: Der SAT-Solver-Prozess wurde nach {0} Sekunden erfolgreich beendet.

# SatProcessReturnedUnsat
source: SAT solver process returned after {0} seconds... but failed to find a solution.
de: Der SAT-Solver-Prozess wurde nach {0} Sekunden beendet … aber er konnte keine Lösung finden.

# SatSolverOutputFileError
source: SAT solver output file not found at {0}.
de: Die Datei mit der SAT-Solver-Ausgabe konnte nicht gefunden werden bei {0}.

# SatSolverOutputFirstLineError
source: First line in SAT solver output file {0} is not "SAT".
de: In der SAT-Solver-Ausgabedatei {0} steht in der ersten Zeile nicht "SAT".

# SatSolverOutputStreamTooltip
source: Redirect the output of the SAT solver process.
de: Leitet die Ausgabe des SAT-Solver-Prozesses um.

# SatSolverReturnedWithExitcode
source: SAT solver process returned with exitcode {0}.
de: Der SAT-Solver-Prozess wurde mit dem Exitcode {0} beendet.

source: Second preimage attack
de: Second-Preimage-Angriff

source: Second preimage attack options
de: Optionen für den Second-Preimage-Angriff

# SecondPreimageEncodingError
source: Encoding of the second preimage bits returned with an error.
de: Das Kodieren der Second-Preimage-Bits gab einen Fehler zurück.

# SecondPreimageEncodingString
source: Encoding first preimage in CNF…
de: Kodiert das First-Preimage in der CNF …

# SecondPreimageRetrievingError
source: Error retrieving second preimage bits.
de: Fehler beim Abrufen der Second-Preimage-Bits.

# SecondPreimageSizeError
source: Ensure the specified second preimage has the correct length{0}Second preimage: {1} bits{0}Input: {2} bits.
de: Stellen Sie sicher, dass das angegebene Second-Preimage die korrekte Länge hat{0}Second-Preimage: {1} Bits{0}Eingabe: {2} Bits.

# SkippingSatSolverString
source: Skipping SAT solver process…
de: Überpringt SAT-Solver-Prozess…

# SuccessfulString
source: successful
de: erfolgreich

# UnassignedVariableWarning
source: Variable {0}_{1}:{2} does not appear in the {3} mapping. Is the Variable {0}_{1} used in the ANSI-C code? It will be assigned "false" by default.
de: Die Variable {0}_{1}:{2} erscheint nicht in dem {3} Mapping. Wird die Variable {0}_{1} im ANSI-C Code benutzt? Der Variablen wird automatisch der Wert "false" zugeordnet.

# VariableDefinitionsError
source: Make sure the {0} variable definitions start with {1}_0 and the indices are incremented steadily and each variable is actually used in the code.
de: Stellen Sie sicher, dass die {0} Variablen-Deklarationen mit {1}_0 beginnen, dass die Indizes stetig wachsen, und dass jede Variable tatsächlich im C-Code benutzt wird.

# VariableIndexParseError
source: Failed to parse the variable index for {0} variable {1}:{2}.
de: Das Parsen des Variablenindex von {0} Variable {1}:{2} schlug fehl.

# VariableNumberParsingFailedString
source: Failed to read number of {0} variables.
de: Das Auslesen der Anzahl an {0} Variablen schlug fehl.

# VariableSizeParsingFailedString
source: Failed to read size of {0} variables.
de: Das Auslesen der Größe der {0} Variablen schlug fehl.

# InputFoundStringKeyRecovery
source: Key-recovery attack: A key was found that fits to the provided plaintext and ciphertext:
de: Key-Recovery-Angriff: Zum gegebenen Klartext und Geheimtext wurde ein passender Schlüssel gefunden:

# InputFoundStringPreimage
source: Preimage attack: An input was found that fits to the provided hash value:
de: Preimage-Angriff: Zum gegebenen Hashwert wurde eine passende Eingabe gefunden:

# InputFoundStringSecondPreimage
source: Second preimage attack: An input was found that fits to the provided hash value and is different from the provided first preimage:
de: Second-Preimage-Angriff: Zum gegebenen Hashwert wurde eine passende Eingabe gefunden welche sich von dem gegebenen First-Preimage unterscheidet:

# CbmcExeNotFound
source: Could not find the cbmc executable at {0}.
de: Das CBMC-Executable konnte nicht gefunden werden bei {0}.

# satSolverExeNotFound
source: Could not find the SAT solver executable at {0}.
de: Das SAT-Solver-Executable konnte nicht gefunden werden bei {0}.
