Repository: CrypToolProject/CrypTool-2
Catalog: OnlineDocumentationGenerator/Properties/Resources.*.resx
Languages: de, ru

# HtmlGenerator_GenerateConnectorListCode_Name
source: Name
ru: имя

# HtmlGenerator_GenerateConnectorListCode_Description
source: Description
de: Beschreibung
ru: Описание

# HtmlGenerator_GenerateSettingsListCode_Type
source: Type
de: Typ
ru: Тип

# HtmlGenerator_GenerateConnectorListCode_Direction
source: Direction
de: Richtung
ru: направление

# HtmlGenerator_GenerateConnectorListCode_Type
source: Type
de: Typ
ru: Тип

source: File
de: Datei
ru: файл

source: Description
de: Beschreibung
ru: Описание

source: Not available.
de: Nicht verfügbar.
ru: Недоступен.

# NoContent
source: None
de: Keine
ru: Никто

source: Null
ru: Ноль

# Templates_description
source: The templates listed below are available for this component.
de: Die unten aufgelisteten Vorlagen sind für diese Komponente verfügbar.
ru: Шаблоны, перечисленные ниже, доступны для этого компонента.

source: Text box
ru: Текстовое окно

source: Combo box
de: Kombinationsfeld
ru: Поле со списком

source: Radio button
de: Optionsfeld
ru: Переключатель

source: Check box
de: Auswahlkasten
ru: Флажок

source: Open file dialog
de: Datei-Öffnen-Dialog
ru: Диалоговое окно открытия файла

source: Save file dialog
de: Datei-Speichern-Dialog
ru: Сохранить диалог файла

source: Numeric up/down
de: Numerisch hoch/runter
ru: Числовой вверх / вниз

source: Button
de: Taste
ru: кнопка

source: Slider
de: Gleiter
ru: ползунок

source: Text box (read only)
de: Textbox (nur lesen)
ru: Текстовое поле (только для чтения)

source: Dynamic combo box
de: Dynamisches Kombinationsfeld
ru: Динамический комбинированный блок

source: Text box (hidden)
de: Textbox (versteckt)
ru: Текстовое поле (скрыто)

source: Input data
de: Eingabedaten
ru: Входные данные

source: Output data
de: Ausgabedaten
ru: Выходные данные

source: Control slave
de: Kontroll-Sklave
ru: Управляющий подчиненный

source: Control master
de: Kontroll-Meister
ru: Контрольный мастер

# Category_CiphersModernAsymmetric
source: Modern asymmetric ciphers
de: Moderne asymmetrische Verfahren
ru: Современные асимметричные шифры

# Category_CiphersModernSymmetric
source: Modern symmetric ciphers
de: Moderne symmetrische Verfahren
ru: Современные симметричные шифры

# Category_Classic_Ciphers
source: Classic ciphers
de: Klassische Verfahren
ru: Классические шифры

# Category_CryptanalysisGeneric
source: Cryptanalysis - Generic
de: Generische Kryptoanalyse
ru: Криптоанализ - общий

# Category_CryptanalysisSpecific
source: Cryptanalysis - Specific
de: Spezifische Kryptoanalyse
ru: Криптоанализ - Конкретный

# Category_HashFunctions
source: Hash functions
de: Hash-Funktionen
ru: Хэш-функции

# Category_Protocols
source: Protocols
de: Protokolle
ru: протоколы

# Category_Steganography
source: Steganography
de: Steganografie
ru: стеганография

# Category_ToolsBoolean
source: Tools - Boolean
de: Werkzeuge - Boolean
ru: Инструменты - Boolean

# Category_ToolsDataflow
source: Tools - Dataflow
de: Werkzeuge - Dataflow
ru: Инструменты - поток данных

# Category_ToolsDataInputOutput
source: Tools - Data input and output
de: Werkzeuge - Daten-Ein- und Ausgabe
ru: Инструменты - ввод и вывод данных

# Category_ToolsMisc
source: Tools - Miscellaneous
de: Werkzeuge - Diverse
ru: Инструменты - Разное

# Category_ToolsP2P
source: Tools - Peer2Peer
de: Werkzeuge - Peer2Peer
ru: Инструменты - Peer2Peer

# Category_Unknown
source: Others
de: Andere
ru: другие

source: Key text box
ru: Ключевое текстовое поле

# LatexGenerator_ChapterSubTitle
source: The Templates
de: Die Vorlagen
ru: Шаблоны

# LatexGenerator_ChapterTitle
source: Overview over the Templates
de: Übersicht über die Vorlagen
ru: Обзор шаблонов

# ComponentTemplate_Introduction
source: Introduction
de: Einleitung
ru: Введение

# ComponentTemplate_Presentation
source: Presentation
de: Präsentation
ru: презентация

# ComponentTemplate_Usage
source: Usage
de: Benutzung
ru: Применение

# ComponentTemplate_Connections
source: Connections
de: Konnektoren
ru: связи

# ComponentTemplate_Settings
source: Settings
de: Einstellungen
ru: настройки

# Category_FL_CiphersModernAsymmetric
source: Modern Ciphers\ Asymmetric
de: Moderne Verfahren\ Asymmetrisch
ru: Современные шифры \ Асимметричные

# Category_FL_CiphersModernSymmetric
source: Modern Ciphers\ Symmetric
de: Moderne Verfahren\ Symmetrisch
ru: Современные шифры \ Симметричные

# Category_FL_Classic_Ciphers
source: Classic Ciphers
de: Klassische Verfahren
ru: Классические шифры

# Category_FL_CryptanalysisGeneric
source: Cryptanalysis\ Generic
de: Kryptoanalyse\ Generisch
ru: Криптоанализ \ Общий

# Category_FL_CryptanalysisSpecific
source: Cryptanalysis\ Specific
de: Kryptoanalyse\ Spezifisch
ru: Криптоанализ \ Конкретный

# Category_FL_HashFunctions
source: Hash functions
de: Hash-Funktionen
ru: Хэш-функции

# Category_FL_Protocols
source: Protocols
de: Protokolle
ru: протоколы

# Category_FL_Steganography
source: Steganography
de: Steganografie
ru: стеганография

# Category_FL_ToolsBoolean
source: Tools\ Boolean
de: Werkzeuge\ Boolean
ru: Инструменты \ Boolean

# Category_FL_ToolsDataflow
source: Tools\ Data flow
de: Werkzeuge\ Datenfluss
ru: Инструменты \ Поток данных

# Category_FL_ToolsDataInputOutput
source: Tools\ Data input/output
de: Werkzeuge\ Daten-Ein-/Ausgabe
ru: Инструменты \ Ввод / вывод данных

# Category_FL_ToolsMisc
source: Tools\ Misc
de: Werkzeuge\ Sonstige
ru: Инструменты \ Разное

# Category_FL_ToolsP2P
source: Tools\ Peer-to-peer
de: Werkzeuge\ Peer-to-peer
ru: Инструменты \ Peer-to-peer

# Category_FL_Unknown
source: Others
de: Andere
ru: другие

# FL_Letter_Component
source: C
de: K
ru: С

source: Language Selector
de: Sprachauswahl
ru: языковой переключатель

# Category_FL_DECRYPT
source: DECRYPT Project
de: DECRYPT Projekt
ru: Проект DECRYPT

# Category_ToolsCodes
source: Tools\ Codes
de: Werkzeuge\ Kodierungen
ru: Инструменты\ кодирование

# Category_ToolsRandomNumbers
source: Tools\ Random Number
de: Werkzeuge\ Zufallszahlen
ru: Инструменты\ случайные числа

# FL_Tutorial
source: Crypto tutorials
de: Kryptotutorien
