Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/Enigma/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# InputGramsCaption
source: n-gram dictionary
de: N-Gramm-Wörterbuch
ru: словарь n-gram
zh_cn: n-gram字典

# InputGramsTooltip
source: Dictionary with gram counts (string -> [absolute, percentaged, log2])
de: Wörterbuch mit N-Gramm-Häufigkeiten (string -> [absolut, prozentual, log2])
ru: Словарь с грамм-счетом (строка -> [абсолютный, процентный, лог2])
zh_cn: 带有克计数的字典（字符串-&gt; [绝对，百分比，log2]）

# TextInputCaption
source: Text input
de: Texteingabe
ru: Ввод текста
zh_cn: 文字输入

# TextInputTooltip
source: Input a text to be encrypted or decrypted by the Enigma machine
de: Geben Sie den mit der Enigma zu ver-/entschlüsselnden Text ein.
ru: Введите текст, который должен быть зашифрован или расшифрован машиной Enigma
zh_cn: 输入要由Enigma机器加密或解密的文本

# TextOutputCaption
source: Text output
de: Textausgabe
ru: Вывод текста
zh_cn: 文字输出

# TextOutputTooltip
source: The processed text, encrypted or decrypted by the Enigma machine
de: Der mit der Enigma ver-/entschlüsselte Text.
ru: Обработанный текст, зашифрованный или дешифрованный машиной Enigma
zh_cn: 由Enigma机器加密或解密的已处理文本

# PluginCaption
source: Enigma
ru: загадка
zh_cn: 谜

# PluginTooltip
source: Polyalphabetic rotor-cipher machine
de: Polyalphabetische Rotor-Chiffriermaschine
ru: Полиалафитная роторно-шифровая машина
zh_cn: 多字母转子密码机

# CaseHandlingCaption
source: Case handling
de: Groß-/Kleinschreibung
ru: Обработка корпуса
zh_cn: 案件处理

# CaseHandlingTooltip
source: What should be done with upper and lower case letters?
de: Wie sollen Groß- und Kleinbuchstaben behandelt werden?
ru: Что нужно делать с помощью строчных и строчных букв?
zh_cn: 大写和小写字母应该怎么做？

# KeyTooltip
source: Please provide the initial rotor setting for each rotor, e.g. ABCD. Note that the slowest rotor is on the left and the fastest rotor is on the right. Only the Enigma M4 ("Shark") uses four rotors.
de: Geben Sie die Startposition für jeden Rotor an, z.B. ABCD. Der langsamste Rotor ist links, der schnellste rechts. Nur die Enigma M4 ("Shark") verwendet 4 Rotoren.
ru: Пожалуйста, предоставьте начальную настройку ротора для каждого ротора, например, ABCD. Обратите внимание, что самый медленный ротор находится слева, а самый быстрый ротор - справа. Только Enigma M4 («Акула») использует четыре ротора.
zh_cn: 请提供每个转子的初始转子设置，例如ABCD。请注意，最慢的转子在左边，最快的转子在右边。仅Enigma M4（“鲨鱼”）使用四个转子。

# ModelCaption
source: Enigma model
de: Enigma-Modell
ru: Модель Enigma
zh_cn: 谜模型

# ModelTooltip
source: Please select which Enigma model you want to use. This setting influences the available rotors and their inner wiring.
de: Wählen Sie das Enigma-Modell. Verschiedene Modelle verwenden unterschiedliche Rotoren mit unterschiedlicher innerer Verdrahtung.
ru: Выберите, какую модель Enigma вы хотите использовать. Эта настройка влияет на доступные роторы и их внутреннюю проводку.
zh_cn: 请选择您要使用的Enigma模型。该设置会影响可用的转子及其内部接线。

# ModelTPCaption
source: Enigma model
de: Enigma-Modell
ru: Модель Enigma
zh_cn: 谜模型

# ModelTPTooltip
source: Please select which Enigma model you want to use. This setting influences the available rotors and their inner wiring.
de: Wählen Sie das Enigma-Modell. Verschiedene Modelle verwenden unterschiedliche Rotoren mit unterschiedlicher innerer Verdrahtung.
ru: Выберите, какую модель Enigma вы хотите использовать. Эта настройка влияет на доступные роторы и их внутреннюю проводку.
zh_cn: 请选择您要使用的Enigma模型。该设置会影响可用的转子及其内部接线。

# PlugBoardCaption
source: Substitution:
ru: Замена:
zh_cn: 替代：

# PlugBoardTooltip
source: Displays the current substitution
de: Zeigt die aktuelle Substitution
ru: Отображает текущую замену
zh_cn: 显示当前替换

# PlugBoardLetterTooltip
source: Select the letter for connecting this plug.
de: Mit welchem Buchstaben soll dieser Stecker verbunden werden?
ru: Выберите букву для подключения этого вилка.
zh_cn: 选择用于连接此插头的字母。

# PresentationSpeedCaption
source: Presentation speed
de: Darstellungsgeschwindigkeit
ru: Скорость передачи данных
zh_cn: 演示速度

# PresentationSpeedTooltip
source: Change the pace of the presentation
de: Ändern Sie die Geschwindigkeit der Darstellung
ru: Изменение темпа презентации
zh_cn: 改变演讲的节奏

# ReflectorCaption
source: Reflector
de: Umkehrwalze
ru: рефлектор
zh_cn: 反光板

# ReflectorTooltip
source: Select the used reflector. If you don't want to use a reflector, select none here.
de: Wählen Sie die verwendete Umkehrwalze. Wenn Sie keine Umkehrwalze verwenden wollen, wählen Sie 'keine'.
ru: Выберите использованный отражатель. Если вы не хотите использовать отражатель, выберите его здесь.
zh_cn: 选择使用的反射器。如果您不想使用反射器，请在此处不选择任何一个。

# ResetPlugboardCaption
source: Remove all plugs
de: Alle Steckerverbindungen entfernen
ru: Снять все заглушки
zh_cn: 拔下所有插头

# ResetPlugboardTooltip
source: By pressing this button the plugboard is reset to its empty state, i.e. all plugs are removed
de: Wenn Sie diese Schaltfläche drücken, wird das Steckerbrett in den Anfangszustand versetzt, d.h. alle Steckerverbindungen werden entfernt.
ru: При нажатии этой кнопки плагин сбрасывается в состояние пустого состояния, то есть все разъемы удаляются
zh_cn: 通过按下此按钮，可将插板重置为空状态，即，将所有插头拔出

# Ring1Caption
source: Ring 1 (right)
de: Ring 1 (rechts)
ru: Кольцо 1 (справа)
zh_cn: 环1（右）

# Ring1Tooltip
source: Select the the offset for ring 1
de: Wählen Sie den Versatz für Ring 1
ru: Выберите смещение для кольца 1
zh_cn: 选择环1的偏移量

# Ring2Caption
source: Ring 2
ru: Кольцо 2
zh_cn: 2环

# Ring2Tooltip
source: Select the the offset for ring 2
de: Wählen Sie den Versatz für Ring 2
ru: Выберите смещение для кольца 2
zh_cn: 选择环2的偏移量

# Ring3Caption
source: Ring 3
ru: Кольцо 3
zh_cn: 3环

# Ring3Tooltip
source: Select the the offset for ring 3
de: Wählen Sie den Versatz für Ring 3
ru: Выберите смещение для кольца 3
zh_cn: 选择环3的偏移量

# Ring4Caption
source: Ring 4 (left)
de: Ring 4 (links)
ru: Кольцо 4 (слева)
zh_cn: 环4（左）

# Ring4Tooltip
source: Select the the offset for ring 4
de: Wählen Sie den Versatz für Ring 4
ru: Выберите смещение для кольца 4
zh_cn: 选择环4的偏移量

# Rotor1Caption
source: Rotor 1 (fastest/right)
de: Rotor 1 (schnell/rechts)
ru: Ротор 1 (самый быстрый / правый)
zh_cn: 转子1（最快/最右）

# Rotor1Tooltip
source: Select the rotor used on the right (fastest) position.
de: Wählen Sie den Rotor für die rechte (schnellste) Position.
ru: Выберите ротор, используемый в правой (самой быстрой) позиции.
zh_cn: 选择在右侧（最快）位置使用的转子。

# Rotor2Caption
source: Rotor 2
ru: Ротор 2
zh_cn: 转子2

# Rotor2Tooltip
source: Select the rotor used on the second position.
de: Wählen Sie den Rotor für die zweite Position.
ru: Выберите ротор, используемый во втором положении.
zh_cn: 选择第二个位置上使用的转子。

# Rotor3Caption
source: Rotor 3
ru: Ротор 3
zh_cn: 转子3

# Rotor3Tooltip
source: Select the rotor used on the third position.
de: Wählen Sie den Rotor für die dritte Position.
ru: Выберите ротор, используемый в третьей позиции.
zh_cn: 选择在第三位置使用的转子。

# Rotor4Caption
source: Rotor 4 (slowest/left)
de: Rotor 4 (langsam/links)
ru: Ротор 4 (самый медленный / левый)
zh_cn: 转子4（最慢/向左）

# Rotor4Tooltip
source: Select the rotor used on the fourth position. If you want to use only three rotors, select none here.
de: Wählen Sie den Rotor für die vierte Position. Wenn Sie nur 3 Rotoren verwenden wollen, wählen Sie hier 'keinen'.
ru: Выберите ротор, используемый в четвертой позиции. Если вы хотите использовать только три ротора, выберите none здесь.
zh_cn: 选择在第四位置使用的转子。如果您只想使用三个转子，则在此处不选择任何一个。

# UnknownSymbolHandlingCaption
source: Unknown symbol handling
de: Behandlung ungültiger Zeichen
ru: Неизвестная обработка символов
zh_cn: 未知符号处理

# UnknownSymbolHandlingTooltip
source: What should be done with characters in the input that are not included in the alphabet?
de: Wie soll auf Zeichen in der Eingabe reagiert werden, die nicht Bestandteil des Eingabe-Alphabets sind?
ru: Что нужно делать с символами ввода, которые не включены в алфавит?
zh_cn: 输入中未包含在字母中的字符应该怎么做？

# CaseHandlingList1
source: Preserve case
de: keine Änderung
ru: Запасной корпус
zh_cn: 保留大小写

# CaseHandlingList2
source: Convert to upper
de: in Großbuchstaben konvertieren
ru: Преобразовать в верхнюю
zh_cn: 转换为上

# CaseHandlingList3
source: Convert to lower
de: in Kleinbuchstaben konvertieren
ru: Преобразовать в нижний
zh_cn: 转换为较低

# ModelList1
source: Commercial Enigma A/B - since 1924
de: Kommerzielle Enigma A/B - seit 1924
ru: Коммерческая Enigma A / B - с 1924 года
zh_cn: 商业之谜A / B-自1924年以来

# ModelList2
source: Commercial Enigma D
de: Kommerzielle Enigma D
ru: Коммерческая Enigma D
zh_cn: 商业之谜D

# ModelList3
source: Reichsbahn (Rocket) - since 1941
de: Reichsbahn (Rocket) - seit 1941
ru: Рейхсбан (Ракета) - с 1941 года
zh_cn: Reichsbahn（Rocket）-自1941年以来

# ModelList4
source: Enigma I / M3
zh_cn: 谜I / M3

# ModelList5
source: M4 (Shark)
zh_cn: M4（鲨鱼）

# ModelList6
source: K-Model
de: Modell K
ru: K-модель
zh_cn: K模型

# ModelList7
source: G (Defense model)
de: G ("Abwehr-Enigma")
ru: G (Модель обороны)
zh_cn: G（防御模型）

# UnknownSymbolHandlingList1
source: Ignore (leave unmodified)
de: Ignorieren (nicht ändern)
ru: Игнорировать (оставить без изменений)
zh_cn: 忽略（保留未修改的内容）

# UnknownSymbolHandlingList2
source: Remove
de: Entfernen
ru: Удалить
zh_cn: 去掉

# UnknownSymbolHandlingList3
source: Replace with 'X'
de: Ersetzen durch 'X'
ru: Заменить на «X»
zh_cn: 替换为“ X”

# PlugboardGroup
source: Plugboard
de: Steckerbrett
ru: коммутационная панель
zh_cn: 插板

# PresentationGroup
source: Presentation
de: Darstellung
ru: презентация
zh_cn: 介绍

# RingSettingsGroup
source: Ring settings
de: Ringstellung
ru: Настройки звонка
zh_cn: 铃声设置

# TextOptionsGroup
source: Text options
de: Text-Optionen
ru: Параметры текста
zh_cn: 文字选项

# UsedRotorsGroup
source: Rotors used
de: Verwendete Rotoren
ru: Используемые роторы
zh_cn: 使用的转子

# Ringstellung_
source: Ring settings:
de: Ringstellung:
ru: Настройки звонка:
zh_cn: 铃声设置：

# Rotorlage_
source: Rotor position:
de: Rotorlage:
ru: Положение ротора:
zh_cn: 转子位置：

source: Please stop the Workspace for Presentation!
de: Bitte halten Sie den Workspace an, um die Präsentation anzuzeigen!
ru: Остановите рабочую область для презентации!
zh_cn: 请停止工作区进行演示！

# Reflector10
source: Not available for this model.
de: Für dieses Modell nicht vorhanden.
ru: Недоступно для этой модели.
zh_cn: 不适用于此型号。

# Reflector2
source: UKW B (2. November 1937)
ru: UKW B (2. ноября 1937 года)
zh_cn: UKW B（1937年11月2日）

# Reflector3
source: UKW C (since 1940/41)
de: UKW C (seit 1940/41)
ru: UKW C (с 1940/41 г.)
zh_cn: UKW C（自1940/41起）

# Reflector5
source: UKW (Rocket) -- since 7th Feb. 1941
de: UKW (Reichsbahn) -- seit 7. Feb. 1941
ru: UKW (Rocket) - с 7 февраля 1941 года
zh_cn: UKW（火箭）-自2月7日起。 1941年

# Reflector6
source: UKW B "thin" -- since 1st Feb. 1942
de: UKW B "dünn" -- seit 1. Feb. 1942
ru: UKW B «тонкий» - с 1 февраля 1942 года
zh_cn: UKW B“薄”-自2月1日起。 1942年

# Reflector7
source: UKW C "thin" -- since 1st July 1943
de: UKW C "dünn" -- seit 1. Juli 1943
ru: UKW C «тонкий» - с 1 июля 1943 года
zh_cn: UKW C“薄”-自1943年7月1日起

# Reflector8
source: UKW (K) -- since Feb. 1939
de: UKW (K) -- seit Feb. 1939
ru: UKW (K) - с февраля. 1939
zh_cn: UKW（K）-自2月起1939年

# RotorA1
source: I (since 1930)
de: I (seit 1930)
ru: Я (с 1930 года)
zh_cn: 我（自1930年起）

# RotorA10
source: II (C) -- since 1924
de: II (C) -- seit 1924
ru: II (C) - с 1924 года
zh_cn: II（C）-自1924年以来

# RotorA11
source: III (C) -- since 1924
de: III (C) -- seit 1924
ru: III (C) - с 1924 года
zh_cn: III（C）-自1924年以来

# RotorA15
source: I (Rocket) -- since 7th Feb. 1941
de: I (Reichsbahn) -- seit 7. Feb. 1941
ru: I (Ракета) - с 7 февраля 1941 года
zh_cn: I（火箭）-自1941年2月7日起

# RotorA16
source: II (Rocket) -- since 7th Feb. 1941
de: II (Reichsbahn) -- seit 7. Feb. 1941
ru: II (Ракета) - с 7 февраля 1941 года
zh_cn: II（火箭）-自1941年2月7日起

# RotorA17
source: III (Rocket) -- since 7th Feb. 1941
de: III (Reichsbahn) -- seit 7. Feb. 1941
ru: III (Ракета) - с 7 февраля 1941 года
zh_cn: III（火箭）-自1941年2月7日起

# RotorA18
source: I (K) -- since Feb. 1939
de: I (K) -- seit Feb. 1939
ru: I (K) - с февраля 1939 года
zh_cn: 我（K）-自1939年2月以来

# RotorA19
source: II (K) -- since Feb. 1939
de: II (K) -- seit Feb. 1939
ru: II (K) - с февраля 1939 года
zh_cn: II（K）-自1939年2月以来

# RotorA2
source: II (since 1930)
de: II (seit 1930)
ru: II (с 1930 года)
zh_cn: II（自1930年起）

# RotorA20
source: III (K) -- since Feb. 1939
de: III (K) -- seit Feb. 1939
ru: III (K) - с февраля 1939 года
zh_cn: III（K）-自1939年2月以来

# RotorA21
source: I (G)
zh_cn: 我（G）

# RotorA3
source: III (since 1930)
de: III (seit 1930)
ru: III (с 1930 года)
zh_cn: III（从1930年起）

# RotorA4
source: IV (since 1938, M3 "Heer")
de: IV (seit 1938, M3 "Heer")
ru: IV (с 1938 года, М3 «Хеер»)
zh_cn: IV（自1938年以来，M3“ Heer”）

# RotorA5
source: V (since 1938, M3 "Heer")
de: V (seit 1938, M3 "Heer")
ru: V (с 1938 года, M3 «Heer»)
zh_cn: V（自1938年以来，M3“ Heer”）

# RotorA6
source: VI (since 1939, M3/M4)
de: VI (seit 1939, M3/M4)
ru: VI (с 1939 года, M3 / M4)
zh_cn: VI（1939年起，M3 / M4）

# RotorA7
source: VII (since 1939, M3/M4)
de: VII (seit 1939, M3/M4)
ru: VII (с 1939 года, M3 / M4)
zh_cn: VII（1939年起，M3 / M4）

# RotorA8
source: VIII (since 1939, M3/M4)
de: VIII (seit 1939, M3/M4)
ru: VIII (с 1939 года, M3 / M4)
zh_cn: 八（自1939年起，M3 / M4）

# RotorA9
source: I (C) -- since 1924
de: I (C) -- seit 1924
ru: I (C) - с 1924 года
zh_cn: 我（C）-自1924年以来

# RotorB1
source: Not available for this model.
de: Für dieses Modell nicht vorhanden.
ru: Недоступно для этой модели.
zh_cn: 不适用于此型号。

# RotorB2
source: Beta -- since 1st Feb. 1942
de: Beta -- seit 1. Feb. 1942
ru: Бета - с 1 февраля 1942 года
zh_cn: Beta-自1942年2月1日起

# RotorB3
source: Gamma -- since 1st July 1943
de: Gamma -- seit 1. Juli 1943
ru: Гамма - с 1 июля 1943 года
zh_cn: 伽玛-自1943年7月1日起

# EnigmaPresentationFrame_ChangeStatus_Presentation_aktive
source: Presentation active
de: Präsentation aktiv
ru: Активная презентация
zh_cn: 演示活动

# EnigmaPresentationFrame_ChangeStatus_Presentation_ready
source: Presentation ready
de: Präsentation bereit
ru: Презентация готова
zh_cn: 演示准备好

# EnigmaPresentationFrame_ChangeStatus
source: Workspace active, Presentation turned off
de: Workspace aktiv, Präsentation abgeschaltet
ru: Рабочая область активна, Презентация отключена
zh_cn: 工作区处于活动状态，演示文稿已关闭

# EnigmaPresentationFrame_ChangeStatus_Präsentation_turned_off
source: Presentation turned off
de: Präsentation abgeschaltet
ru: Презентация отключена
zh_cn: 演示已关闭

# EnigmaPresentationFrame_visbileCheckbox_Checked_Restart_Workspace
source: Restart Workspace
de: Workspace neu starten
ru: Перезапустить рабочую область
zh_cn: 重新启动工作区

# PresentationActivation
source: Activate Presentation
de: Präsentation aktivieren
ru: Активировать презентацию
zh_cn: 激活演示

# KeyInputCaption
source: Key input
de: Schlüssel-Eingabe
ru: Ввод ключа
zh_cn: 按键输入

# KeyInputTooltip
source: Input an Enigma key containing the rotors to use, the rings to use, and the plugboard connections.
de: Eingabe eines Enigma-Schlüssels, der die zu verwendenden Rotoren, Ringe und Steckbrett-Verbindungen beinhaltet
ru: Введите ключ Enigma, содержащий используемые роторы, используемые кольца и соединения с плагинами.
zh_cn: 输入一个Enigma键，其中包含要使用的转子，要使用的环和插头的连接。

# InitialRotorPosCaption
source: Initial rotor setting
de: Rotorlage
ru: Установка начального ротора
zh_cn: 初始转子设定

# InitialRotorPosTooltip
source: Enter the initial position of the rotors (for example AAAA).
de: Geben sie die initiale Lage der Rotoren an (z.B. AAAA).
ru: Введите начальное положение роторов (например, AAAA).
zh_cn: 输入转子的初始位置（例如AAAA）。

# RotorA12
source: I (D)
ru: Я БЫ)
