Repository: CrypToolProject/CrypTool-2
Catalog: CrypPlugins/WorkspaceManager/Properties/Resources.*.resx
Languages: de, ru, zh_cn

# AnalysisGeneric_Label
source: Analysis/Generic:
de: Analyse/Generisch:
ru: Анализ / Общие:
zh_cn: 分析/通用：

# AnalysisSpecific_Label
source: Analysis/Specific:
de: Analyse/Spezifisch:
ru: Анализ / Конкретные:
zh_cn: 分析/具体：

# Asymmetric_Label
source: Asymmetric:
de: Asymmetrisch:
ru: Асимметричный:
zh_cn: 不对称：

# BBox_Add_Image_to_Workspace_Tooltip
source: Add image to workspace
de: Dem Arbeitsbereich ein Bild hinzufügen
ru: Добавить изображение в рабочее пространство
zh_cn: 将图像添加到工作区

# BBox_Add_Text_to_Workspace_Tooltip
source: Add memo (for descriptions) to the workspace
de: Dem Arbeitsbereich ein Memofeld (für Beschreibungen) hinzufügen
ru: Добавить заметку (для описания) в рабочую область
zh_cn: 将备忘录（用于描述）添加到工作空间

# BBox_Fit_to_Screen_Tooltip
source: Adjust the zoom of the workspace automatically so that all components can be seen to the maximum (Ctrl + F)
de: Passt den Zoom des Arbeitsbereichs automatisch so an, dass alle Komponenten sichtbar sind (Strg + F)
ru: Настройте масштаб рабочей области автоматически, чтобы все компоненты были видны (Ctrl + F)
zh_cn: 自动调整工作区的缩放，以便可以最大程度地看到所有组件（Ctrl + F）

# BBox_Sort_Caption
source: Sort
de: Sortieren
ru: Сортировать
zh_cn: 分类

# BBox_Sort_Tooltip
source: Sort
de: Sortieren
ru: Сортировать
zh_cn: 分类

# Benchmark_Label
source: Benchmark
ru: эталонный тест
zh_cn: 基准测试

# Benchmark_Tooltip
source: Should the execution engine benchmark the executed functions per second?
de: Soll die Execution-Engine die aufgerufenen Funktionen auf Sekunden-Basis evaluieren?
ru: Должна ли система исполнения проверять выполняемые функции в секунду?
zh_cn: 执行引擎是否应该每秒对执行的功能进行基准测试？

# Classic_Label
source: Classic:
de: Klassisch:
zh_cn: 经典：

source: Class not found
de: Klasse nicht gefunden
ru: Класс не найден
zh_cn: 找不到课程

# DataTooltip
source: Data
de: Daten
ru: Данные
zh_cn: 数据

# Datatypecolors_Label
source: Data type colors:
de: Datentyp-Farben:
ru: Цвет данных данных:
zh_cn: 数据类型颜色：

source: Debug
ru: Отлаживать
zh_cn: 除错

# DebugCheckedFalseTooltip
source: Show debugs
de: Debugmeldungen anzeigen
ru: Показать отладки
zh_cn: 显示调试

# DebugCheckedTrueTooltip
source: Hide debugs
de: Debugmeldungen ausblenden
ru: Скрыть отладки
zh_cn: 隐藏调试

source: Delete all messages
de: Alle Nachrichten löschen
ru: Удалить все сообщения
zh_cn: 删除所有讯息

# Delete_all_messagesTooltip
source: Clear log panel
de: Protokollfenster löschen
ru: Очистить панель журнала
zh_cn: 清除日志面板

source: Error
de: Fehler
ru: ошибка
zh_cn: 错误

# ErrorCheckedFalseTooltip
source: Show error
de: Fehler anzeigen
ru: Показать ошибку
zh_cn: 显示错误

# ErrorCheckedTrueTooltip
source: Hide error
de: Fehler ausblenden
ru: Скрыть ошибку
zh_cn: 隐藏错误

# Functioncolors_Label
source: Function colors:
de: Funktionen-Farben:
ru: Цвета функции:
zh_cn: 功能颜色：

# GUIUpdateinterval_Label
source: GUI update interval:
de: GUI-Updateintervall:
zh_cn: GUI更新间隔：

# GUIUpdateinterval_Tooltip
source: Sets the interval for updating GUI elements during execution
de: Setze das Intervall für die Aktualisierung der GUI-Elemente während der Ausführung
ru: Установите интервал обновления для обновления GUI-элементов во время выполнения
zh_cn: 设置执行期间更新GUI元素的间隔

# Hash_Label
source: Hash:
zh_cn: 杂凑：

source: Info
de: Informationen
ru: Информация
zh_cn: 信息

# InfoCheckedFalseTooltip
source: Show information
de: Informationen anzeigen
ru: Показать информацию
zh_cn: 显示信息

# InfoCheckedTrueTooltip
source: Hide information
de: Informationen ausblenden
ru: Скрыть информацию
zh_cn: 隐藏信息

# LogTooltip
source: Log
de: Protokoll
ru: Журнал
zh_cn: 日志记录

# Main_Settings
source: Main
de: Haupt-Einstellungen
ru: Главный
zh_cn: 主要

# MaximizeTooltip
source: Maximize
de: Maximieren
ru: максимизировать
zh_cn: 最大化

# MinimizeTooltip
source: Minimize
de: Minimieren
ru: Минимизировать
zh_cn: 最小化

source: No data
de: Keine Daten
ru: Нет данных
zh_cn: 没有数据

# PluginCaption
source: Workspace
de: Arbeitsbereich
ru: Рабочее пространство
zh_cn: 工作空间

# PluginTooltip
source: Graphical editor for a CT2 workspace
de: Graphischer Editor für eine CT2-Arbeitsfläche
ru: рафический редактор для рабочей поверхности CT2
zh_cn: CT2工作区的图形编辑器

# PresentationTooltip
source: Presentation
de: Präsentation
ru: презентация
zh_cn: 介绍

# Protocols_Label
source: Protocols:
de: Protokolle:
ru: Протоколы:
zh_cn: 协议：

# RepeatTooltip
source: Repeat
de: Wiederholen
ru: Повторение
zh_cn: 重复

# ResetColors_Label
source: Reset colors
de: Farben rücksetzen
ru: Сбросить цвета
zh_cn: 重置颜色

# ResetColors_Tooltip
source: Reset all colors to their default values.
de: Setze alle Farben auf die Voreinstellungen zurück
ru: Сбросьте все цвета до значений по умолчанию
zh_cn: 将所有颜色重置为其默认值。

# SettingsTooltip
source: Settings
de: Einstellungen
ru: настройки
zh_cn: 设定值

# Show_IControlsTooltip
source: Show Embedded Components
de: Zeige eingebettete Komponenten
ru: Показать встроенные компоненты
zh_cn: 显示嵌入式组件

# SleepTime_Label
source: Sleep time:
de: Wartezeit:
ru: Время сна:
zh_cn: 睡觉时间：

# SleepTime_Tooltip
source: Set the sleeping-time between execution of functions (in miliseconds)
de: Setze die Wartezeit zwischen der Ausführung von Funktionen (in Millisekunden)
ru: Установите время сна между выполнением функций (в милисекундах)
zh_cn: 设置函数执行之间的睡眠时间（以毫秒为单位）

# Steganography_Label
source: Steganography:
de: Steganografie:
ru: Стеганография:
zh_cn: 隐写术：

# Symmetricblock_Label
source: Symmetric block:
de: Symmetrisch (Block):
ru: Симметричный блок:
zh_cn: 对称块：

# SynchronousEvents_Label
source: Synchronous events
de: Synchrone Ereignisse
ru: Синхронные события
zh_cn: 同步事件

# SynchronousEvents_Tooltip
source: Set the behaviour of event handling of the execution engine
de: Wähle die Art der Ereignisbehandlung der Execution-Engine
ru: Задайте поведение обработки событий для механизма выполнения
zh_cn: 设置执行引擎的事件处理行为

# Tools_Label
source: Tools:
de: Werkzeuge:
ru: Инструменты:
zh_cn: 工具：

# unnamed_project
source: New project
de: Neues Projekt
ru: Новый проект
zh_cn: 新项目

source: Warning
de: Warnungen
ru: Предупреждение
zh_cn: 警告

# WarningCheckedFalseTooltip
source: Show warning
de: Warnungen anzeigen
ru: Показать предупреждение
zh_cn: 显示警告

# WarningCheckedTrueTooltip
source: Hide warning
de: Warnungen ausblenden
ru: Скрыть предупреждение
zh_cn: 隐藏警告

# WorkspaceManagerSettings
source: Workspace
de: Arbeitsplatz
ru: Рабочее пространство
zh_cn: 工作空间

# HelpTooltip
source: Help
de: Hilfe
ru: Помогите
zh_cn: 救命

source: Align center
de: Zentriert
ru: Выровнять центр
zh_cn: 居中对齐

source: Align justify
de: Blocksatz
ru: Выровнять поровну
zh_cn: 对齐对齐

source: Align left
de: Linksbündig
ru: Выровнять по левому краю
zh_cn: 左对齐

source: Align right
de: Rechtsbündig
ru: Выровнять вправо
zh_cn: 右对齐

source: Bold
de: Fett
ru: Жирный
zh_cn: 胆大

source: Bullets
de: Aufzählungszeichen
ru: Пули
zh_cn: 项目符号

source: Copy
de: Kopieren
ru: копия
zh_cn: 复制

source: Cut
de: Ausschneiden
ru: Порез
zh_cn: 切

source: Decrease indent
de: Einzug verkleinern
ru: Уменьшить отступ
zh_cn: 减少缩进

source: Enter name
de: Namen eingeben
ru: Введите имя
zh_cn: 输入名字

source: Grow font
de: Schriftgrad vergrößern
ru: Увеличить шрифт
zh_cn: 增加字体

source: Increase indent
de: Einzug vergrößern
ru: Увеличить отступ
zh_cn: 增加缩进

source: Italic
de: Kursiv
ru: курсивный
zh_cn: 斜体

source: Lock
de: Sperren
ru: Замок
zh_cn: 锁

source: Numbering
de: Nummerierung
ru: нумерация
zh_cn: 编号

source: Paste
de: Einfügen
ru: Вставить
zh_cn: 糊

source: Redo
de: Wiederholen
ru: готовый
zh_cn: 准备

source: Shrink font
de: Schriftgrad verkleinern
ru: Термоусадочный шрифт
zh_cn: 缩小字体

source: Underline
de: Unterstreichen
ru: подчеркивание
zh_cn: 强调

source: Undo
de: Rückgängig
ru: расстегивать
zh_cn: 撤消

source: Unlock
de: Entsperren
ru: отпереть
zh_cn: 开锁

source: Colors
de: Farben
ru: Цвета
zh_cn: 色彩

source: Component overview
de: Komponentenübersicht
ru: Обзор компонентов
zh_cn: 组件概述

source: Drag
de: Ziehen
ru: Бремя
zh_cn: 拖动

source: Loading...
de: Laden...
zh_cn: 载入中...

# NewWorkspaceTooltip
source: This is a new workspace.
de: Dies ist ein neuer Arbeitsbereich
ru: Это новое рабочее пространство.
zh_cn: 这是一个新的工作区。

# ConversionAmbig
source: Conversion to different data type, ambiguity may occur
de: Konvertierung in anderen Datentyp, Mehrdeutigkeit möglich.
ru: Может произойти преобразование в другой тип данных, двусмысленность.
zh_cn: 转换为不同的数据类型，可能会产生歧义

# ConversionNone
source: Invalid connection.
de: Verbindung nicht möglich.
ru: Недействительное соединение.
zh_cn: 无效的连接。

# ConversionOK
source: OK!
ru: ОК!
zh_cn: 好！

# ConversionSame
source: Data types match.
de: Konvertierung in denselben Datentyp.
ru: Типы данных соответствуют.
zh_cn: 数据类型匹配。

# ConversionStop
source: STOP!
ru: СТОП!
zh_cn: 停！

# ConversionWarning
source: WARNING!
de: WARNUNG!
ru: ПРЕДУПРЕЖДЕНИЕ!
zh_cn: 警告！

# ConversionSelf
source: Can't connect to itself.
de: Verbindung mit sich selbst nicht möglich.
ru: Не удается подключиться к самому себе.
zh_cn: 无法连接到自身。

# CloseComponentTooltip
source: Close component
de: Komponente schließen
ru: Закрыть компонент
zh_cn: 关闭组件

source: Executing...
de: Wird ausgeführt...
ru: Выполнение ...
zh_cn: 执行中...

# BinSettingsVisual_BinSettingsVisual_No_Settings_available_
source: This component has no parameters
de: Diese Komponente hat keine Parameter
ru: Этот компонент не имеет параметров.
zh_cn: 该组件没有参数

# ElevateTooltip
source: Elevate
de: Hervorheben
ru: возвысить
zh_cn: 提升

# ReduceTooltip
source: Reduce
de: Absenken
ru: уменьшить
zh_cn: 降低

# Bring_to_FrontTooltip
source: Bring to front
de: In den Vordergrund
ru: На передний план
zh_cn: 来到前面

# Move_to_BackTooltip
source: Move to back
de: In den Hintergrund
ru: Переместить назад
zh_cn: 移回

# EditingDisabled
source: Some editing functions are disabled during execution
de: Einige Bearbeitungsfunktionen sind während der Ausführung deaktiviert
ru: Некоторые функции редактирования отключены во время выполнения
zh_cn: 执行期间某些编辑功能被禁用

# Toggle_Plugin_Parameters
source: Open/close the bar with the settings of the selected components of this workspace (Ctrl + I)
de: Öffne/schließe Leiste mit den Einstellungen der ausgewählten Komponenten dieser Arbeitsfläche (Strg + I)
ru: Открыть/закрыть панель с настройками выбранных компонентов этого рабочего пространства (Ctrl + I)
zh_cn: 使用此工作区的选定组件的设置打开/关闭栏（Ctrl + I）

source: Save File
de: Datei speichern
ru: Сохранить файл
zh_cn: 保存存档

source: Open file
de: Datei öffnen
ru: Открыть файл
zh_cn: 打开文件

# Show_ComponentConnection_Proposition
source: Show component connection propositions
de: Zeige Komponenten-Verbindungsvorschläge
ru: Показать предложения о соединении компонентов
zh_cn: 显示组件连接命题

# Show_ComponentConnection_Proposition_Tooltip
source: Shows the most frequently used components when holding a connection line
de: Zeigt die meist-verwendeten Komponenten, wenn eine Verbindungslinie gehalten wird
ru: Показывает наиболее часто используемые компоненты, удерживая линию подключения
zh_cn: 握住连接线时显示最常用的组件

# ComponentAppearanceBehaviourGroupHeader
source: Standard appearance of components
de: Standardmäßige Darstellung von Komponenten
ru: Стандартный внешний вид компонентов
zh_cn: 组件的标准外观

# ComponentAppearanceBehaviourGroupTooltip
source: Choose how a newly placed component visualization should appear
de: Auswählen wie eine neuplatzierte Komponentenvisualisierung erscheinen soll
ru: Выберите способ отображения новой размещенной компоненты
zh_cn: 选择应该如何显示新放置的组件可视化

# DefaultComponentAppearance
source: Appearance predetermined by the component
de: Erscheinung von der Komponente vorgegeben
ru: Внешний вид, предопределенный компонентом
zh_cn: 由组件预先确定的外观

# AlwaysOpenedComponentAppearance
source: Always opened
de: Immer geöffnet
ru: Всегда открыт
zh_cn: 一直开着

# AlwaysClosedComponentAppearance
source: Always closed
de: Immer geschlossen
ru: Всегда закрыт
zh_cn: 始终关闭

source: Select All
de: Alles markieren
ru: Выбрать все
zh_cn: 全选

# ResetCCS
source: Reset component connection statistics
de: Komponenten-Konnektoren-Statistik zurücksetzen
ru: Сбросить статистику подключения компонентов
zh_cn: 重置组件连接统计信息

# ComponentConnection_Delay
source: Component connection suggestion delay:
de: Verzögerung des Komponenten-Verbindungsvorschlags:
ru: Задержка предложения соединения компонента:
zh_cn: 组件连接建议延迟：

# ComponentConnection_Delay_Tooltip
source: Time to keep the mouse pointer in the same position before a popup with a component suggestion appears
de: Wie lange soll die Maus gehalten werden, damit das Vorschlagsfenster hochkommt?
ru: Время держать указатель мыши в одной позиции до появления всплывающего окна с предложением компонента
zh_cn: 在出现带有组件建议的弹出窗口之前，将鼠标指针保持在相同位置的时间

# WorkspaceManagerClass_Open_Loading_Model___0_
source: Loading model: {0}
de: Lade Model: {0}
ru: Модель загрузки: {0}
zh_cn: 载入模型：{0}

# WorkspaceManagerClass_Open_Could_not_load_Model___0_
source: Could not load model: {0}
de: Konnte Model nicht laden: {0}
ru: Не удалось загрузить модель: {0}
zh_cn: 无法加载模型：{0}

# WorkspaceManagerClass_Save_Saving_Model___0_
source: Saving model: {0}
de: Speichere Model: {0}
ru: Сохранение модели: {0}
zh_cn: 正在保存模型：{0}

# WorkspaceManagerClass_Save_Could_not_save_Model___0_
source: Could not save model: {0}
de: Konnte Model nicht speichern: {0}
ru: Не удалось сохранить модель: {0}
zh_cn: 无法保存模型：{0}

# WorkspaceManagerClass_Undo_Can_not_undo___0_
source: Can not undo: {0}
de: Undo nicht möglich: {0}
ru: Не удается отменить: {0}
zh_cn: 无法撤消：{0}

# WorkspaceManagerClass_Redo_Can_not_redo___0_
source: Can not redo: {0}
de: Redo nicht möglich: {0}
ru: Нельзя повторить: {0}
zh_cn: 无法重做：{0}

# WorkspaceManagerClass_Print_Printing_document___0___now
source: Printing document '{0}' now
de: Drucke Dokument '{0}' jetzt
ru: Печать документа '{0}' сейчас
zh_cn: 立即打印文档“ {0}”

# WorkspaceManagerClass_Print_Printed__0__pages_of_document___1__
source: Printed {0} pages of document '{1}'
de: Es wurden {0} Seiten des Dokuments '{1}' gedruckt
ru: Распечатанные {0} страницы документа '{1}'
zh_cn: 文档&#39;{1}&#39;的{0}页已打印

# WorkspaceManagerClass_Print_Exception_while_printing___0_
source: Exception while printing: {0}
de: Fehler während des Druckvorgangs: {0}
ru: Исключение во время печати: {0}
zh_cn: 打印时异常：{0}

# WorkspaceManagerClass_Execute_Execute_Model_now_
source: Execute model now!
de: Führe das Model jetzt aus!
ru: Выполните модель сейчас!
zh_cn: 立即执行模型！

# WorkspaceManagerClass_Execute_
source: GuiUpdateInterval cannot be <=0; Use GuiUpdateInterval = 1
de: GuiUpdateInterval kann nicht <=0 sein; Benutzen Sie GuiUpdateInterval >= 1
ru: GuiUpdateInterval не может быть <=0; Использовать GuiUpdateInterval = 1
zh_cn: GuiUpdateInterval不能&lt;= 0；使用GuiUpdateInterval = 1

# WorkspaceManagerClass_Execute_Could_not_set_GuiUpdateInterval___0_
source: Could not set GuiUpdateInterval: {0}
de: Konnte GuiUpdateInterval nicht setzen: {0}
ru: Не удалось установить GuiUpdateInterval: {0}
zh_cn: 无法设置GuiUpdateInterval：{0}

# WorkspaceManagerClass_Execute_SleepTime
source: Sleep time cannot be <0; Use sleep time = 0
de: SleepTime kann nicht <0 sein; Benutze SleepTime = 0
ru: SleepTime не может быть <0; Использовать SleepTime = 0
zh_cn: 睡眠时间不能小于0；使用睡眠时间= 0

# WorkspaceManagerClass_Execute_Could_not_set_SleepTime___0_
source: Could not set SleepTime: {0}
de: Konnte SleepTime nicht setzen: {0}
ru: Не удалось установить SleepTime: {0}
zh_cn: 无法设置睡眠时间：{0}

# WorkspaceManagerClass_Execute_Exception_during_the_execution___0_
source: Exception during the execution: {0}
de: Fehler während der Ausführung: {0}
ru: Исключение во время выполнения: {0}
zh_cn: 执行期间发生异常：{0}

# WorkspaceManagerClass_waitingStop_Stopping_execution_
source: Stopping execution.
de: Stoppe Ausführung
ru: Прекращение выполнения.
zh_cn: 停止执行。

source: Exception during the stopping of the execution: {0}
de: Es trat ein Fehler während des Stoppens der Ausführung auf: {0}
ru: Исключение во время остановки выполнения: {0}
zh_cn: 停止执行期间发生异常：{0}

source: Exception during stopping of the ExecutionEngine: {0}
de: Fehler während des Stoppens der Ausführungsmaschine: {0}
ru: Исключение при остановке ExecutionEngine: {0}
zh_cn: 停止执行引擎时发生异常：{0}

# WorkspaceManagerClass_Dispose_Exception_during_disposing_of_the_Model___0_
source: Exception during disposing of the model: {0}
de: Fehler während des Disposens des Models: {0}
ru: Исключение при удалении модели: {0}
zh_cn: 处置模型期间发生异常：{0}

# GlobalProgressBar_Description
source: Calculation finished after {0} (To stop the workspace please push the stop button or enter new data to start a new calculation)
de: Berechnung beendet nach {0} (Zum Anhalten des Workspaces bitte Stop drücken, oder neue Daten eingeben, um eine Neuberechnung durchzuführen)
ru: Расчет завершен после {0} (Чтобы остановить рабочее пространство, нажмите кнопку остановки или введите новые данные, чтобы начать новый расчет)
zh_cn: {0}之后计算完成（要停止工作空间，请按停止按钮或输入新数据以开始新的计算）

# Font
source: Default workspace font used by TextInput and TextOutput components
de: Standardschriftart für den Arbeitsbereich, die von Texteingabe- und Textausgabe-Komponenten verwendet wird
ru: Стандартный шрифт рабочей области, используемый компонентами TextInput и TextOutput
zh_cn: TextInput和TextOutput组件使用的默认工作空间字体

source: Global progress bar
de: Globaler Fortschrittsbalken
ru: Глобальный прогресс
zh_cn: 全球进度栏

# CompLayout_AlignBottom
source: Align bottom
de: Unten ausrichten
ru: Выровнять нижнюю часть
zh_cn: 底部对齐

# CompLayout_AlignLeft
source: Align left
de: Links ausrichten
ru: Выровнять по левому краю
zh_cn: 左对齐

# CompLayout_AlignRight
source: Align right
de: Rechts ausrichten
ru: Выровнять вправо
zh_cn: 右对齐

# CompLayout_AlignTop
source: Align top
de: Oben ausrichten
ru: Выровнять по верхнему краю
zh_cn: 对齐顶部

# CompLayout_BiggestHeight
source: Biggest height
de: Größte Höhe
ru: Самая большая высота
zh_cn: 最大身高

# CompLayout_BiggestWidth
source: Biggest width
de: Größte Breite
ru: Самая большая ширина
zh_cn: 最大宽度

# CompLayout_MoveDown
source: Move down
de: Bewege nach unten
ru: Переместить вниз
zh_cn: 下移

# CompLayout_MoveLeft
source: Move left
de: Bewege nach links
ru: Двигай влево
zh_cn: 向左移动

# CompLayout_MoveRight
source: Move right
de: Bewege nach rechts
ru: Двигаться вправо
zh_cn: 向右移

# CompLayout_MoveUp
source: Move up
de: Bewege nach oben
ru: Переместить вверх
zh_cn: 提升

# CompLayout_SmallestHeight
source: Smallest height
de: Kleinste Höhe
ru: Наименьшая высота
zh_cn: 最小高度

# CompLayout_SmallestWidth
source: Smallest width
de: Kleinste Breite
ru: Наименьшая ширина
zh_cn: 最小宽度

# CompLayout_SpreadHorizontal
source: Spread horizontal
de: Horizontal verteilen
ru: Распространение по горизонтали
zh_cn: 水平传播

# CompLayout_SpreadVertical
source: Spread vertical
de: Vertikal verteilen
ru: Распространение по вертикали
zh_cn: 垂直传播

source: days
de: Tagen
ru: дней
zh_cn: 天

source: hours
de: Stunden
ru: часов
zh_cn: 小时

source: minutes
de: Minuten
ru: минут
zh_cn: 分钟

source: seconds
de: Sekunden
ru: секунд
zh_cn: 秒

source: second
de: Sekunde
ru: второй
zh_cn: 第二

source: Rearrange all lines
de: Alle Linien neu anordnen
ru: Переставить все линии
zh_cn: 重新排列所有行

# TemplateReplacement
source: Template placeholder replacement
de: Vorlagen-Platzhalter-Ersetzung
ru: Замена заполнителя шаблона
zh_cn: 模板占位符替换

# TemplateReplacementTooltip
source: Enables/disables the replacement of template placeholders, e.g. $something$, with text of the language currently selected in CrypTool 2
de: Aktiviert/deaktiviert das Ersetzen von Vorlagen-Platzhaltern ($something$) durch den Text der aktuell in CrypTool 2 ausgewählten Sprache
ru: Активирует / деактивирует замену шаблонных заполнителей ($something$) текстом языка, выбранного в данный момент в CrypTool 2
zh_cn: 启用/禁用用CrypTool 2中当前所选语言的文本替换模板占位符，例如$ something $

# FontTooltip
source: Changes the standard font (type, size) that is used for TextInput and TextOutput components
de: Ändert die Standardschriftart (Typ, Größe), die für Texteingabe- und Textausgabe-Komponenten verwendet wird
ru: Изменяет стандартный шрифт (тип, размер), используемый для компонентов TextInput и TextOutput
zh_cn: 更改用于TextInput和TextOutput组件的标准字体（类型，大小）

# GlobalProgressBarTooltip
source: Enables/disables the global progress bar shown on top of the WorkspaceManager
de: Aktiviert/deaktiviert den globalen Fortschrittsbalken, der oben im WorkspaceManager angezeigt wird
ru: Включает/отключает глобальный индикатор выполнения, отображаемый в верхней части WorkspaceManager
zh_cn: 启用/禁用WorkspaceManager顶部显示的全局进度条

source: General workspace settings
de: Allgemeine Arbeitsplatz-Einstellungen
ru: общие настройки рабочего пространства
zh_cn: 常规工作区设置

source: User interface settings
de: Benutzerschnittstellen-Einstellung
ru: Настройки интерфейса пользователя
zh_cn: 用户界面设置

# WorkspaceManagerSettingsTitle
source: Workspace settings
de: Arbeitsplatz-Einstellungen
ru: Рабочее пространство настройки
zh_cn: 工作区设置
